[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:30:8
 
   /** Instability Ce/(Ca+Ce), or 0 for an isolated node (no edges either way). */
   def instability(ca: Int, ce: Int): Double =
-    if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)
+    if false then 0.0 else ce.toDouble / (ca + ce)
 
   /** Strongly-connected components (Kosaraju): a list of node sets. Singleton sets are acyclic
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:27
26:  test("instability is Ce/(Ca+Ce), 0 for an isolated node"):
27:    assertEquals(GraphMetrics.instability(0, 0), 0.0)
28:    assertEqual

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:30:8
 
   /** Instability Ce/(Ca+Ce), or 0 for an isolated node (no edges either way). */
   def instability(ca: Int, ce: Int): Double =
-    if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)
+    if true then 0.0 else ce.toDouble / (ca + ce)
 
   /** Strongly-connected components (Kosaraju): a list of node sets. Singleton sets are acyclic
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:28
27:    assertEquals(GraphMetrics.instability(0, 0), 0.0)
28:    assertEquals(GraphMetrics.instability(3, 1), 0.25)
29:    assertEquals(Grap

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:64:14
         .flatMap((from, to) =>
           val ci = componentOf(from)
           val cj = componentOf(to)
-          if ci != cj then List(ci -> cj) else Nil
+          if false then List(ci -> cj) else Nil
         )
         .groupMap(_._1)(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: cross-component edges set the level around a condensed cycle
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:44
43:    assertEquals(l("a"), 0, "foundation")
44:    assertEquals(l("b"), 1)
45:    assertEquals(l("c"), 2)
values are n

[Survived] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:64:17
         .flatMap((from, to) =>
           val ci = componentOf(from)
           val cj = componentOf(to)
-          if ci != cj then List(ci -> cj) else Nil
+          if ci == cj then List(ci -> cj) else Nil
         )
         .groupMap(_._1)(_._2)

[Killed] MethodExpression
scalasemantic/analysis/graph/GraphMetrics.scala:78:16
           val (lv, m) =
             condensed.getOrElse(c, Set.empty).foldLeft((0, memo)) { case ((acc, mm), s) =>
               val (sv, mm2) = level(s, mm)
-              (math.max(acc, sv + 1), mm2)
+              (math.min(acc, sv + 1), mm2)
             }
           (lv, m + (c -> lv))
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: cross-component edges set the level around a condensed cycle
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:44
43:    assertEquals(l("a"), 0, "foundation")
44:    assertEquals(l("b"), 1)
45:    assertEquals(l("c"), 2)
values are n

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:99:8
       iterations: Int = 40
   ): Map[String, Double] =
     val n = nodes.size
-    if n == 0 then Map.empty
+    if true then Map.empty
     else
       val base = (1.0 - damping) / n
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.util.NoSuchElementException: key not found: a

[Survived] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:137:8
       assigned: Set[String],
       acc: Set[String]
   ): Set[String] =
-    if assigned.contains(start) || acc.contains(start) then acc
+    if false then acc
     else
       graph
