[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:28:15
       .filter(doc => keepUri(doc.uri))
       .flatMap { doc =>
         val text =
-          if (doc.text.nonEmpty) doc.text
+          if (false) doc.text
           else {
             val p = root.resolve(doc.uri)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:28:15
       .filter(doc => keepUri(doc.uri))
       .flatMap { doc =>
         val text =
-          if (doc.text.nonEmpty) doc.text
+          if (doc.text.isEmpty) doc.text
           else {
             val p = root.resolve(doc.uri)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:31:17
           if (doc.text.nonEmpty) doc.text
           else {
             val p = root.resolve(doc.uri)
-            if (Files.exists(p))
+            if (false)
               new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
             else ""

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:31:17
           if (doc.text.nonEmpty) doc.text
           else {
             val p = root.resolve(doc.uri)
-            if (Files.exists(p))
+            if (true)
               new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
             else ""

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:35:13
               new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
             else ""
           }
-        if (text.isEmpty) Iterator.empty
+        if (text.nonEmpty) Iterator.empty
         else
           Try(dialects.Scala3(text).parse[Source].get).toOption match
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:35:13
               new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
             else ""
           }
-        if (text.isEmpty) Iterator.empty
+        if (true) Iterator.empty
         else
           Try(dialects.Scala3(text).parse[Source].get).toOption match
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:54:22
 
     // 3. Filter groups with size > 1 (i.e. duplicates exist)
     val duplicateGroups = grouped.values.iterator
-      .filter(_.size > 1)
+      .filter(_.size < 1)
       .map(_.map { case (doc, tree, enclosing) => (doc, tree, enclosing) })
       .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:100:13
         case _           => currentMethod
 
       val current =
-        if (nodeCount(t) >= minSize)
+        if (false)
           t match
             case _: Term.Block | _: Defn.Def | _: Term.Match | _: Term.For | _: Term.If |
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:51
50:
51:    assertEquals(result.groups.size, 1)
52:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:100:13
         case _           => currentMethod
 
       val current =
-        if (nodeCount(t) >= minSize)
+        if (true)
           t match
             case _: Term.Block | _: Defn.Def | _: Term.Match | _: Term.For | _: Term.If |
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: minSize is an inclusive floor, not always-true
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: minSize is an inclusive floor, not always-true: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:158 assertion failed
157:    // an absurd floor admits nothing — proves the size guard is real (not mutated to always-true).
158:    assert(DuplicationA

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:113:26
     traverse(tree, None)
 
   private def isDescendant(child: Tree, parent: Tree): Boolean =
-    if (child eq parent) false
+    if (child eq parent) true
     else parent.children.exists(c => (c eq child) || isDescendant(child, c))
 

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:121:49
       val current = t match
         case Term.Param(_, name, _, _) if name.value.nonEmpty       => List(name.value)
         case Pat.Var(Term.Name(value)) if value.nonEmpty            => List(value)
-        case Type.Param(_, name, _, _, _, _) if name.value.nonEmpty => List(name.value)
+        case Type.Param(_, name, _, _, _, _) if name.value.isEmpty => List(name.value)
         case Defn.Def(_, name, _, _, _, _) if name.value.nonEmpty   => List(name.value)
         case Defn.Val(_, pats, _, _) =>

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:122:47
         case Term.Param(_, name, _, _) if name.value.nonEmpty       => List(name.value)
         case Pat.Var(Term.Name(value)) if value.nonEmpty            => List(value)
         case Type.Param(_, name, _, _, _, _) if name.value.nonEmpty => List(name.value)
-        case Defn.Def(_, name, _, _, _, _) if name.value.nonEmpty   => List(name.value)
+        case Defn.Def(_, name, _, _, _, _) if name.value.isEmpty   => List(name.value)
         case Defn.Val(_, pats, _, _) =>
           pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:126:60
         case Defn.Val(_, pats, _, _) =>
           pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }
         case Defn.Var(_, pats, _, _) =>
-          pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }
+          pats.collect { case Pat.Var(Term.Name(value)) if value.isEmpty => value }
         case _ => Nil
       current ++ t.children.flatMap(loop)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:153:15
 
     val localReferencedNamesNoRoot = localReferencedNames.filter(n => !rootName.contains(n))
     val placeholders = localReferencedNamesNoRoot.zipWithIndex.map { case (name, idx) =>
-      name -> s"var$idx"
+      name -> ""
     }.toMap
     val nameToPlaceholder = placeholders ++ rootName.map(_ -> "root")
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.normalize: locals → varN, literals → Lit, types → Type, names kept, comma-joined
statusReason: 139:    val out = DuplicationAnalyzer.normalize(block, None)
140:    assert(out.contains("Term.Name(var0)"), s"local 'a' is placeholdered as var0: $out")
141:    assert(out.contains("Term.Name(x)"), s"a free name is kept verbatim: $out")

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:168:11
           "Type"
         case other =>
           val children = other.children.map(buildStructure).mkString(",")
-          s"${other.productPrefix}($children)"
+          ""
 
     buildStructure(tree)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:53
52:    val group = result.groups.head
53:    assertEquals(group.size, 2)
54:    assert(group.astNodeCount >= 10)
values are not
