[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:21:49
   private type NonEmptyString = String Refined NonEmpty
 
   private def nonEmpty(value: String, name: String): Either[String, NonEmptyString] =
-    refineV[NonEmpty](value.trim).left.map(_ => s"$name must be non-empty")
+    refineV[NonEmpty](value.trim).left.map(_ => "")
 
   private def nonEmptyValue(value: NonEmptyString): String = value.value
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol; com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot; com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:26 message Right() did not contain 'non-empty'
25:    assert(SemanticDbSymbol.from("local0").isRight)
26:    assertLeft(SemanticDbSymbol.from("   "), "non-

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:30:12
     def from(value: String): Either[String, SemanticDbSymbol] =
       nonEmpty(value, "SemanticDB symbol").flatMap { s =>
         val symbol = s.value
-        if symbol.isGlobal || symbol.isLocal then Right(s)
+        if false then Right(s)
         else Left(s"invalid SemanticDB symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol; com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global; com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:24 assertion failed
23:  test("SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol"):
24:    assert(SemanticDbSymbol.from("com/exa

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:42:19
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
         if raw.isGlobal && raw.desc.isMethod then Right(symbol)
-        else Left(s"expected method symbol: $value")
+        else Left("")
       }
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:32 message Right() did not contain 'expected method symbol'
31:    assert(MethodSymbol.from("com/example/Foo#bar().").isRight)
32:    assertLeft(MethodSymbol.from("

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:52:12
     def from(value: String): Either[String, TypeSymbol] =
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
-        if raw.isGlobal && raw.desc.isType then Right(symbol)
+        if true then Right(symbol)
         else Left(s"expected type symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:37 expected Left, got Right(com/example/Foo#bar().)
36:    assert(TypeSymbol.from("com/example/Foo#").isRight)
37:    assertLeft(TypeSymbol.from("com/example/Foo#bar()."), "expected t

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:62:14
   object PackageSymbol:
     def from(value: String): Either[String, PackageSymbol] =
       val normalized = value.trim match
-        case "" => ""
+        case "Stryker was here!" => ""
         case s  => if s.endsWith("/") then s else s"$s/"
       if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:40
39:  test("PackageSymbol.from: blank -> empty, appends slash, rejects non-package"):
40:    assertEquals(PackageSymbol.from("").toOption.map(_.value

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:63:23
     def from(value: String): Either[String, PackageSymbol] =
       val normalized = value.trim match
         case "" => ""
-        case s  => if s.endsWith("/") then s else s"$s/"
+        case s  => if false then s else s"$s/"
       if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
       else Left(s"invalid package symbol: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:42
41:    assertEquals(PackageSymbol.from("  ").toOption.map(_.value), Some(""))
42:    assertEquals(PackageSymbol.from("com/example/").toOption.map(_.

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:63:23
     def from(value: String): Either[String, PackageSymbol] =
       val normalized = value.trim match
         case "" => ""
-        case s  => if s.endsWith("/") then s else s"$s/"
+        case s  => if true then s else s"$s/"
       if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
       else Left(s"invalid package symbol: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:43
42:    assertEquals(PackageSymbol.from("com/example/").toOption.map(_.value), Some("com/example/"))
43:    assertEquals(PackageSymbol.from("com/exam

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:64:29
       val normalized = value.trim match
         case "" => ""
         case s  => if s.endsWith("/") then s else s"$s/"
-      if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
+      if normalized.isEmpty && (normalized.isGlobal && normalized.isPackage) then Right(normalized)
       else Left(s"invalid package symbol: $value")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:40
39:  test("PackageSymbol.from: blank -> empty, appends slash, rejects non-package"):
40:    assertEquals(PackageSymbol.from("").toOption.map(_.value

[Killed] MethodExpression
mercurievv/scalasemantic/model/InputTypes.scala:64:10
       val normalized = value.trim match
         case "" => ""
         case s  => if s.endsWith("/") then s else s"$s/"
-      if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
+      if normalized.nonEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
       else Left(s"invalid package symbol: $value")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:40
39:  test("PackageSymbol.from: blank -> empty, appends slash, rejects non-package"):
40:    assertEquals(PackageSymbol.from("").toOption.map(_.value

[Survived] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:65:17
         case "" => ""
         case s  => if s.endsWith("/") then s else s"$s/"
       if normalized.isEmpty || (normalized.isGlobal && normalized.isPackage) then Right(normalized)
-      else Left(s"invalid package symbol: $value")
+      else Left("")
 
     extension (symbol: PackageSymbol) def value: String = symbol

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:76:16
         val path = uri.value
         if path.startsWith("/") then Left(s"document uri must be relative: $value")
         else if path.split('/').contains("..") then
-          Left(s"document uri must not contain '..': $value")
+          Left("")
         else Right(uri)
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:53 message Right() did not contain 'must not contain'
52:    assertLeft(DocumentUri.from("/etc/passwd"), "must be relative")
53:    assertLeft(DocumentUri.from("a/.

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:99:17
     def characterValue: Int = character.value
 
     def before(other: SourcePosition): Boolean =
-      lineValue < other.lineValue ||
+      lineValue > other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:69 earlier line wins
68:    assert(pos(1, 2).before(pos(1, 3)), "same line, later char")
69:    assert(pos(1, 2).before(pos(2, 0)), "earlier line wins")
70:    assert(!pos

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:99:17
     def characterValue: Int = character.value
 
     def before(other: SourcePosition): Boolean =
-      lineValue < other.lineValue ||
+      lineValue == other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:69 earlier line wins
68:    assert(pos(1, 2).before(pos(1, 3)), "same line, later char")
69:    assert(pos(1, 2).before(pos(2, 0)), "earlier line wins")
70:    assert(!pos

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:100:20
 
     def before(other: SourcePosition): Boolean =
       lineValue < other.lineValue ||
-        (lineValue == other.lineValue && characterValue < other.characterValue)
+        (lineValue != other.lineValue && characterValue < other.characterValue)
 
     def atOrBefore(line: Int, character: Int): Boolean =
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:68 same line, later char
67:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
68:    assert(pos(1, 2).before(pos(1, 3)), "same line, later char")
69:

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:100:57
 
     def before(other: SourcePosition): Boolean =
       lineValue < other.lineValue ||
-        (lineValue == other.lineValue && characterValue < other.characterValue)
+        (lineValue == other.lineValue && characterValue <= other.characterValue)
 
     def atOrBefore(line: Int, character: Int): Boolean =
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:70 equal is not before
69:    assert(pos(1, 2).before(pos(2, 0)), "earlier line wins")
70:    assert(!pos(1, 2).before(pos(1, 2)), "equal is not before")
71:    assert(!po

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:103:17
         (lineValue == other.lineValue && characterValue < other.characterValue)
 
     def atOrBefore(line: Int, character: Int): Boolean =
-      lineValue < line ||
+      lineValue <= line ||
         (lineValue == line && characterValue <= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:79 same line, earlier char
78:    assert(pos(1, 2).atOrBefore(2, 0), "earlier line")
79:    assert(!pos(1, 2).atOrBefore(1, 1), "same line, earlier char")
80:    assert(!pos(1,

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:103:24
         (lineValue == other.lineValue && characterValue < other.characterValue)
 
     def atOrBefore(line: Int, character: Int): Boolean =
-      lineValue < line ||
+      lineValue < line &&
         (lineValue == line && characterValue <= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:76 equal counts
75:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
76:    assert(pos(1, 2).atOrBefore(1, 2), "equal counts")
77:    assert(pos(1, 2).atOrBef

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:107:17
         (lineValue == line && characterValue <= character)
 
     def atOrAfter(line: Int, character: Int): Boolean =
-      lineValue > line ||
+      lineValue < line ||
         (lineValue == line && characterValue >= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:86 later line
85:    assert(pos(1, 3).atOrAfter(1, 2), "same line, earlier target char")
86:    assert(pos(2, 0).atOrAfter(1, 9), "later line")
87:    assert(!pos(1, 2).atOrAfter

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:107:17
         (lineValue == line && characterValue <= character)
 
     def atOrAfter(line: Int, character: Int): Boolean =
-      lineValue > line ||
+      lineValue == line ||
         (lineValue == line && characterValue >= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:86 later line
85:    assert(pos(1, 3).atOrAfter(1, 2), "same line, earlier target char")
86:    assert(pos(2, 0).atOrAfter(1, 9), "later line")
87:    assert(!pos(1, 2).atOrAfter

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:108:46
 
     def atOrAfter(line: Int, character: Int): Boolean =
       lineValue > line ||
-        (lineValue == line && characterValue >= character)
+        (lineValue == line && characterValue > character)
 
   object SourcePosition:
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:84 equal counts
83:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
84:    assert(pos(1, 2).atOrAfter(1, 2), "equal counts")
85:    assert(pos(1, 3).atOrAfter

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:108:20
 
     def atOrAfter(line: Int, character: Int): Boolean =
       lineValue > line ||
-        (lineValue == line && characterValue >= character)
+        (lineValue != line && characterValue >= character)
 
   object SourcePosition:
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:84 equal counts
83:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
84:    assert(pos(1, 2).atOrAfter(1, 2), "equal counts")
85:    assert(pos(1, 3).atOrAfter

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:113:40
   object SourcePosition:
     def from(line: Int, character: Int): Either[String, SourcePosition] =
       for
-        l <- NonNegativeInt.from(line, "line")
+        l <- NonNegativeInt.from(line, "")
         c <- NonNegativeInt.from(character, "character")
       yield SourcePosition(l, c)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.from rejects a negative line or character
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.from rejects a negative line or character: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:91 message Right( must be >= 0: -1) did not contain 'line'
90:  test("SourcePosition.from rejects a negative line or character"):
91:    assertLeft(SourcePosition.from(-1, 0),

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:129:51
         endLine: Int,
         endCharacter: Int
     ): Boolean =
-      start.atOrBefore(startLine, startCharacter) &&
+      start.atOrBefore(startLine, startCharacter) ||
         end.atOrAfter(endLine, endCharacter)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:99 a span starting before is not contained
98:     assert(r.contains(1, 2, 2, 1), "an inner span is contained")
99:     assert(!r.contains(0, 0, 2, 5),

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:146:14
         start <- SourcePosition.from(startLine, startCharacter)
         end <- SourcePosition.from(endLine, endCharacter)
         range <-
-          if before(start, end) then Right(SourceRange(start, end))
+          if true then Right(SourceRange(start, end))
           else Left("range end must be after range start")
       yield range
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: 102:    assert(!r.startsAtOrAfterEnd(1, 4), "a mid position is before the end")
103:    assertLeft(SourceRange.from(2, 0, 1, 0), "after")
104:    assertLeft(SourceRange.from(1, 5, 1, 5), "after") // empty range rejected

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:146:14
         start <- SourcePosition.from(startLine, startCharacter)
         end <- SourcePosition.from(endLine, endCharacter)
         range <-
-          if before(start, end) then Right(SourceRange(start, end))
+          if false then Right(SourceRange(start, end))
           else Left("range end must be after range start")
       yield range
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.util.NoSuchElementException: None.get

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:205:23
     )
 
     def from(value: String): Either[String, ScalaIdentifier] =
-      nonEmpty(value, "Scala identifier").flatMap { refined =>
+      nonEmpty(value, "").flatMap { refined =>
         val name = refined.value
         val valid =
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: 113:    assertLeft(ScalaIdentifier.from("   "), "non-empty")
114:    assertLeft(ScalaIdentifier.from("   "), "Scala identifier") // the field name is in the message
115:

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:248:14
     def from(value: String): Either[String, StructureSort] =
       value.trim match
         case ""            => Right(Afferent)
-        case "afferent"    => Right(Afferent)
+        case ""    => Right(Afferent)
         case "efferent"    => Right(Efferent)
         case "instability" => Right(Instability)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:129
128:    assertEquals(StructureSort.from(""), Right(Afferent))
129:    assertEquals(StructureSort.from("afferent"), Right(Afferent))
130:    assertEqu
