[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:23:46
       case (_, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => occ.symbol
     }.toSet
     index.symbols.values.iterator.collect {
-      case si if defined.contains(si.symbol) && isClass(si) => si.symbol
+      case si if defined.contains(si.symbol) || isClass(si) => si.symbol
     }.toSet
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:144
143:  test("DependencyGraphs.nodes are the in-project classes only"):
144:    assertEquals(graphs.nodes, Set("core/A#", "core/B#", "c

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:40:61
 
   /** Module of a type: the leading path segment of its definition uri (e.g. `core`, `analysis`). */
   def moduleOf(symbol: String): String =
-    definitionUri(symbol).map(_.takeWhile(_ != '/')).filter(_.nonEmpty).getOrElse("<unknown>")
+    definitionUri(symbol).map(_.takeWhile(_ != '/')).filter(_.isEmpty).getOrElse("<unknown>")
 
   // --- per-dimension extraction ---------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:161
160:    assertEquals(graphs.combined("core/B#"), Set("core/A#"))
161:    assertEquals(graphs.moduleOf("core/

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:47:12
   /** `extends`: a type → the in-project types it directly extends. */
   private def extendsGraph: Graph =
     nodes.iterator.map { n =>
-      n -> parentsOf(n).filter(p => p != n && nodes.contains(p)).toSet
+      n -> parentsOf(n).filterNot(p => p != n && nodes.contains(p)).toSet
     }.toMap
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:147
146:  test("DependencyGraphs: one graph per dimension"):
147:    assertEquals(graphs.dimensions("extends")("app/C#"), Set("core/A#"))
148:    asse

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:84:15
     val lifted = typeEdges.toList.flatMap { (caller, callee) =>
       val from = index.owner(caller)
       val to = index.owner(callee)
-      if from != to && nodes.contains(from) && nodes.contains(to) then List(from -> to) else Nil
+      if from == to && nodes.contains(from) && nodes.contains(to) then List(from -> to) else Nil
     }
     lifted.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:150
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set("core/A#"))
150:    assertEquals(graphs.dimensions("call")("app/C#"), Set("co

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:84:10
     val lifted = typeEdges.toList.flatMap { (caller, callee) =>
       val from = index.owner(caller)
       val to = index.owner(callee)
-      if from != to && nodes.contains(from) && nodes.contains(to) then List(from -> to) else Nil
+      if false then List(from -> to) else Nil
     }
     lifted.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: app/C#

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:93:10
     */
   private def implicitGraph: Graph =
     val edges = index.symbols.values.toList.flatMap { si =>
-      if !isImplicit(si) then Nil
+      if true then Nil
       else
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:93:10
     */
   private def implicitGraph: Graph =
     val edges = index.symbols.values.toList.flatMap { si =>
-      if !isImplicit(si) then Nil
+      if false then Nil
       else
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a non-implicit method with an implicit param creates no implicit edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a non-implicit method with an implicit param creates no implicit edge: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:302
301:    val g = new DependencyGraphs(SemanticIndex(Vector(doc)))
302:    assertEquals(g.dimensions("imp

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:95:24
     val edges = index.symbols.values.toList.flatMap { si =>
       if !isImplicit(si) then Nil
       else
-        val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
+        val owner = if true then si.symbol else index.owner(si.symbol)
         if !nodes.contains(owner) then Nil
         else
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Survived] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:95:24
     val edges = index.symbols.values.toList.flatMap { si =>
       if !isImplicit(si) then Nil
       else
-        val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
+        val owner = if false then si.symbol else index.owner(si.symbol)
         if !nodes.contains(owner) then Nil
         else

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:96:12
       if !isImplicit(si) then Nil
       else
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
-        if !nodes.contains(owner) then Nil
+        if true then Nil
         else
           implicitDependencyTypes(si).filter(t => t != owner && nodes.contains(t)).map(owner -> _)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:96:12
       if !isImplicit(si) then Nil
       else
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
-        if !nodes.contains(owner) then Nil
+        if false then Nil
         else
           implicitDependencyTypes(si).filter(t => t != owner && nodes.contains(t)).map(owner -> _)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: an implicit whose owner is not a project node is dropped
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: an implicit whose owner is not a project node is dropped: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:319
318:    val g = new DependencyGraphs(SemanticIndex(Vector(doc)))
319:    assertEquals(g.dimensions("implicit"), Map.

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:98:62
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
         if !nodes.contains(owner) then Nil
         else
-          implicitDependencyTypes(si).filter(t => t != owner && nodes.contains(t)).map(owner -> _)
+          implicitDependencyTypes(si).filter(t => t != owner || nodes.contains(t)).map(owner -> _)
     }
     edges.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:336 assertion failed
335:    val g = new DependencyGraphs(SemanticIndex(Vector(doc)))
336:    assert(!g.dimensions("implicit").getOr

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:98:53
         val owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
         if !nodes.contains(owner) then Nil
         else
-          implicitDependencyTypes(si).filter(t => t != owner && nodes.contains(t)).map(owner -> _)
+          implicitDependencyTypes(si).filter(t => t == owner && nodes.contains(t)).map(owner -> _)
     }
     edges.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:168:10
 
   private def scopeInfos(scope: Option[s.Scope]): Seq[s.SymbolInformation] =
     scope.toSeq.flatMap { sc =>
-      if sc.hardlinks.nonEmpty then sc.hardlinks else sc.symlinks.flatMap(index.info)
+      if true then sc.hardlinks else sc.symlinks.flatMap(index.info)
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:149
148:    assertEquals(graphs.dimensions("extends")("core/X#"), Set("core/Y#"))
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:182:37
 
   private def definitionUri(symbol: String): Option[String] =
     index.occurrences.collectFirst {
-      case (uri, occ) if occ.symbol == symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.symbol != symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
         uri
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:162
161:    assertEquals(graphs.moduleOf("core/A#"), "core")
162:    assertEquals(graphs.moduleOf("app/C#"), "ap
