[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:85:5
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
     val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
-    structureResult.symbols
-      .filter(s => keepModule(s.module))
-      .map(s => s -> selectedMetrics(s, dimension))
-      .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
-      .take(limit.value)
+    structureResult.symbols.filter(s => keepModule(s.module)).map(s => s -> selectedMetrics(s, dimension)).sortBy((_, metrics) => -rankStructureMetrics(metrics, sort)).drop(limit.value)
 
   private lazy val structureResult: StructureResult = StructureMetrics(index).result()
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:212
211:      .map((sym, _) => sym.displayName)
212:    assertEquals(byAfferent, List("A"), "A (depended on) ranks highest by afferent, li

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:85:5
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
     val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
-    structureResult.symbols
-      .filter(s => keepModule(s.module))
+    structureResult.symbols.filterNot(s => keepModule(s.module))
       .map(s => s -> selectedMetrics(s, dimension))
       .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:212
211:      .map((sym, _) => sym.displayName)
212:    assertEquals(byAfferent, List("A"), "A (depended on) ranks highest by afferent, li

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:136:12
       val definedSet = defs.map(_._1).toSet
       def parentOf(sym: String): Option[String] =
         val o = index.owner(sym)
-        if definedSet.contains(o) then Some(o) else None
+        if true then Some(o) else None
       def build(sym: String, line: Int): OutlineEntry =
         val kids = defs.filter((c, _) => parentOf(c).contains(sym)).sortBy(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:136:12
       val definedSet = defs.map(_._1).toSet
       def parentOf(sym: String): Option[String] =
         val o = index.owner(sym)
-        if definedSet.contains(o) then Some(o) else None
+        if false then Some(o) else None
       def build(sym: String, line: Int): OutlineEntry =
         val kids = defs.filter((c, _) => parentOf(c).contains(sym)).sortBy(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:439:50
             Parameter(p.displayName, h.renderType(h.valueType(p)), h.isImplicit(p))
           }
           .toList
-        ParameterList(params, params.nonEmpty && params.forall(_.isImplicit))
+        ParameterList(params, params.nonEmpty && params.exists(_.isImplicit))
       }.toList
       val ret = h.renderType(m.returnType)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:133
132:      List(false)
133:    )
134:
values are not the same
=> Obtained
List(
  true

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:491:62
       .collect {
         case si
             if index
-              .isMethod(si.symbol) && index.owner(si.symbol) == own && si.displayName == name =>
+              .isMethod(si.symbol) && index.owner(si.symbol) != own && si.displayName == name =>
           si.symbol
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone): munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:145
144:    assertEquals(o.name, "put")
145:    assertEquals(o.overloads.map(_.symbol), List(s"${P}Box#put().", s"${P}Box#put(+1)."))
146:    as

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:604:14
         case Nil => Nil
         case path :: rest =>
           val node = path.head
-          if node == toSym then path.reverse
+          if true then path.reverse
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:604:19
         case Nil => Nil
         case path :: rest =>
           val node = path.head
-          if node == toSym then path.reverse
+          if node != toSym then path.reverse
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:608:28
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
             bfs(rest ::: nexts.map(_ :: path), seen ++ nexts)
-    val nodes = if fromSym == toSym then List(fromSym) else bfs(List(List(fromSym)), Set(fromSym))
+    val nodes = if fromSym != toSym then List(fromSym) else bfs(List(List(fromSym)), Set(fromSym))
     val edges = nodes
       .zip(nodes.drop(1))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:608:20
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
             bfs(rest ::: nexts.map(_ :: path), seen ++ nexts)
-    val nodes = if fromSym == toSym then List(fromSym) else bfs(List(List(fromSym)), Set(fromSym))
+    val nodes = if true then List(fromSym) else bfs(List(List(fromSym)), Set(fromSym))
     val edges = nodes
       .zip(nodes.drop(1))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"
