[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:31:83
 
   def includeInOutline(symbol: String): Boolean =
     index.info(symbol).exists { si =>
-      outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName != "<init>"
+      outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName == "<init>"
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:64:17
               SourceAnnotation(
                 r.startLine,
                 r.startCharacter,
-                "implicit",
+                "",
                 args.mkString("(using ", ", ", ")")
               )

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:95:8
       occ: s.SymbolOccurrence,
       sourceLines: IndexedSeq[String]
   ): Option[SourceAnnotation] =
-    if occ.role != s.SymbolOccurrence.Role.DEFINITION then None
+    if true then None
     else
       index

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:108:31
           val rendered = renderType(tpe)
           val r = occ.range.getOrElse(s.Range.defaultInstance)
           val line = sourceLines.lift(r.startLine).getOrElse("")
-          if rendered.isEmpty || alreadyAscribed(line, r.startCharacter) then None
+          if rendered.isEmpty && alreadyAscribed(line, r.startCharacter) then None
           else
             Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", s": $rendered"))

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:127:33
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
           case _                 => scan(i + 1, depth)
-    nameStart >= 0 && nameStart < line.length && scan(nameStart, 0)
+    nameStart >= 0 && nameStart > line.length && scan(nameStart, 0)
 
   // --- move plan ------------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:95 explicit ascription
94:  test("alreadyAscribed finds a top-level colon before the body's ="):
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "expl

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:127:20
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
           case _                 => scan(i + 1, depth)
-    nameStart >= 0 && nameStart < line.length && scan(nameStart, 0)
+    nameStart >= 0 || nameStart < line.length && scan(nameStart, 0)
 
   // --- move plan ------------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: java.lang.StringIndexOutOfBoundsException: Index -1 out of bounds for length 9

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:133:27
 
   /** A package symbol (`com/foo/bar/`) as a dotted name (`com.foo.bar`); empty for the root. */
   def packageDotted(pkgSymbol: String): String =
-    pkgSymbol.stripSuffix("/").replace('/', '.')
+    pkgSymbol.stripSuffix("").replace('/', '.')
 
   def joinFqn(pkg: String, name: String): String =
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:143
142:    val plan = az.movePlan(sym, dest)
143:    assertEquals(plan.fromFqn, "m.pkg.Foo")
144:    assertEquals(plan.toFqn, "m.dest.Foo"

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:136:8
     pkgSymbol.stripSuffix("/").replace('/', '.')
 
   def joinFqn(pkg: String, name: String): String =
-    if pkg.isEmpty then name else s"$pkg.$name"
+    if true then name else s"$pkg.$name"
 
   /** The package a document belongs to: the owner of its first top-level global definition. `None`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:143
142:    val plan = az.movePlan(sym, dest)
143:    assertEquals(plan.fromFqn, "m.pkg.Foo")
144:    assertEquals(plan.toFqn, "m.dest.Foo"

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:136:8
     pkgSymbol.stripSuffix("/").replace('/', '.')
 
   def joinFqn(pkg: String, name: String): String =
-    if pkg.isEmpty then name else s"$pkg.$name"
+    if false then name else s"$pkg.$name"
 
   /** The package a document belongs to: the owner of its first top-level global definition. `None`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.packageDotted and joinFqn
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.packageDotted and joinFqn: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:105
104:    assertEquals(h.packageDotted(""), "")
105:    assertEquals(h.joinFqn("", "X"), "X")
106:    assertEquals(h.joinFqn("com.foo", "X"), "com.foo.X")
values are not the same

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:295:50
     MemberInfo(member, index.displayName(member), kindName(member), symbolRef(declaredIn))
 
   def rangeContains(r: s.Range, line: Int, character: Int): Boolean =
-    val afterStart = line > r.startLine || (line == r.startLine && character >= r.startCharacter)
+    val afterStart = line > r.startLine || (line != r.startLine && character >= r.startCharacter)
     val beforeEnd = line < r.endLine || (line == r.endLine && character < r.endCharacter)
     afterStart && beforeEnd
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:231 nothing at position
230:    val pos = SourcePosition.from(1, 2).fold(fail(_), identity)
231:    val at = az.typeAtPosition(docUri("t.scala"), pos).getOr

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:295:27
     MemberInfo(member, index.displayName(member), kindName(member), symbolRef(declaredIn))
 
   def rangeContains(r: s.Range, line: Int, character: Int): Boolean =
-    val afterStart = line > r.startLine || (line == r.startLine && character >= r.startCharacter)
+    val afterStart = line == r.startLine || (line == r.startLine && character >= r.startCharacter)
     val beforeEnd = line < r.endLine || (line == r.endLine && character < r.endCharacter)
     afterStart && beforeEnd
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:83 an interior line is contained
82:    assert(h.rangeContains(r, 1, 2), "start boundary is contained")
83:    assert(h.rangeContains(r, 2, 9), "an interior line

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:296:26
 
   def rangeContains(r: s.Range, line: Int, character: Int): Boolean =
     val afterStart = line > r.startLine || (line == r.startLine && character >= r.startCharacter)
-    val beforeEnd = line < r.endLine || (line == r.endLine && character < r.endCharacter)
+    val beforeEnd = line <= r.endLine || (line == r.endLine && character < r.endCharacter)
     afterStart && beforeEnd
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:87 the end position itself is excluded
86:    assert(!h.rangeContains(r, 0, 9), "an earlier line is excluded")
87:    assert(!h.rangeContains(r, 3, 4), "the end p

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:296:73
 
   def rangeContains(r: s.Range, line: Int, character: Int): Boolean =
     val afterStart = line > r.startLine || (line == r.startLine && character >= r.startCharacter)
-    val beforeEnd = line < r.endLine || (line == r.endLine && character < r.endCharacter)
+    val beforeEnd = line < r.endLine || (line == r.endLine && character <= r.endCharacter)
     afterStart && beforeEnd
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:87 the end position itself is excluded
86:    assert(!h.rangeContains(r, 0, 9), "an earlier line is excluded")
87:    assert(!h.rangeContains(r, 3, 4), "the end p

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:297:16
   def rangeContains(r: s.Range, line: Int, character: Int): Boolean =
     val afterStart = line > r.startLine || (line == r.startLine && character >= r.startCharacter)
     val beforeEnd = line < r.endLine || (line == r.endLine && character < r.endCharacter)
-    afterStart && beforeEnd
+    afterStart || beforeEnd
 
   def rangeSpan(r: s.Range): Int =
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:85 before the start char is excluded
84:    assert(h.rangeContains(r, 3, 3), "just before the end is contained")
85:    assert(!h.rangeContains(r, 1, 1), "before

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:352:30
     val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
       val prefix = if pl.isImplicit then "implicit " else ""
-      pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
+      pl.parameters.map(p => "").mkString(s"($prefix", ", ", ")")
     }.mkString
     s"def $name$tp$ps: $ret"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:65
64:      "def f(x: Int): Int"
65:    )
66:    assertEquals(
values are not the same
=> Obtained
def f(): Int
=> Diff (- expected, + obtained)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:390:36
       case s.ShortConstant(v)   => v.toString
       case s.ByteConstant(v)    => v.toString
       case s.UnitConstant()     => "Unit"
-      case s.NullConstant()     => "null"
+      case s.NullConstant()     => ""
       case _                    => ""
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:58
57:    assertEquals(h.renderConstant(s.UnitConstant()), "Unit")
58:    assertEquals(h.renderConstant(s.NullConstant()), "null")
59:
Obtained empty output!
=> Expected:

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:391:36
       case s.ByteConstant(v)    => v.toString
       case s.UnitConstant()     => "Unit"
       case s.NullConstant()     => "null"
-      case _                    => ""
+      case _                    => "Stryker was here!"
 
