[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:43:16
     */
   @pure
   def instability(ca: Int, ce: Int): Double =
-    require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
+    require(ca < 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:43:16
     */
   @pure
   def instability(ca: Int, ce: Int): Double =
-    require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
+    require(ca > 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.IllegalArgumentException: requirement failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/PureKernels.scala:44:9
   @pure
   def instability(ca: Int, ce: Int): Double =
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
-    (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
+    (if false then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:44:17
   @pure
   def instability(ca: Int, ce: Int): Double =
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
-    (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
+    (if ca + ce != 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:45:21
   def instability(ca: Int, ce: Int): Double =
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
-      r >= 0.0 && r <= 1.0 &&
+      r >= 0.0 && r >= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
         (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:45:9
   def instability(ca: Int, ce: Int): Double =
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
-      r >= 0.0 && r <= 1.0 &&
+      r > 0.0 && r <= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
         (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:46:23
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
-        (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
+        (ce != 0 || r != 0.0) && // ce == 0  ==> r == 0.0
         (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:46:13
     require(ca >= 0 && ce >= 0 && ca <= Int.MaxValue - ce)
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
-        (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
+        (ce == 0 || r == 0.0) && // ce == 0  ==> r == 0.0
         (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:47:34
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
-        (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
+        (ca != 0 || ce == 0 || r != 1.0) // ca == 0 && ce > 0  ==> r == 1.0
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:47:29
     (if ca + ce == 0 then 0.0 else ce.toDouble / (ca + ce)).ensuring(r =>
       r >= 0.0 && r <= 1.0 &&
         (ce != 0 || r == 0.0) && // ce == 0  ==> r == 0.0
-        (ca != 0 || ce == 0 || r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
+        (ca != 0 || ce == 0 && r == 1.0) // ca == 0 && ce > 0  ==> r == 1.0
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.instability is Ce/(Ca+Ce), 0 for an isolated node: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:67:69
     */
   @pure
   def pageRankBase(damping: Double, n: Int): Double =
-    require(!damping.isNaN && damping >= 0.0 && damping <= 1.0 && n > 0)
+    require(!damping.isNaN && damping >= 0.0 && damping <= 1.0 && n == 0)
     ((1.0 - damping) / n).ensuring(r => r >= 0.0 && r <= 1.0)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:67:57
     */
   @pure
   def pageRankBase(damping: Double, n: Int): Double =
-    require(!damping.isNaN && damping >= 0.0 && damping <= 1.0 && n > 0)
+    require(!damping.isNaN && damping >= 0.0 && damping == 1.0 && n > 0)
     ((1.0 - damping) / n).ensuring(r => r >= 0.0 && r <= 1.0)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:68:55
   @pure
   def pageRankBase(damping: Double, n: Int): Double =
     require(!damping.isNaN && damping >= 0.0 && damping <= 1.0 && n > 0)
-    ((1.0 - damping) / n).ensuring(r => r >= 0.0 && r <= 1.0)
+    ((1.0 - damping) / n).ensuring(r => r >= 0.0 && r >= 1.0)
 
   /** Whether a 0-based `(line, character)` position falls inside the half-open range
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:68:43
   @pure
   def pageRankBase(damping: Double, n: Int): Double =
     require(!damping.isNaN && damping >= 0.0 && damping <= 1.0 && n > 0)
-    ((1.0 - damping) / n).ensuring(r => r >= 0.0 && r <= 1.0)
+    ((1.0 - damping) / n).ensuring(r => r < 0.0 && r <= 1.0)
 
   /** Whether a 0-based `(line, character)` position falls inside the half-open range
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:92:35
       character: Int
   ): Boolean =
     require(
-      startLine >= 0 && startChar >= 0 && endLine >= startLine &&
+      startLine >= 0 && startChar == 0 && endLine >= startLine &&
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:92:51
       character: Int
   ): Boolean =
     require(
-      startLine >= 0 && startChar >= 0 && endLine >= startLine &&
+      startLine >= 0 && startChar >= 0 && endLine > startLine &&
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:93:41
   ): Boolean =
     require(
       startLine >= 0 && startChar >= 0 && endLine >= startLine &&
-        (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
+        (endLine > startLine || endChar == startChar) && line >= 0 && character >= 0
     )
     val afterStart = line > startLine || (line == startLine && character >= startChar)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:93:81
   ): Boolean =
     require(
       startLine >= 0 && startChar >= 0 && endLine >= startLine &&
-        (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
+        (endLine > startLine || endChar >= startChar) && line >= 0 && character > 0
     )
     val afterStart = line > startLine || (line == startLine && character >= startChar)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:95:74
       startLine >= 0 && startChar >= 0 && endLine >= startLine &&
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
-    val afterStart = line > startLine || (line == startLine && character >= startChar)
+    val afterStart = line > startLine || (line == startLine && character < startChar)
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:231 nothing at position
230:    val pos = SourcePosition.from(1, 2).fold(fail(_), identity)
231:    val at = az.typeAtPosition(docUri("t.scala"), pos).getOr

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:95:39
       startLine >= 0 && startChar >= 0 && endLine >= startLine &&
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
-    val afterStart = line > startLine || (line == startLine && character >= startChar)
+    val afterStart = line > startLine && (line == startLine && character >= startChar)
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:231 nothing at position
230:    val pos = SourcePosition.from(1, 2).fold(fail(_), identity)
231:    val at = az.typeAtPosition(docUri("t.scala"), pos).getOr

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:96:45
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
     val afterStart = line > startLine || (line == startLine && character >= startChar)
-    val beforeEnd = line < endLine || (line == endLine && character < endChar)
+    val beforeEnd = line < endLine || (line != endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:231 nothing at position
230:    val pos = SourcePosition.from(1, 2).fold(fail(_), identity)
231:    val at = az.typeAtPosition(docUri("t.scala"), pos).getOr

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:96:26
         (endLine > startLine || endChar >= startChar) && line >= 0 && character >= 0
     )
     val afterStart = line > startLine || (line == startLine && character >= startChar)
-    val beforeEnd = line < endLine || (line == endLine && character < endChar)
+    val beforeEnd = line <= endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:87 the end position itself is excluded
86:    assert(!h.rangeContains(r, 0, 9), "an earlier line is excluded")
87:    assert(!h.rangeContains(r, 3, 4), "the end p

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:97:17
     )
     val afterStart = line > startLine || (line == startLine && character >= startChar)
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
-    (afterStart && beforeEnd).ensuring(res =>
+    (afterStart || beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
         (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:98:12
     val afterStart = line > startLine || (line == startLine && character >= startChar)
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
-      (res == (afterStart && beforeEnd)) &&
+      (res != (afterStart && beforeEnd)) &&
         (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
         (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:98:27
     val afterStart = line > startLine || (line == startLine && character >= startChar)
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
-      (res == (afterStart && beforeEnd)) &&
+      (res == (afterStart || beforeEnd)) &&
         (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
         (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: java.lang.AssertionError: assertion failed

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:99:15
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
-        (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
+        (!res && (line >= startLine && line <= endLine)) && // res ==> inside line span
         (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:99:45
     val beforeEnd = line < endLine || (line == endLine && character < endChar)
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
-        (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
+        (!res || (line >= startLine && line >= endLine)) && // res ==> inside line span
         (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains: a char past the start on the start line, before the end, is inside
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeContains is inclusive at start, exclusive at end: java.lang.AssertionError: assertion failed

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:100:58
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
         (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
-        (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
+        (!(startLine == endLine && startChar == endChar) && !res) // empty range contains nothing
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:100:46
     (afterStart && beforeEnd).ensuring(res =>
       (res == (afterStart && beforeEnd)) &&
         (!res || (line >= startLine && line <= endLine)) && // res ==> inside line span
-        (!(startLine == endLine && startChar == endChar) || !res) // empty range contains nothing
+        (!(startLine == endLine && startChar != endChar) || !res) // empty range contains nothing
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:121:33
   @pure
   def rangeSpan(startLine: Int, endLine: Int, startChar: Int, endChar: Int): Long =
     require(
-      startLine >= 0 && endLine >= startLine &&
+      startLine >= 0 && endLine == startLine &&
         startChar >= 0 && endChar >= 0 &&
         (if endLine == startLine then endChar >= startChar
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:121:33
   @pure
   def rangeSpan(startLine: Int, endLine: Int, startChar: Int, endChar: Int): Long =
     require(
-      startLine >= 0 && endLine >= startLine &&
+      startLine >= 0 && endLine > startLine &&
         startChar >= 0 && endChar >= 0 &&
         (if endLine == startLine then endChar >= startChar
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:122:35
   def rangeSpan(startLine: Int, endLine: Int, startChar: Int, endChar: Int): Long =
     require(
       startLine >= 0 && endLine >= startLine &&
-        startChar >= 0 && endChar >= 0 &&
+        startChar >= 0 && endChar < 0 &&
         (if endLine == startLine then endChar >= startChar
          else endChar - startChar >= -10000)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed
