[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:122:35
   def rangeSpan(startLine: Int, endLine: Int, startChar: Int, endChar: Int): Long =
     require(
       startLine >= 0 && endLine >= startLine &&
-        startChar >= 0 && endChar >= 0 &&
+        startChar >= 0 && endChar == 0 &&
         (if endLine == startLine then endChar >= startChar
          else endChar - startChar >= -10000)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:123:47
     require(
       startLine >= 0 && endLine >= startLine &&
         startChar >= 0 && endChar >= 0 &&
-        (if endLine == startLine then endChar >= startChar
+        (if endLine == startLine then endChar == startChar
          else endChar - startChar >= -10000)
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:123:47
     require(
       startLine >= 0 && endLine >= startLine &&
         startChar >= 0 && endChar >= 0 &&
-        (if endLine == startLine then endChar >= startChar
+        (if endLine == startLine then endChar < startChar
          else endChar - startChar >= -10000)
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:124:35
       startLine >= 0 && endLine >= startLine &&
         startChar >= 0 && endChar >= 0 &&
         (if endLine == startLine then endChar >= startChar
-         else endChar - startChar >= -10000)
+         else endChar - startChar < -10000)
     )
     ((endLine.toLong - startLine) * 10000L + (endChar.toLong - startChar))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:124:35
       startLine >= 0 && endLine >= startLine &&
         startChar >= 0 && endChar >= 0 &&
         (if endLine == startLine then endChar >= startChar
-         else endChar - startChar >= -10000)
+         else endChar - startChar == -10000)
     )
     ((endLine.toLong - startLine) * 10000L + (endChar.toLong - startChar))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.rangeSpan weights lines over characters: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:127:28
          else endChar - startChar >= -10000)
     )
     ((endLine.toLong - startLine) * 10000L + (endChar.toLong - startChar))
-      .ensuring(res => res >= 0L)
+      .ensuring(res => res < 0L)
 
   /** One step of the longest-path layering recurrence: given the level accumulated so far for a
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:127:28
          else endChar - startChar >= -10000)
     )
     ((endLine.toLong - startLine) * 10000L + (endChar.toLong - startChar))
-      .ensuring(res => res >= 0L)
+      .ensuring(res => res == 0L)
 
   /** One step of the longest-path layering recurrence: given the level accumulated so far for a
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:143:55
     */
   @pure
   def nextLevel(acc: Int, childLevel: Int): Int =
-    require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
+    require(acc >= 0 && childLevel >= 0 && childLevel > Int.MaxValue)
     (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
       r >= acc && r >= childLevel + 1 && r >= 0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:143:17
     */
   @pure
   def nextLevel(acc: Int, childLevel: Int): Int =
-    require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
+    require(acc > 0 && childLevel >= 0 && childLevel < Int.MaxValue)
     (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
       r >= acc && r >= childLevel + 1 && r >= 0
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.IllegalArgumentException: requirement failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/PureKernels.scala:144:9
   @pure
   def nextLevel(acc: Int, childLevel: Int): Int =
     require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
-    (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
+    (if true then acc else childLevel + 1).ensuring(r =>
       r >= acc && r >= childLevel + 1 && r >= 0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:144:13
   @pure
   def nextLevel(acc: Int, childLevel: Int): Int =
     require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
-    (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
+    (if acc < childLevel + 1 then acc else childLevel + 1).ensuring(r =>
       r >= acc && r >= childLevel + 1 && r >= 0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:145:9
   def nextLevel(acc: Int, childLevel: Int): Int =
     require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
     (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
-      r >= acc && r >= childLevel + 1 && r >= 0
+      r == acc && r >= childLevel + 1 && r >= 0
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:145:21
   def nextLevel(acc: Int, childLevel: Int): Int =
     require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
     (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
-      r >= acc && r >= childLevel + 1 && r >= 0
+      r >= acc && r < childLevel + 1 && r >= 0
     )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: java.lang.AssertionError: assertion failed
