[Killed] EqualityOperator
mercurievv/scalasemantic/model/Models.scala:37:59
 
 object SymbolKind:
   /** The kind for a SemanticDB enum name (`_.kind.toString`), falling back to [[Unknown]]. */
-  def from(raw: String): SymbolKind = values.find(_.value == raw).getOrElse(Unknown)
+  def from(raw: String): SymbolKind = values.find(_.value != raw).getOrElse(Unknown)
 
   given ReadWriter[SymbolKind] = readwriter[String].bimap(_.value, from)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.kindName returns the kind or UNKNOWN
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.kindName returns the kind or UNKNOWN: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:190
189:  test("kindName returns the kind or UNKNOWN"):
190:    assertEquals(hi.kindName("a/Dog#"), SymbolKind.Class)
191:    assertEquals(hi.kindName("a/Missing#"), Sym
