[Killed] MethodExpression
scalasemantic/analysis/graph/GraphMetrics.scala:31:7
   @pure
   def coupling(nodes: Set[String], graph: Graph): Map[String, (Int, Int)] =
     val incoming: Map[String, Int] =
-      graph.toList
-        .flatMap((_, outs) => outs.toList)
-        .filter(nodes.contains)
+      graph.toList.flatMap((_, outs) => outs.toList).filterNot(nodes.contains)
         .groupBy(identity)
         .view
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.coupling counts in-project fan-in (Ca) and fan-out (Ce); com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.coupling counts in-project fan-in (Ca) and fan-out (Ce): munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:23
22:    assertEquals(cp("a"), (0, 3), "a: no in, three out (b, c, ext)")
23:    assertEquals(cp("b"), (1, 1), "b: in from a, out to c"

[Killed] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:41:35
     nodes.iterator
       .map(n => n -> (incoming.getOrElse(n, 0), graph.getOrElse(n, Set.empty).size))
       .toMap
-      .ensuring(res => res.keySet == nodes)
+      .ensuring(res => res.keySet != nodes)
 
   /** Instability Ce/(Ca+Ce), or 0 for an isolated node — delegates to the formally-verified
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.coupling counts in-project fan-in (Ca) and fan-out (Ce); com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.coupling counts in-project fan-in (Ca) and fan-out (Ce): java.lang.AssertionError: assertion failed

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:65:12
     val reversed = reverse(nodes, graph)
     order
       .foldLeft((Set.empty[String], List.empty[Set[String]])) { case ((assigned, comps), n) =>
-        if assigned.contains(n) then (assigned, comps)
+        if false then (assigned, comps)
         else
           val comp = collect(n, reversed, assigned, Set.empty)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents detects a 3-node cycle as one component
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:34
33:    val comps = GraphMetrics.stronglyConnectedComponents(Set("a", "b", "c"), g).map(_.toList.sorted)
34:    assertEqual

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:65:12
     val reversed = reverse(nodes, graph)
     order
       .foldLeft((Set.empty[String], List.empty[Set[String]])) { case ((assigned, comps), n) =>
-        if assigned.contains(n) then (assigned, comps)
+        if true then (assigned, comps)
         else
           val comp = collect(n, reversed, assigned, Set.empty)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:34
33:    val comps = GraphMetrics.stronglyConnectedComponents(Set("a", "b", "c"), g).map(_.toList.sorted)
34:    assertEqual

[Killed] MethodExpression
scalasemantic/analysis/graph/GraphMetrics.scala:85:34
     // Condensed DAG: component -> the other components it depends on.
     val condensed: Map[Int, Set[Int]] =
       graph.toList
-        .flatMap((from, outs) => outs.toList.filter(nodes.contains).map(to => from -> to))
+        .flatMap((from, outs) => outs.toList.filterNot(nodes.contains).map(to => from -> to))
         .flatMap((from, to) =>
           val ci = componentOf(from)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: cross-component edges set the level around a condensed cycle
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:44
43:    assertEquals(l("a"), 0, "foundation")
44:    assertEquals(l("b"), 1)
45:    assertEquals(l("c"), 2)
values are n

[Survived] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:89:26
         .flatMap((from, to) =>
           val ci = componentOf(from)
           val cj = componentOf(to)
-          Option.when(ci != cj)(ci -> cj)
+          Option.when(ci == cj)(ci -> cj)
         )
         .groupMap(_._1)(_._2)

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:124:8
       iterations: Int = 40
   ): Map[String, Double] =
     val n = nodes.size
-    if n == 0 then Map.empty
+    if false then Map.empty
     else
       val base = pageRankBase(damping, n)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:124:10
       iterations: Int = 40
   ): Map[String, Double] =
     val n = nodes.size
-    if n == 0 then Map.empty
+    if n != 0 then Map.empty
     else
       val base = pageRankBase(damping, n)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations: java.util.NoSuchElementException: key not found: a

[Killed] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:136:52
           val inflow = dependents
             .getOrElse(node, Set.empty)
             .iterator
-            .map(m => if outDegree.getOrElse(m, 0) == 0 then 0.0 else rank(m) / outDegree(m))
+            .map(m => if outDegree.getOrElse(m, 0) != 0 then 0.0 else rank(m) / outDegree(m))
             .sum
           node -> (base + damping * inflow)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: 50:    val pr = GraphMetrics.pageRank(Set("a", "b", "c"), g)
51:    assert(pr("a") > pr("b"), s"a (depended on by b,c) outranks b: $pr")
52:    assert(pr("a") > pr("c"), s"a outranks c: $pr")

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:136:26
           val inflow = dependents
             .getOrElse(node, Set.empty)
             .iterator
-            .map(m => if outDegree.getOrElse(m, 0) == 0 then 0.0 else rank(m) / outDegree(m))
+            .map(m => if true then 0.0 else rank(m) / outDegree(m))
             .sum
           node -> (base + damping * inflow)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: 50:    val pr = GraphMetrics.pageRank(Set("a", "b", "c"), g)
51:    assert(pr("a") > pr("b"), s"a (depended on by b,c) outranks b: $pr")
52:    assert(pr("a") > pr("c"), s"a outranks c: $pr")

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:145:10
   /** Post-order DFS over all nodes, accumulating finish order with the last-finished node first. */
   private def finishOrder(nodes: Set[String], graph: Graph): List[String] =
     def dfs(n: String, visited: Set[String], acc: List[String]): (Set[String], List[String]) =
-      if visited.contains(n) then (visited, acc)
+      if true then (visited, acc)
       else
         val (v, a) = graph
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:34
33:    val comps = GraphMetrics.stronglyConnectedComponents(Set("a", "b", "c"), g).map(_.toList.sorted)
34:    assertEqual

[Survived] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:145:10
   /** Post-order DFS over all nodes, accumulating finish order with the last-finished node first. */
   private def finishOrder(nodes: Set[String], graph: Graph): List[String] =
     def dfs(n: String, visited: Set[String], acc: List[String]): (Set[String], List[String]) =
-      if visited.contains(n) then (visited, acc)
+      if false then (visited, acc)
       else
         val (v, a) = graph

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:162:8
       assigned: Set[String],
       acc: Set[String]
   ): Set[String] =
-    if assigned.contains(start) || acc.contains(start) then acc
+    if true then acc
     else
       graph
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:34
33:    val comps = GraphMetrics.stronglyConnectedComponents(Set("a", "b", "c"), g).map(_.toList.sorted)
34:    assertEqual

[Survived] LogicalOperator
scalasemantic/analysis/graph/GraphMetrics.scala:162:33
       assigned: Set[String],
       acc: Set[String]
   ): Set[String] =
-    if assigned.contains(start) || acc.contains(start) then acc
+    if assigned.contains(start) && acc.contains(start) then acc
     else
       graph

[Killed] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:181:14
     graph
       .foldLeft(empty) { case (acc, (from, outs)) =>
         outs.foldLeft(acc) { (a, to) =>
-          if nodes.contains(to) then a.updated(to, a.getOrElse(to, Set.empty) + from) else a
+          if false then a.updated(to, a.getOrElse(to, Set.empty) + from) else a
         }
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:34
33:    val comps = GraphMetrics.stronglyConnectedComponents(Set("a", "b", "c"), g).map(_.toList.sorted)
34:    assertEqual

[Survived] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:181:14
     graph
       .foldLeft(empty) { case (acc, (from, outs)) =>
         outs.foldLeft(acc) { (a, to) =>
-          if nodes.contains(to) then a.updated(to, a.getOrElse(to, Set.empty) + from) else a
+          if true then a.updated(to, a.getOrElse(to, Set.empty) + from) else a
         }
       }

[Killed] EqualityOperator
scalasemantic/analysis/graph/GraphMetrics.scala:184:35
           if nodes.contains(to) then a.updated(to, a.getOrElse(to, Set.empty) + from) else a
         }
       }
-      .ensuring(res => res.keySet == nodes)
+      .ensuring(res => res.keySet != nodes)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.layers: longest dependency chain depth, cycles condensed to one level; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.pageRank flows toward depended-on foundations
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.stronglyConnectedComponents groups a cycle, isolates acyclic nodes: java.lang.AssertionError: assertion failed
