[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:23:7
     */
   val defaultCandidateNodeFilter: Tree => Boolean = {
     case _: Term.Block | _: Defn.Def | _: Term.Match | _: Term.For | _: Term.If | _: Term.Try =>
-      true
+      false
     case _ => false
   }
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:24:15
   val defaultCandidateNodeFilter: Tree => Boolean = {
     case _: Term.Block | _: Defn.Def | _: Term.Match | _: Term.For | _: Term.If | _: Term.Try =>
       true
-    case _ => false
+    case _ => true
   }
 

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:47:33
       enclosingDeclMatcher: Tree => Option[Defn] = defaultEnclosingDeclMatcher
   ): DuplicationsResult =
     val h = AnalyzerHelpers(index)
-    val keepUri = h.globMatcher(pathFilter.filter(_.nonEmpty))
+    val keepUri = h.globMatcher(pathFilter.filterNot(_.nonEmpty))
 
     // 1. Parse all files in index that match the path filter
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: a non-empty pathFilter scopes the files considered
statusReason: 176:      "restricting to a/ leaves only one file, so the cross-file duplicate vanishes"
177:    )
178:    assert(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:47:51
       enclosingDeclMatcher: Tree => Option[Defn] = defaultEnclosingDeclMatcher
   ): DuplicationsResult =
     val h = AnalyzerHelpers(index)
-    val keepUri = h.globMatcher(pathFilter.filter(_.nonEmpty))
+    val keepUri = h.globMatcher(pathFilter.filter(_.isEmpty))
 
     // 1. Parse all files in index that match the path filter
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: a non-empty pathFilter scopes the files considered
statusReason: 176:      "restricting to a/ leaves only one file, so the cross-file duplicate vanishes"
177:    )
178:    assert(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:50:29
     val keepUri = h.globMatcher(pathFilter.filter(_.nonEmpty))
 
     // 1. Parse all files in index that match the path filter
-    val candidateSubtrees = index.documents.iterator
-      .filter(doc => keepUri(doc.uri))
+    val candidateSubtrees = index.documents.iterator.filterNot(doc => keepUri(doc.uri))
       .flatMap { doc =>
         val text = readSourceText(doc.text, doc.uri, root)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:54:13
       .filter(doc => keepUri(doc.uri))
       .flatMap { doc =>
         val text = readSourceText(doc.text, doc.uri, root)
-        if (text.isEmpty) Iterator.empty
+        if (text.nonEmpty) Iterator.empty
         else
           Try(dialects.Scala3(text).parse[Source].get).toOption match
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:54:13
       .filter(doc => keepUri(doc.uri))
       .flatMap { doc =>
         val text = readSourceText(doc.text, doc.uri, root)
-        if (text.isEmpty) Iterator.empty
+        if (true) Iterator.empty
         else
           Try(dialects.Scala3(text).parse[Source].get).toOption match
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:73:27
     }
 
     // 3. Filter groups with size > 1 (i.e. duplicates exist)
-    val duplicateGroups = grouped.values.iterator
-      .filter(_.size > 1)
+    val duplicateGroups = grouped.values.iterator.filterNot(_.size > 1)
       .toList
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:74:22
 
     // 3. Filter groups with size > 1 (i.e. duplicates exist)
     val duplicateGroups = grouped.values.iterator
-      .filter(_.size > 1)
+      .filter(_.size == 1)
       .toList
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:74:22
 
     // 3. Filter groups with size > 1 (i.e. duplicates exist)
     val duplicateGroups = grouped.values.iterator
-      .filter(_.size > 1)
+      .filter(_.size >= 1)
       .toList
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: a non-empty pathFilter scopes the files considered
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:133
132:
133:    assertEquals(result.groups.size, 1)
134:    val group = result.groups.head
values are not the same

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:78:26
       .toList
 
     // 4. Filter out groups that are completely subsumed by another larger group
-    val filteredGroups = duplicateGroups.filter { g1 =>
-      val trees1 = g1.map(_._2)
-      !duplicateGroups.exists { g2 =>
-        val trees2 = g2.map(_._2)
-        (g1 ne g2) && trees1.forall { t1 =>
-          trees2.exists(t2 => isDescendant(t1, t2))
-        }
-      }
-    }
+    val filteredGroups = duplicateGroups.filterNot { g1 =>
+  val trees1 = g1.map(_._2)
+  !duplicateGroups.exists { g2 =>
+    val trees2 = g2.map(_._2)
+    (g1 ne g2) && trees1.forall {
+      t1 => trees2.exists(t2 => isDescendant(t1, t2))
+    }
+  }
+}
 
     // 5. Build DuplicationGroups
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:59
58:    assertEquals(occurrences.map(_.location.uri).toSet, Set("foo.scala", "bar.scala"))
59:    assertEquals(occurrences.map(_.

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:80:8
     // 4. Filter out groups that are completely subsumed by another larger group
     val filteredGroups = duplicateGroups.filter { g1 =>
       val trees1 = g1.map(_._2)
-      !duplicateGroups.exists { g2 =>
-        val trees2 = g2.map(_._2)
-        (g1 ne g2) && trees1.forall { t1 =>
-          trees2.exists(t2 => isDescendant(t1, t2))
-        }
-      }
+      !duplicateGroups.forall { g2 =>
+  val trees2 = g2.map(_._2)
+  (g1 ne g2) && trees1.forall {
+    t1 => trees2.exists(t2 => isDescendant(t1, t2))
+  }
+}
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
2
=> Di

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:82:20
       val trees1 = g1.map(_._2)
       !duplicateGroups.exists { g2 =>
         val trees2 = g2.map(_._2)
-        (g1 ne g2) && trees1.forall { t1 =>
+        (g1 ne g2) || trees1.forall { t1 =>
           trees2.exists(t2 => isDescendant(t1, t2))
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: minSize is an inclusive floor, not always-true
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:82:23
       val trees1 = g1.map(_._2)
       !duplicateGroups.exists { g2 =>
         val trees2 = g2.map(_._2)
-        (g1 ne g2) && trees1.forall { t1 =>
-          trees2.exists(t2 => isDescendant(t1, t2))
-        }
+        (g1 ne g2) && trees1.exists {
+  t1 => trees2.exists(t2 => isDescendant(t1, t2))
+}
       }
     }

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:83:11
       !duplicateGroups.exists { g2 =>
         val trees2 = g2.map(_._2)
         (g1 ne g2) && trees1.forall { t1 =>
-          trees2.exists(t2 => isDescendant(t1, t2))
+          trees2.forall(t2 => isDescendant(t1, t2))
         }
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
2
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:115:54
     * patterns).
     */
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
-    case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Def    => Some(d.name.value).filter(_.isEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:135
134:    val group = result.groups.head
135:    assertEquals(group.occurrences.map(_.enclosingMethod), List(Some

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:115:28
     * patterns).
     */
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
-    case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Def    => Some(d.name.value).filterNot(_.nonEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:135
134:    val group = result.groups.head
135:    assertEquals(group.occurrences.map(_.enclosingMethod), List(Some

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:116:28
     */
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Object => Some(d.name.value).filterNot(_.nonEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:116:54
     */
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Object => Some(d.name.value).filter(_.isEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:117:28
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Class  => Some(d.name.value).filterNot(_.nonEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Val    =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:117:54
   private def enclosingDeclName(defn: Defn): Option[String] = defn match
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Class  => Some(d.name.value).filter(_.isEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Val    =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:118:28
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Trait  => Some(d.name.value).filterNot(_.nonEmpty)
     case d: Defn.Val    =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:118:54
     case d: Defn.Def    => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Object => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
-    case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
+    case d: Defn.Trait  => Some(d.name.value).filter(_.isEmpty)
     case d: Defn.Val    =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:120:7
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Val    =>
-      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
+      d.pats.headOption.collect {
+  case Pat.Var(n) =>
+    n.value
+}.filterNot(_.nonEmpty)
     case d: Defn.Var =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:120:71
     case d: Defn.Class  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Trait  => Some(d.name.value).filter(_.nonEmpty)
     case d: Defn.Val    =>
-      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
+      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.isEmpty)
     case d: Defn.Var =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:122:71
     case d: Defn.Val    =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
     case d: Defn.Var =>
-      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
+      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.isEmpty)
     case _ => None
 

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:122:7
     case d: Defn.Val    =>
       d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
     case d: Defn.Var =>
-      d.pats.headOption.collect { case Pat.Var(n) => n.value }.filter(_.nonEmpty)
+      d.pats.headOption.collect {
+  case Pat.Var(n) =>
+    n.value
+}.filterNot(_.nonEmpty)
     case _ => None
 

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:127:64
 
   @pure
   private def nodeCount(tree: Tree): Int =
-    (1 + tree.children.map(nodeCount).sum).ensuring(res => res >= 1)
+    (1 + tree.children.map(nodeCount).sum).ensuring(res => res < 1)
 
   /** Collect all sub-trees of `tree` with at least `minSize` AST nodes that pass `nodeFilter`.
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:127:64
 
   @pure
   private def nodeCount(tree: Tree): Int =
-    (1 + tree.children.map(nodeCount).sum).ensuring(res => res >= 1)
+    (1 + tree.children.map(nodeCount).sum).ensuring(res => res == 1)
 
   /** Collect all sub-trees of `tree` with at least `minSize` AST nodes that pass `nodeFilter`.
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:148:26
       val nextEnclosing = enclosingDeclMatcher(t) orElse currentEnclosing
 
       val current =
-        if (nodeCount(t) >= minSize && nodeFilter(t)) List((t, currentEnclosing))
+        if (nodeCount(t) < minSize && nodeFilter(t)) List((t, currentEnclosing))
         else Nil
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:148:26
       val nextEnclosing = enclosingDeclMatcher(t) orElse currentEnclosing
 
       val current =
-        if (nodeCount(t) >= minSize && nodeFilter(t)) List((t, currentEnclosing))
+        if (nodeCount(t) == minSize && nodeFilter(t)) List((t, currentEnclosing))
         else Nil
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:159:8
     * disk. Returns an empty string when the file does not exist.
     */
   private def readSourceText(docText: String, docUri: String, root: Path): String =
-    if docText.nonEmpty then docText
+    if false then docText
     else
       val p = root.resolve(docUri)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:159:8
     * disk. Returns an empty string when the file does not exist.
     */
   private def readSourceText(docText: String, docUri: String, root: Path): String =
-    if docText.nonEmpty then docText
+    if docText.isEmpty then docText
     else
       val p = root.resolve(docUri)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:162:10
     if docText.nonEmpty then docText
     else
       val p = root.resolve(docUri)
-      if Files.exists(p) then
+      if false then
         new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
       else ""
