[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:162:10
     if docText.nonEmpty then docText
     else
       val p = root.resolve(docUri)
-      if Files.exists(p) then
+      if true then
         new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
       else ""

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:164:12
       val p = root.resolve(docUri)
       if Files.exists(p) then
         new String(Files.readAllBytes(p), java.nio.charset.StandardCharsets.UTF_8)
-      else ""
+      else "Stryker was here!"
 
   @pure

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:168:9
 
   @pure
   private def isDescendant(child: Tree, parent: Tree): Boolean =
-    if (child eq parent) false
+    if (true) false
     else parent.children.exists(c => (c eq child) || isDescendant(child, c))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
2
=> Di

[Survived] ConditionalExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:168:9
 
   @pure
   private def isDescendant(child: Tree, parent: Tree): Boolean =
-    if (child eq parent) false
+    if (false) false
     else parent.children.exists(c => (c eq child) || isDescendant(child, c))
 

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:169:10
   @pure
   private def isDescendant(child: Tree, parent: Tree): Boolean =
     if (child eq parent) false
-    else parent.children.exists(c => (c eq child) || isDescendant(child, c))
+    else parent.children.forall(c => (c eq child) || isDescendant(child, c))
 
   private def collectLocalNames(tree: Tree): List[String] =
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.analyze: minSize is an inclusive floor, not always-true
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:169:51
   @pure
   private def isDescendant(child: Tree, parent: Tree): Boolean =
     if (child eq parent) false
-    else parent.children.exists(c => (c eq child) || isDescendant(child, c))
+    else parent.children.exists(c => (c eq child) && isDescendant(child, c))
 
   private def collectLocalNames(tree: Tree): List[String] =
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
2
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:174:43
   private def collectLocalNames(tree: Tree): List[String] =
     def loop(t: Tree): List[String] =
       val current = t match
-        case Term.Param(_, name, _, _) if name.value.nonEmpty => List(name.value)
+        case Term.Param(_, name, _, _) if name.value.isEmpty => List(name.value)
         case Pat.Var(Term.Name(value)) if value.nonEmpty      => List(value)
         case param: Type.Param if param.name.value.nonEmpty   => List(param.name.value)
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:175:43
     def loop(t: Tree): List[String] =
       val current = t match
         case Term.Param(_, name, _, _) if name.value.nonEmpty => List(name.value)
-        case Pat.Var(Term.Name(value)) if value.nonEmpty      => List(value)
+        case Pat.Var(Term.Name(value)) if value.isEmpty      => List(value)
         case param: Type.Param if param.name.value.nonEmpty   => List(param.name.value)
         case defn: Defn.Def if defn.name.value.nonEmpty       => List(defn.name.value)

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:176:35
       val current = t match
         case Term.Param(_, name, _, _) if name.value.nonEmpty => List(name.value)
         case Pat.Var(Term.Name(value)) if value.nonEmpty      => List(value)
-        case param: Type.Param if param.name.value.nonEmpty   => List(param.name.value)
+        case param: Type.Param if param.name.value.isEmpty   => List(param.name.value)
         case defn: Defn.Def if defn.name.value.nonEmpty       => List(defn.name.value)
         case Defn.Val(_, pats, _, _)                          =>

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:177:32
         case Term.Param(_, name, _, _) if name.value.nonEmpty => List(name.value)
         case Pat.Var(Term.Name(value)) if value.nonEmpty      => List(value)
         case param: Type.Param if param.name.value.nonEmpty   => List(param.name.value)
-        case defn: Defn.Def if defn.name.value.nonEmpty       => List(defn.name.value)
+        case defn: Defn.Def if defn.name.value.isEmpty       => List(defn.name.value)
         case Defn.Val(_, pats, _, _)                          =>
           pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:179:60
         case param: Type.Param if param.name.value.nonEmpty   => List(param.name.value)
         case defn: Defn.Def if defn.name.value.nonEmpty       => List(defn.name.value)
         case Defn.Val(_, pats, _, _)                          =>
-          pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }
+          pats.collect { case Pat.Var(Term.Name(value)) if value.isEmpty => value }
         case defn: Defn.Var =>
           defn.pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:181:65
         case Defn.Val(_, pats, _, _)                          =>
           pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }
         case defn: Defn.Var =>
-          defn.pats.collect { case Pat.Var(Term.Name(value)) if value.nonEmpty => value }
+          defn.pats.collect { case Pat.Var(Term.Name(value)) if value.isEmpty => value }
         case _ => Nil
       current ++ t.children.flatMap(loop)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:190:34
   private def collectReferencedNames(tree: Tree): List[String] =
     def loop(t: Tree): List[String] =
       t match
-        case Term.Name(value) if value.nonEmpty => List(value)
+        case Term.Name(value) if value.isEmpty => List(value)
         case other                              => other.children.flatMap(loop)
     loop(tree).distinct
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:204:32
     val scopeTree = enclosingMethod.getOrElse(tree)
     val localNames = collectLocalNames(scopeTree)
     val referencedNames = collectReferencedNames(tree)
-    val localReferencedNames = referencedNames.filter(localNames.contains)
+    val localReferencedNames = referencedNames.filterNot(localNames.contains)
 
     val rootName = scopeTree match
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:212:38
       case v: Defn.Var => v.pats.headOption.map(_.syntax)
       case _           => None
 
-    val localReferencedNamesNoRoot = localReferencedNames.filter(n => !rootName.contains(n))
+    val localReferencedNamesNoRoot = localReferencedNames.filterNot(n => !rootName.contains(n))
     val placeholders = localReferencedNamesNoRoot.zipWithIndex.map { case (name, idx) =>
       name -> s"var$idx"
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer filters out subsumed duplicate blocks; com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer reports independent duplicated sub-blocks in different methods
statusReason: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.DuplicationAnalyzer detects smart code duplications across methods: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/DuplicationAnalyzerSuite.scala:52
51:
52:    assertEquals(result.groups.size, 1)
53:    val group = result.groups.head
values are not the same
=> Obtained
0
=> Di

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:216:63
     val placeholders = localReferencedNamesNoRoot.zipWithIndex.map { case (name, idx) =>
       name -> s"var$idx"
     }.toMap
-    val nameToPlaceholder = placeholders ++ rootName.map(_ -> "root")
+    val nameToPlaceholder = placeholders ++ rootName.map(_ -> "")
 
     def buildStructure(t: Tree): String =
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.normalize: the enclosing-method's own name becomes the 'root' placeholder
statusReason: 151:    val out = DuplicationAnalyzer.normalize(defn, None)
152:    assert(out.contains("Term.Name(root)"), s"the def's self-reference is 'root': $out")
153:  }

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:224:11
           val nameVal = nameToPlaceholder.getOrElse(value, value)
           s"Term.Name($nameVal)"
         case _: Lit =>
-          "Lit"
+          ""
         case _: Type =>
           "Type"
killedBy: com.github.mercurievv.scalasemantic.analysis.DuplicationAnalyzerSuite.normalize: locals → varN, literals → Lit, types → Type, names kept, comma-joined
statusReason: 142:    assert(out.contains("Term.Name(x)"), s"a free name is kept verbatim: $out")
143:    assert(out.contains("Lit"), s"the literal 1 renders as Lit: $out")
144:    assert(out.contains("Type"), s"the Int ascription renders as Type: $out")

[Survived] StringLiteral
mercurievv/scalasemantic/analysis/DuplicationAnalyzer.scala:226:11
         case _: Lit =>
           "Lit"
         case _: Type =>
-          "Type"
+          ""
         case other =>
           val children = other.children.map(buildStructure).mkString(",")
