[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:32:28
     def from(value: String): Either[String, SemanticDbSymbol] =
       nonEmpty(value, "SemanticDB symbol").flatMap { s =>
         val symbol = s.value
-        if symbol.isGlobal || symbol.isLocal then Right(s)
+        if symbol.isGlobal && symbol.isLocal then Right(s)
         else Left(s"invalid SemanticDB symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol; com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global; com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:23 assertion failed
22:  test("SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol"):
23:    assert(SemanticDbSymbol.from("com/exa

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:32:12
     def from(value: String): Either[String, SemanticDbSymbol] =
       nonEmpty(value, "SemanticDB symbol").flatMap { s =>
         val symbol = s.value
-        if symbol.isGlobal || symbol.isLocal then Right(s)
+        if true then Right(s)
         else Left(s"invalid SemanticDB symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:30 expected Left, got Right(foo)
29:    ) // the field name is in the message
30:    assertLeft(SemanticDbSymbol.from("foo"), "invalid SemanticDB symbol")

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:33:19
       nonEmpty(value, "SemanticDB symbol").flatMap { s =>
         val symbol = s.value
         if symbol.isGlobal || symbol.isLocal then Right(s)
-        else Left(s"invalid SemanticDB symbol: $value")
+        else Left("")
       }
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SemanticDbSymbol.from accepts global and local, rejects blank and non-symbol
statusReason: 29:    ) // the field name is in the message
30:    assertLeft(SemanticDbSymbol.from("foo"), "invalid SemanticDB symbol")
31:

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:43:12
     def from(value: String): Either[String, MethodSymbol] =
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
-        if raw.isGlobal && raw.desc.isMethod then Right(symbol)
+        if false then Right(symbol)
         else Left(s"expected method symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:33 assertion failed
32:  test("MethodSymbol.from accepts a method, rejects a type and a non-global"):
33:    assert(MethodSymbol.from("com/example/Foo#bar().").isRi

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:43:12
     def from(value: String): Either[String, MethodSymbol] =
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
-        if raw.isGlobal && raw.desc.isMethod then Right(symbol)
+        if true then Right(symbol)
         else Left(s"expected method symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.MethodSymbol.from accepts a method, rejects a type and a non-global: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:34 expected Left, got Right(com/example/Foo#)
33:    assert(MethodSymbol.from("com/example/Foo#bar().").isRight)
34:    assertLeft(MethodSymbol.from("com/example/Fo

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:54:12
     def from(value: String): Either[String, TypeSymbol] =
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
-        if raw.isGlobal && raw.desc.isType then Right(symbol)
+        if false then Right(symbol)
         else Left(s"expected type symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:38 assertion failed
37:  test("TypeSymbol.from accepts a type, rejects a method"):
38:    assert(TypeSymbol.from("com/example/Foo#").isRight)
39:    assertLeft(TypeSymbol.from("com/ex

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:54:25
     def from(value: String): Either[String, TypeSymbol] =
       SemanticDbSymbol.from(value).flatMap { symbol =>
         val raw = symbol.value
-        if raw.isGlobal && raw.desc.isType then Right(symbol)
+        if raw.isGlobal || raw.desc.isType then Right(symbol)
         else Left(s"expected type symbol: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.TypeSymbol.from accepts a type, rejects a method: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:39 expected Left, got Right(com/example/Foo#bar().)
38:    assert(TypeSymbol.from("com/example/Foo#").isRight)
39:    assertLeft(TypeSymbol.from("com/example/Foo#bar()."), "expected t

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:71:14
 
     def from(value: String): Either[String, PackageSymbol] =
       value.trim match
-        case "" => Right("")
+        case "Stryker was here!" => Right("")
         case s  =>
           val normalized = if s.endsWith("/") then s else s"$s/"
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:42
41:  test("PackageSymbol.from: blank -> empty, appends slash, rejects non-package"):
42:    assertEquals(PackageSymbol.from("").toOption.map(_.value

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:73:31
       value.trim match
         case "" => Right("")
         case s  =>
-          val normalized = if s.endsWith("/") then s else s"$s/"
+          val normalized = if false then s else s"$s/"
           if packagePattern.matches(normalized) then Right(normalized)
           else Left(s"invalid package symbol: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:44
43:    assertEquals(PackageSymbol.from("  ").toOption.map(_.value), Some(""))
44:    assertEquals(PackageSymbol.from("com/example/").toOption.map(_.

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:73:31
       value.trim match
         case "" => Right("")
         case s  =>
-          val normalized = if s.endsWith("/") then s else s"$s/"
+          val normalized = if true then s else s"$s/"
           if packagePattern.matches(normalized) then Right(normalized)
           else Left(s"invalid package symbol: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:45
44:    assertEquals(PackageSymbol.from("com/example/").toOption.map(_.value), Some("com/example/"))
45:    assertEquals(PackageSymbol.from("com/exam

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:74:14
         case "" => Right("")
         case s  =>
           val normalized = if s.endsWith("/") then s else s"$s/"
-          if packagePattern.matches(normalized) then Right(normalized)
+          if false then Right(normalized)
           else Left(s"invalid package symbol: $value")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package; com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol normalization is slash-terminated (or empty) and idempotent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:44
43:    assertEquals(PackageSymbol.from("  ").toOption.map(_.value), Some(""))
44:    assertEquals(PackageSymbol.from("com/example/").toOption.map(_.

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:74:14
         case "" => Right("")
         case s  =>
           val normalized = if s.endsWith("/") then s else s"$s/"
-          if packagePattern.matches(normalized) then Right(normalized)
+          if true then Right(normalized)
           else Left(s"invalid package symbol: $value")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.PackageSymbol.from: blank -> empty, appends slash, rejects non-package: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:49 expected Left, got Right(com/Foo#/)
48:    // and whitespace are all invalid package descriptors.
49:    assertLeft(PackageSymbol.from("com/Foo#"), "invalid p

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:82:23
   opaque type DocumentUri = NonEmptyString
   object DocumentUri:
     def from(value: String): Either[String, DocumentUri] =
-      nonEmpty(value, "document uri").flatMap { uri =>
+      nonEmpty(value, "").flatMap { uri =>
         val path = uri.value
         if path.startsWith("/") then Left(s"document uri must be relative: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: 58:    assertLeft(DocumentUri.from("   "), "non-empty")
59:    assertLeft(DocumentUri.from("   "), "document uri") // the field name is in the message
60:    assertLeft(DocumentUri.from("/etc/passwd"), "must be relative")

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:84:12
     def from(value: String): Either[String, DocumentUri] =
       nonEmpty(value, "document uri").flatMap { uri =>
         val path = uri.value
-        if path.startsWith("/") then Left(s"document uri must be relative: $value")
+        if true then Left(s"document uri must be relative: $value")
         else if path.split('/').contains("..") then
           Left(s"document uri must not contain '..': $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:57 assertion failed
56:  test("DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot"):
57:    assert(DocumentUri.from("src/Main.scala").isRight)
58:

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:84:12
     def from(value: String): Either[String, DocumentUri] =
       nonEmpty(value, "document uri").flatMap { uri =>
         val path = uri.value
-        if path.startsWith("/") then Left(s"document uri must be relative: $value")
+        if false then Left(s"document uri must be relative: $value")
         else if path.split('/').contains("..") then
           Left(s"document uri must not contain '..': $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:60 expected Left, got Right(/etc/passwd)
59:    assertLeft(DocumentUri.from("   "), "document uri") // the field name is in the message
60:    assertLeft(DocumentUr

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:85:17
       nonEmpty(value, "document uri").flatMap { uri =>
         val path = uri.value
         if path.startsWith("/") then Left(s"document uri must be relative: $value")
-        else if path.split('/').contains("..") then
+        else if false then
           Left(s"document uri must not contain '..': $value")
         else Right(uri)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:61 expected Left, got Right(a/../b.scala)
60:    assertLeft(DocumentUri.from("/etc/passwd"), "must be relative")
61:    assertLeft(DocumentUri.from("a/../b.scala"),

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:85:17
       nonEmpty(value, "document uri").flatMap { uri =>
         val path = uri.value
         if path.startsWith("/") then Left(s"document uri must be relative: $value")
-        else if path.split('/').contains("..") then
+        else if true then
           Left(s"document uri must not contain '..': $value")
         else Right(uri)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:57 assertion failed
56:  test("DocumentUri.from: relative ok; rejects blank, absolute, and dot-dot"):
57:    assert(DocumentUri.from("src/Main.scala").isRight)
58:

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:114:18
 
     @pure
     def before(other: SourcePosition): Boolean =
-      (lineValue < other.lineValue ||
+      (lineValue == other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:179 range end must be after range start
178:    val az = Analyzer(index(doc("ex.scala", symbols, occs)))
179:    val range = SourceRange.from(

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:114:18
 
     @pure
     def before(other: SourcePosition): Boolean =
-      (lineValue < other.lineValue ||
+      (lineValue > other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:77 earlier line wins
76:    assert(pos(1, 2).before(pos(1, 3)), "same line, later char")
77:    assert(pos(1, 2).before(pos(2, 0)), "earlier line wins")
78:    assert(!pos

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:115:57
     @pure
     def before(other: SourcePosition): Boolean =
       (lineValue < other.lineValue ||
-        (lineValue == other.lineValue && characterValue < other.characterValue))
+        (lineValue == other.lineValue && characterValue > other.characterValue))
         .ensuring(res =>
           (if (this == other) !res else true) &&
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character); com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from is Right iff end is strictly after start (with valid coords)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:76 same line, later char
75:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
76:    assert(pos(1, 2).before(pos(1, 3)), "same line, later char")
77:

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:115:57
     @pure
     def before(other: SourcePosition): Boolean =
       (lineValue < other.lineValue ||
-        (lineValue == other.lineValue && characterValue < other.characterValue))
+        (lineValue == other.lineValue && characterValue <= other.characterValue))
         .ensuring(res =>
           (if (this == other) !res else true) &&
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from is Right iff end is strictly after start (with valid coords)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:117:21
       (lineValue < other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
-          (if (this == other) !res else true) &&
+          (if (this != other) !res else true) &&
             (if (res) !other.before(this) else true)
         )
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: java.lang.AssertionError: assertion failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:117:16
       (lineValue < other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
-          (if (this == other) !res else true) &&
+          (if (true) !res else true) &&
             (if (res) !other.before(this) else true)
         )
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: java.lang.AssertionError: assertion failed

[Killed] BooleanLiteral
mercurievv/scalasemantic/model/InputTypes.scala:118:48
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
           (if (this == other) !res else true) &&
-            (if (res) !other.before(this) else true)
+            (if (res) !other.before(this) else false)
         )
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before is exactly strict lexicographic order on (line, character)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.before respects line then character, strictly: java.lang.AssertionError: assertion failed

[Survived] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:118:18
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
           (if (this == other) !res else true) &&
-            (if (res) !other.before(this) else true)
+            (if (true) !other.before(this) else true)
         )
 

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:123:20
 
     @pure
     def atOrBefore(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line > 0 && character >= 0)
       lineValue < line ||
       (lineValue == line && characterValue <= character)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:123:38
 
     @pure
     def atOrBefore(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line >= 0 && character < 0)
       lineValue < line ||
       (lineValue == line && characterValue <= character)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:124:17
     @pure
     def atOrBefore(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
-      lineValue < line ||
+      lineValue == line ||
       (lineValue == line && characterValue <= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:86 earlier line
85:    assert(pos(1, 2).atOrBefore(1, 3), "same line, later char")
86:    assert(pos(1, 2).atOrBefore(2, 0), "earlier line")
87:    assert(!pos(1, 2).atOrBefore(

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:124:17
     @pure
     def atOrBefore(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
-      lineValue < line ||
+      lineValue > line ||
       (lineValue == line && characterValue <= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:86 earlier line
85:    assert(pos(1, 2).atOrBefore(1, 3), "same line, later char")
86:    assert(pos(1, 2).atOrBefore(2, 0), "earlier line")
87:    assert(!pos(1, 2).atOrBefore(

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:125:44
     def atOrBefore(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
       lineValue < line ||
-      (lineValue == line && characterValue <= character)
+      (lineValue == line && characterValue == character)
 
     @pure
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:85 same line, later char
84:    assert(pos(1, 2).atOrBefore(1, 2), "equal counts")
85:    assert(pos(1, 2).atOrBefore(1, 3), "same line, later char")
86:    assert(pos(1, 2).atO
