[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:125:44
     def atOrBefore(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
       lineValue < line ||
-      (lineValue == line && characterValue <= character)
+      (lineValue == line && characterValue < character)
 
     @pure
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrBefore is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:84 equal counts
83:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
84:    assert(pos(1, 2).atOrBefore(1, 2), "equal counts")
85:    assert(pos(1, 2).atOrBef

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:129:20
 
     @pure
     def atOrAfter(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line == 0 && character >= 0)
       lineValue > line ||
       (lineValue == line && characterValue >= character)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:129:20
 
     @pure
     def atOrAfter(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line < 0 && character >= 0)
       lineValue > line ||
       (lineValue == line && characterValue >= character)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: java.lang.IllegalArgumentException: requirement failed

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:130:24
     @pure
     def atOrAfter(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
-      lineValue > line ||
+      lineValue > line &&
       (lineValue == line && characterValue >= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:92 equal counts
91:    def pos(l: Int, c: Int) = SourcePosition.from(l, c).toOption.get
92:    assert(pos(1, 2).atOrAfter(1, 2), "equal counts")
93:    assert(pos(1, 3).atOrAfter

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:130:17
     @pure
     def atOrAfter(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
-      lineValue > line ||
+      lineValue < line ||
       (lineValue == line && characterValue >= character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:94 later line
93:    assert(pos(1, 3).atOrAfter(1, 2), "same line, earlier target char")
94:    assert(pos(2, 0).atOrAfter(1, 9), "later line")
95:    assert(!pos(1, 2).atOrAfter

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:131:26
     def atOrAfter(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
       lineValue > line ||
-      (lineValue == line && characterValue >= character)
+      (lineValue == line || characterValue >= character)
 
   object SourcePosition:
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:95 same line, later target char
94:    assert(pos(2, 0).atOrAfter(1, 9), "later line")
95:    assert(!pos(1, 2).atOrAfter(1, 3), "same line, later target char")
96:    assert(!po

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:131:44
     def atOrAfter(line: Int, character: Int): Boolean =
       require(line >= 0 && character >= 0)
       lineValue > line ||
-      (lineValue == line && characterValue >= character)
+      (lineValue == line && characterValue == character)
 
   object SourcePosition:
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.atOrBefore and atOrAfter are the non-strict orders, mutually consistent at the boundary
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourcePosition.atOrAfter is inclusive on the boundary: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:93 same line, earlier target char
92:    assert(pos(1, 2).atOrAfter(1, 2), "equal counts")
93:    assert(pos(1, 3).atOrAfter(1, 2), "same line, earlier target char")
94:    asser

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:158:19
         endCharacter: Int
     ): Boolean =
       require(
-        startLine >= 0 && startCharacter >= 0 &&
+        startLine == 0 && startCharacter >= 0 &&
           endLine >= startLine &&
           (endLine > startLine || endCharacter >= startCharacter)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:158:19
         endCharacter: Int
     ): Boolean =
       require(
-        startLine >= 0 && startCharacter >= 0 &&
+        startLine < 0 && startCharacter >= 0 &&
           endLine >= startLine &&
           (endLine > startLine || endCharacter >= startCharacter)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:159:19
     ): Boolean =
       require(
         startLine >= 0 && startCharacter >= 0 &&
-          endLine >= startLine &&
+          endLine < startLine &&
           (endLine > startLine || endCharacter >= startCharacter)
       )
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:159:19
     ): Boolean =
       require(
         startLine >= 0 && startCharacter >= 0 &&
-          endLine >= startLine &&
+          endLine == startLine &&
           (endLine > startLine || endCharacter >= startCharacter)
       )
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:160:20
       require(
         startLine >= 0 && startCharacter >= 0 &&
           endLine >= startLine &&
-          (endLine > startLine || endCharacter >= startCharacter)
+          (endLine < startLine || endCharacter >= startCharacter)
       )
       start.atOrBefore(startLine, startCharacter) &&
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:160:48
       require(
         startLine >= 0 && startCharacter >= 0 &&
           endLine >= startLine &&
-          (endLine > startLine || endCharacter >= startCharacter)
+          (endLine > startLine || endCharacter == startCharacter)
       )
       start.atOrBefore(startLine, startCharacter) &&
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: java.lang.IllegalArgumentException: requirement failed

[Killed] LogicalOperator
mercurievv/scalasemantic/model/InputTypes.scala:162:51
           endLine >= startLine &&
           (endLine > startLine || endCharacter >= startCharacter)
       )
-      start.atOrBefore(startLine, startCharacter) &&
+      start.atOrBefore(startLine, startCharacter) ||
       end.atOrAfter(endLine, endCharacter)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:107 a span starting before is not contained
106:    assert(r.contains(1, 2, 2, 1), "an inner span is contained")
107:    assert(!r.contains(0, 0, 2, 5),

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:167:20
 
     @pure
     def startsAtOrAfterEnd(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line < 0 && character >= 0)
       end.atOrBefore(line, character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:167:38
 
     @pure
     def startsAtOrAfterEnd(line: Int, character: Int): Boolean =
-      require(line >= 0 && character >= 0)
+      require(line >= 0 && character == 0)
       end.atOrBefore(line, character)
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.lang.IllegalArgumentException: requirement failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:181:14
         start <- SourcePosition.from(startLine, startCharacter)
         end <- SourcePosition.from(endLine, endCharacter)
         range <-
-          if start.before(end) then Right(SourceRange(start, end))
+          if false then Right(SourceRange(start, end))
           else Left("range end must be after range start")
       yield range
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from is Right iff end is strictly after start (with valid coords)
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: java.util.NoSuchElementException: None.get

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:181:14
         start <- SourcePosition.from(startLine, startCharacter)
         end <- SourcePosition.from(endLine, endCharacter)
         range <-
-          if start.before(end) then Right(SourceRange(start, end))
+          if true then Right(SourceRange(start, end))
           else Left("range end must be after range start")
       yield range
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd; com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from is Right iff end is strictly after start (with valid coords)
statusReason: 110:    assert(!r.startsAtOrAfterEnd(1, 4), "a mid position is before the end")
111:    assertLeft(SourceRange.from(2, 0, 1, 0), "after")
112:    assertLeft(SourceRange.from(1, 5, 1, 5), "after") // empty range rejected

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:182:21
         end <- SourcePosition.from(endLine, endCharacter)
         range <-
           if start.before(end) then Right(SourceRange(start, end))
-          else Left("range end must be after range start")
+          else Left("")
       yield range
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceRange.from requires end strictly after start; contains/startsAtOrAfterEnd: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:111 message Right() did not contain 'after'
110:    assert(!r.startsAtOrAfterEnd(1, 4), "a mid position is before the end")
111:    assertLeft(SourceRan

[Killed] BooleanLiteral
mercurievv/scalasemantic/model/InputTypes.scala:242:34
         val valid =
           name match
             case plain()      => !keywords.contains(name)
-            case symbolic()   => true
+            case symbolic()   => false
             case backticked() => true
             case _            => false
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:117 assertion failed
116:    assert(ScalaIdentifier.from("foo_$1").isRight)
117:    assert(ScalaIdentifier.from("+:").isRight)
118:    assert(ScalaId

[Killed] BooleanLiteral
mercurievv/scalasemantic/model/InputTypes.scala:243:34
           name match
             case plain()      => !keywords.contains(name)
             case symbolic()   => true
-            case backticked() => true
+            case backticked() => false
             case _            => false
         if valid then Right(refined) else Left(s"invalid Scala identifier: $value")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:118 assertion failed
117:    assert(ScalaIdentifier.from("+:").isRight)
118:    assert(ScalaIdentifier.from("`weird name`").isRight)
119:    assertLe

[Killed] BooleanLiteral
mercurievv/scalasemantic/model/InputTypes.scala:244:34
             case plain()      => !keywords.contains(name)
             case symbolic()   => true
             case backticked() => true
-            case _            => false
+            case _            => true
         if valid then Right(refined) else Left(s"invalid Scala identifier: $value")
       }
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:120 expected Left, got Right(1abc)
119:    assertLeft(ScalaIdentifier.from("class"), "invalid Scala identifier")
120:    assertLeft(ScalaIdentifier.f

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:245:12
             case symbolic()   => true
             case backticked() => true
             case _            => false
-        if valid then Right(refined) else Left(s"invalid Scala identifier: $value")
+        if true then Right(refined) else Left(s"invalid Scala identifier: $value")
       }
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:119 expected Left, got Right(class)
118:    assert(ScalaIdentifier.from("`weird name`").isRight)
119:    assertLeft(ScalaIdentifier.from("class"), "i

[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:245:12
             case symbolic()   => true
             case backticked() => true
             case _            => false
-        if valid then Right(refined) else Left(s"invalid Scala identifier: $value")
+        if false then Right(refined) else Left(s"invalid Scala identifier: $value")
       }
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:115 assertion failed
114:  test("ScalaIdentifier.from: plain/symbolic/backticked ok; keyword/garbage/blank rejected"):
115:    assert(ScalaIdentifier

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:260:14
   object StructureDimension:
     def from(value: String): Either[String, StructureDimension] =
       value.trim match
-        case ""           => Right(Combined)
+        case "Stryker was here!"           => Right(Combined)
         case "combined"   => Right(Combined)
         case "extends"    => Right(Extends)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:126
125:    import StructureDimension.*
126:    assertEquals(StructureDimension.from(""), Right(Combined))
127:    assertEquals(StructureDimension.f

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:261:14
     def from(value: String): Either[String, StructureDimension] =
       value.trim match
         case ""           => Right(Combined)
-        case "combined"   => Right(Combined)
+        case ""   => Right(Combined)
         case "extends"    => Right(Extends)
         case "memberType" => Right(MemberType)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:127
126:    assertEquals(StructureDimension.from(""), Right(Combined))
127:    assertEquals(StructureDimension.from("combined"), Right(Combined))
12

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:264:14
         case "combined"   => Right(Combined)
         case "extends"    => Right(Extends)
         case "memberType" => Right(MemberType)
-        case "call"       => Right(Call)
+        case ""       => Right(Call)
         case "implicit"   => Right(Implicit)
         case other        => Left(s"invalid structure dimension: $other")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:130
129:    assertEquals(StructureDimension.from("memberType"), Right(MemberType))
130:    assertEquals(StructureDimension.from("call"), Right(Call)

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:279:14
   object StructureSort:
     def from(value: String): Either[String, StructureSort] =
       value.trim match
-        case ""            => Right(Afferent)
+        case "Stryker was here!"            => Right(Afferent)
         case "afferent"    => Right(Afferent)
         case "efferent"    => Right(Efferent)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:136
135:    import StructureSort.*
136:    assertEquals(StructureSort.from(""), Right(Afferent))
137:    assertEquals(StructureSort.from("afferent"), Rig

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:281:14
       value.trim match
         case ""            => Right(Afferent)
         case "afferent"    => Right(Afferent)
-        case "efferent"    => Right(Efferent)
+        case ""    => Right(Efferent)
         case "instability" => Right(Instability)
         case "layer"       => Right(Layer)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:138
137:    assertEquals(StructureSort.from("afferent"), Right(Afferent))
138:    assertEquals(StructureSort.from("efferent"), Right(Efferent))
139:    a

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:284:14
         case "efferent"    => Right(Efferent)
         case "instability" => Right(Instability)
         case "layer"       => Right(Layer)
-        case "centrality"  => Right(Centrality)
+        case ""  => Right(Centrality)
         case "sccSize"     => Right(SccSize)
         case other         => Left(s"invalid structure sort: $other")
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:141
140:    assertEquals(StructureSort.from("layer"), Right(Layer))
141:    assertEquals(StructureSort.from("centrality"), Right(Centrality))
142:    ass

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:285:14
         case "instability" => Right(Instability)
         case "layer"       => Right(Layer)
         case "centrality"  => Right(Centrality)
-        case "sccSize"     => Right(SccSize)
+        case ""     => Right(SccSize)
         case other         => Left(s"invalid structure sort: $other")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:142
141:    assertEquals(StructureSort.from("centrality"), Right(Centrality))
142:    assertEquals(StructureSort.from("sccSize"), Right(SccSize))
143:

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:286:36
         case "layer"       => Right(Layer)
         case "centrality"  => Right(Centrality)
         case "sccSize"     => Right(SccSize)
-        case other         => Left(s"invalid structure sort: $other")
+        case other         => Left("")
 
   enum SourceFormat(val value: String):
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:143 message Right() did not contain 'invalid structure sort'
142:    assertEquals(StructureSort.from("sccSize"), Right(SccSize))
143:    assertLeft(StructureSort.f
