[Killed] StringLiteral
scalasemantic/analysis/graph/StructureMetrics.scala:17:37
 
   private val graphs = new DependencyGraphs(index)
   private val nodes = graphs.nodes
-  private val dimensionNames = List("extends", "memberType", "call", "implicit")
+  private val dimensionNames = List("", "memberType", "call", "implicit")
 
   def result(): StructureResult =
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership: java.util.NoSuchElementException: key not found:

[Killed] MethodExpression
scalasemantic/analysis/graph/StructureMetrics.scala:38:11
     val cycles =
       (dimensionNames.map(d => d -> graphs.dimensions(d)) ++ List("combined" -> graphs.combined))
         .flatMap { (name, g) =>
-          GraphMetrics
-            .stronglyConnectedComponents(nodes, g)
-            .filter(_.size > 1)
+          GraphMetrics.stronglyConnectedComponents(nodes, g).filterNot(_.size > 1)
             .map(c => DependencyCycle(name, c.toList.sorted))
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: 185:      r.cycles.toString
186:    )
187:    val byMod = r.modules.map(m => m.module -> m).toMap

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:40:28
         .flatMap { (name, g) =>
           GraphMetrics
             .stronglyConnectedComponents(nodes, g)
-            .filter(_.size > 1)
+            .filter(_.size >= 1)
             .map(c => DependencyCycle(name, c.toList.sorted))
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:207
206:    // exactly the one real cycle per dimension — acyclic singletons are NOT reported as cycles.
207:    assertEquals(r.cycles.count(_.dimens

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:40:28
         .flatMap { (name, g) =>
           GraphMetrics
             .stronglyConnectedComponents(nodes, g)
-            .filter(_.size > 1)
+            .filter(_.size == 1)
             .map(c => DependencyCycle(name, c.toList.sorted))
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: 185:      r.cycles.toString
186:    )
187:    val byMod = r.modules.map(m => m.module -> m).toMap

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:62:14
         layer.getOrElse(n, 0),
         centrality.getOrElse(n, 0.0),
         size,
-        size > 1
+        size < 1
       )
     }.toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:179 assertion failed
178:    assertEquals(x.sccSize, 2, "X is in the X<->Y cycle")
179:    assert(x.inCycle)
180:

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:62:14
         layer.getOrElse(n, 0),
         centrality.getOrElse(n, 0.0),
         size,
-        size > 1
+        size == 1
       )
     }.toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:173 assertion failed
172:    assertEquals(a.layer, 0, "A is a foundation")
173:    assert(!a.inCycle)
174:    val c = bySym("app/C#

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:71:27
   private val moduleGraph: Graph =
     graphs.combined.toList
       .flatMap((from, tos) => tos.toList.map(to => graphs.moduleOf(from) -> graphs.moduleOf(to)))
-      .filter((a, b) => a != b)
+      .filter((a, b) => a == b)
       .groupMap(_._1)(_._2)
       .view
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:190
189:    assertEquals(byMod("app").typeCount, 1)
190:    assertEquals(byMod("app").efferent, 1, "app depends on core")
191:    assertEquals(byMod(

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:95:24
         instability = GraphMetrics.instability(ca, ce),
         layer = layer.getOrElse(m, 0),
         sccSize = size,
-        inCycle = size > 1
+        inCycle = size == 1
       )
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:195 app is acyclic
194:    // acyclic project: no module is in a cycle, and no module edge is flagged cyclic.
195:    assert(!byMod("app").inCycle, "app is acy

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:95:24
         instability = GraphMetrics.instability(ca, ce),
         layer = layer.getOrElse(m, 0),
         sccSize = size,
-        inCycle = size > 1
+        inCycle = size < 1
       )
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: 252:    assertEquals(byMod("m1").sccSize, 2, "m1 and m2 form a module cycle")
253:    assert(byMod("m1").inCycle, "m1 is in the module cycle")
254:    assert(byMod("m2").inCycle, "m2 is in the module cycle")

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:115:31
     val componentSize = components.flatMap(c => c.map(_ -> c.size)).toMap
     weights.toList.sortBy((pair, _) => pair).map { case ((from, to), weight) =>
       val cyclic =
-        componentOf.get(from) == componentOf.get(to) && componentSize.getOrElse(from, 1) > 1
+        componentOf.get(from) != componentOf.get(to) && componentSize.getOrElse(from, 1) > 1
       ModuleEdge(from, to, weight, cyclic)
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: 257:      r.moduleEdges.find(e => e.from == from && e.to == to).getOrElse(fail(s"no edge $from->$to"))
258:    assert(edge("m1", "m2").inCycle, "edge inside the module cycle is cyclic")
259:    assert(edge("m2", "m1").inCycle, "edge inside the module cycle is cyclic")

[Killed] EqualityOperator
scalasemantic/analysis/graph/StructureMetrics.scala:115:90
     val componentSize = components.flatMap(c => c.map(_ -> c.size)).toMap
     weights.toList.sortBy((pair, _) => pair).map { case ((from, to), weight) =>
       val cyclic =
-        componentOf.get(from) == componentOf.get(to) && componentSize.getOrElse(from, 1) > 1
+        componentOf.get(from) == componentOf.get(to) && componentSize.getOrElse(from, 1) < 1
       ModuleEdge(from, to, weight, cyclic)
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: 257:      r.moduleEdges.find(e => e.from == from && e.to == to).getOrElse(fail(s"no edge $from->$to"))
258:    assert(edge("m1", "m2").inCycle, "edge inside the module cycle is cyclic")
259:    assert(edge("m2", "m1").inCycle, "edge inside the module cycle is cyclic")
