[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:26:33
     */
   val nodes: Set[String] =
     val defined = index.occurrences.collect {
-      case (_, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => occ.symbol
+      case (_, occ) if occ.role != s.SymbolOccurrence.Role.DEFINITION => occ.symbol
     }.toSet
     index.symbols.values.iterator.collect {
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:144
143:  test("DependencyGraphs.nodes are the in-project classes only"):
144:    assertEquals(graphs.nodes, Set("core/A#", "core/B#", "c

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:29:61
       case (_, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => occ.symbol
     }.toSet
     index.symbols.values.iterator.collect {
-      case si if defined.contains(si.symbol) && isClass(si) && isTopLevel(si.symbol) => si.symbol
+      case si if defined.contains(si.symbol) && isClass(si) || isTopLevel(si.symbol) => si.symbol
     }.toSet
 

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:29:46
       case (_, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => occ.symbol
     }.toSet
     index.symbols.values.iterator.collect {
-      case si if defined.contains(si.symbol) && isClass(si) && isTopLevel(si.symbol) => si.symbol
+      case si if defined.contains(si.symbol) || isClass(si) && isTopLevel(si.symbol) => si.symbol
     }.toSet
 

[Killed] StringLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:36:5
   val dimensions: Map[String, Graph] = Map(
     "extends" -> extendsGraph,
     "memberType" -> memberTypeGraph,
-    "call" -> callGraph,
+    "" -> callGraph,
     "implicit" -> implicitGraph
   )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: call

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:46:5
 
   /** Module of a type: the leading path segment of its definition uri (e.g. `core`, `analysis`). */
   def moduleOf(symbol: String): String =
-    definitionUri(symbol).map(_.takeWhile(_ != '/')).filter(_.nonEmpty).getOrElse("<unknown>")
+    definitionUri(symbol).map(_.takeWhile(_ != '/')).filterNot(_.nonEmpty).getOrElse("<unknown>")
 
   // --- per-dimension extraction ---------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:161
160:    assertEquals(graphs.combined("core/B#"), Set("core/A#"))
161:    assertEquals(graphs.moduleOf("core/

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:46:31
 
   /** Module of a type: the leading path segment of its definition uri (e.g. `core`, `analysis`). */
   def moduleOf(symbol: String): String =
-    definitionUri(symbol).map(_.takeWhile(_ != '/')).filter(_.nonEmpty).getOrElse("<unknown>")
+    definitionUri(symbol).map(_.dropWhile(_ != '/')).filter(_.nonEmpty).getOrElse("<unknown>")
 
   // --- per-dimension extraction ---------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:161
160:    assertEquals(graphs.combined("core/B#"), Set("core/A#"))
161:    assertEquals(graphs.moduleOf("core/

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:53:39
   /** `extends`: a type → the in-project types it directly extends. */
   private def extendsGraph: Graph =
     nodes.iterator.map { n =>
-      n -> parentsOf(n).filter(p => p != n && nodes.contains(p)).toSet
+      n -> parentsOf(n).filter(p => p == n && nodes.contains(p)).toSet
     }.toMap
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:147
146:  test("DependencyGraphs: one graph per dimension"):
147:    assertEquals(graphs.dimensions("extends")("app/C#"), Set("core/A#"))
148:    asse

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:53:44
   /** `extends`: a type → the in-project types it directly extends. */
   private def extendsGraph: Graph =
     nodes.iterator.map { n =>
-      n -> parentsOf(n).filter(p => p != n && nodes.contains(p)).toSet
+      n -> parentsOf(n).filter(p => p != n || nodes.contains(p)).toSet
     }.toMap
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:156
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent")
157:
no in-project parent
=> Ob

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:59:18
   /** `memberType`: a type → in-project types referenced in its members' signatures. */
   private def memberTypeGraph: Graph =
     nodes.iterator.map { n =>
-      val refs = declarationSymbols(n)
-        .flatMap(m => index.info(m).toList)
-        .flatMap(mi => signatureTypeRefs(mi.signature))
-        .filter(t => t != n && nodes.contains(t))
+      val refs = declarationSymbols(n).flatMap(m => index.info(m).toList).flatMap(mi => signatureTypeRefs(mi.signature)).filterNot(t => t != n && nodes.contains(t))
         .toSet
       n -> refs
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:149
148:    assertEquals(graphs.dimensions("extends")("core/X#"), Set("core/Y#"))
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:62:24
       val refs = declarationSymbols(n)
         .flatMap(m => index.info(m).toList)
         .flatMap(mi => signatureTypeRefs(mi.signature))
-        .filter(t => t != n && nodes.contains(t))
+        .filter(t => t == n && nodes.contains(t))
         .toSet
       n -> refs
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:149
148:    assertEquals(graphs.dimensions("extends")("core/X#"), Set("core/Y#"))
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:62:29
       val refs = declarationSymbols(n)
         .flatMap(m => index.info(m).toList)
         .flatMap(mi => signatureTypeRefs(mi.signature))
-        .filter(t => t != n && nodes.contains(t))
+        .filter(t => t != n || nodes.contains(t))
         .toSet
       n -> refs
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:170
169:    assertEquals(a.afferent, 2, "A is depended on by B and C")
170:    assertEquals(a.efferent, 0)
171:    assert

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:78:65
       ordered
         .foldLeft((Option.empty[String], List.empty[(String, String)])) {
           case ((_, acc), occ)
-              if occ.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(occ.symbol) =>
+              if occ.role == s.SymbolOccurrence.Role.DEFINITION || index.isMethod(occ.symbol) =>
             (Some(occ.symbol), acc)
           case ((Some(current), acc), occ) if index.isMethod(occ.symbol) && current != occ.symbol =>
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: app/C#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:78:27
       ordered
         .foldLeft((Option.empty[String], List.empty[(String, String)])) {
           case ((_, acc), occ)
-              if occ.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(occ.symbol) =>
+              if occ.role != s.SymbolOccurrence.Role.DEFINITION && index.isMethod(occ.symbol) =>
             (Some(occ.symbol), acc)
           case ((Some(current), acc), occ) if index.isMethod(occ.symbol) && current != occ.symbol =>
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: app/C#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:80:85
           case ((_, acc), occ)
               if occ.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(occ.symbol) =>
             (Some(occ.symbol), acc)
-          case ((Some(current), acc), occ) if index.isMethod(occ.symbol) && current != occ.symbol =>
+          case ((Some(current), acc), occ) if index.isMethod(occ.symbol) && current == occ.symbol =>
             (Some(current), (current, occ.symbol) :: acc)
           case (state, _) =>
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: app/C#

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:80:74
           case ((_, acc), occ)
               if occ.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(occ.symbol) =>
             (Some(occ.symbol), acc)
-          case ((Some(current), acc), occ) if index.isMethod(occ.symbol) && current != occ.symbol =>
+          case ((Some(current), acc), occ) if index.isMethod(occ.symbol) || current != occ.symbol =>
             (Some(current), (current, occ.symbol) :: acc)
           case (state, _) =>
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.callGraph: a reference to a non-method member does not create a call edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.callGraph: a reference to a non-method member does not create a call edge: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:285
284:    val g = new DependencyGraphs(SemanticIndex(Vector(doc)))
285:    assertEquals(g.dimensions("call").getOrEl

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:91:56
       .flatMap { (caller, callee) =>
         val from = index.owner(caller)
         val to = index.owner(callee)
-        Option.when(from != to && nodes.contains(from) && nodes.contains(to))(from -> to)
+        Option.when(from != to && nodes.contains(from) || nodes.contains(to))(from -> to)
       }
       .groupMap(_._1)(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:150
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set("core/A#"))
150:    assertEquals(graphs.dimensions("call")("app/C#"), Set("co

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:91:26
       .flatMap { (caller, callee) =>
         val from = index.owner(caller)
         val to = index.owner(callee)
-        Option.when(from != to && nodes.contains(from) && nodes.contains(to))(from -> to)
+        Option.when(from == to && nodes.contains(from) && nodes.contains(to))(from -> to)
       }
       .groupMap(_._1)(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:150
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set("core/A#"))
150:    assertEquals(graphs.dimensions("call")("app/C#"), Set("co

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:105:18
     val edges = for
       si <- index.symbols.values.toList
       if isImplicit(si)
-      owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
+      owner = if true then si.symbol else index.owner(si.symbol)
       if nodes.contains(owner)
       t <- implicitDependencyTypes(si)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Survived] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:105:18
     val edges = for
       si <- index.symbols.values.toList
       if isImplicit(si)
-      owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
+      owner = if false then si.symbol else index.owner(si.symbol)
       if nodes.contains(owner)
       t <- implicitDependencyTypes(si)

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:108:12
       owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
       if nodes.contains(owner)
       t <- implicitDependencyTypes(si)
-      if t != owner && nodes.contains(t)
+      if t == owner && nodes.contains(t)
     yield owner -> t
     edges.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:108:21
       owner = if nodes.contains(si.symbol) then si.symbol else index.owner(si.symbol)
       if nodes.contains(owner)
       t <- implicitDependencyTypes(si)
-      if t != owner && nodes.contains(t)
+      if t != owner || nodes.contains(t)
     yield owner -> t
     edges.groupMap(_._1)(_._2).view.mapValues(_.toSet).toMap
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.implicitGraph: a given depending on its own type creates no self-edge: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:337 assertion failed
336:    val g = new DependencyGraphs(SemanticIndex(Vector(doc)))
337:    assert(!g.dimensions("implicit").getOr

[Killed] BooleanLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:116:35
 
   private def isClass(si: s.SymbolInformation): Boolean =
     si.signature match
-      case _: s.ClassSignature => true
+      case _: s.ClassSignature => false
       case _                   => false
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:144
143:  test("DependencyGraphs.nodes are the in-project classes only"):
144:    assertEquals(graphs.nodes, Set("core/A#", "core/B#", "c

[Survived] BooleanLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:117:35
   private def isClass(si: s.SymbolInformation): Boolean =
     si.signature match
       case _: s.ClassSignature => true
-      case _                   => false
+      case _                   => true
 
   /** Returns true if the symbol is a top-level type (its owner is a package, not another type).

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:125:19
     */
   private def isTopLevel(symbol: String): Boolean =
     val owner = index.owner(symbol)
-    owner.isEmpty || owner.endsWith("/")
+    owner.isEmpty && owner.endsWith("/")
 
   private def parentsOf(symbol: String): List[String] =
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are the in-project classes only: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:144
143:  test("DependencyGraphs.nodes are the in-project classes only"):
144:    assertEquals(graphs.nodes, Set("core/A#", "core/B#", "c

[Survived] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:125:5
     */
   private def isTopLevel(symbol: String): Boolean =
     val owner = index.owner(symbol)
-    owner.isEmpty || owner.endsWith("/")
+    owner.nonEmpty || owner.endsWith("/")
 
   private def parentsOf(symbol: String): List[String] =

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:156:9
   private def implicitDependencyTypes(si: s.SymbolInformation): Set[String] =
     si.signature match
       case m: s.MethodSignature =>
-        m.parameterLists.toList
-          .flatMap(pl => scopeInfos(Some(pl)))
-          .filter(isImplicit)
+        m.parameterLists.toList.flatMap(pl => scopeInfos(Some(pl))).filterNot(isImplicit)
           .flatMap(p => typeRefs(valueType(p)))
           .toSet
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:189:10
 
   private def scopeInfos(scope: Option[s.Scope]): Seq[s.SymbolInformation] =
     scope.toSeq.flatMap { sc =>
-      if sc.hardlinks.nonEmpty then sc.hardlinks else sc.symlinks.flatMap(index.info)
+      if sc.hardlinks.isEmpty then sc.hardlinks else sc.symlinks.flatMap(index.info)
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:149
148:    assertEquals(graphs.dimensions("extends")("core/X#"), Set("core/Y#"))
149:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set

[Killed] ConditionalExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:189:10
 
   private def scopeInfos(scope: Option[s.Scope]): Seq[s.SymbolInformation] =
     scope.toSeq.flatMap { sc =>
-      if sc.hardlinks.nonEmpty then sc.hardlinks else sc.symlinks.flatMap(index.info)
+      if false then sc.hardlinks else sc.symlinks.flatMap(index.info)
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:199:69
       case _                    => s.Type.Empty
 
   private def isImplicit(info: s.SymbolInformation): Boolean =
-    (info.properties & s.SymbolInformation.Property.IMPLICIT.value) != 0
+    (info.properties & s.SymbolInformation.Property.IMPLICIT.value) == 0
 
   private def definitionUri(symbol: String): Option[String] =
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:      "only the given's dep"
155:    )
156:    assertEquals(graphs.dimensions("extends")("core/A#"), Set.empty[String], "no in-project parent"

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:203:59
 
   private def definitionUri(symbol: String): Option[String] =
     index.occurrences.collectFirst {
-      case (uri, occ) if occ.symbol == symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.symbol == symbol && occ.role != s.SymbolOccurrence.Role.DEFINITION =>
         uri
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:161
160:    assertEquals(graphs.combined("core/B#"), Set("core/A#"))
161:    assertEquals(graphs.moduleOf("core/
