[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:203:47
 
   private def definitionUri(symbol: String): Option[String] =
     index.occurrences.collectFirst {
-      case (uri, occ) if occ.symbol == symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.symbol == symbol || occ.role == s.SymbolOccurrence.Role.DEFINITION =>
         uri
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:162
161:    assertEquals(graphs.moduleOf("core/A#"), "core")
162:    assertEquals(graphs.moduleOf("app/C#"), "ap
