[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:86:36
       limit: PositiveInt,
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
-    val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
+    val keepModule = h.globMatcher(pathFilter.filterNot(_.nonEmpty))
     structureResult.symbols
       .filter(sym => keepModule(sym.module))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:439
438:      .toSet
439:    assertEquals(coreOnly, Set("core"), "pathFilter 'core' drops the app module")
440:
pathFilter 'core' drops

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:86:54
       limit: PositiveInt,
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
-    val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
+    val keepModule = h.globMatcher(pathFilter.filter(_.isEmpty))
     structureResult.symbols
       .filter(sym => keepModule(sym.module))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:439
438:      .toSet
439:    assertEquals(coreOnly, Set("core"), "pathFilter 'core' drops the app module")
440:
pathFilter 'core' drops

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:87:5
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
     val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
-    structureResult.symbols
-      .filter(sym => keepModule(sym.module))
+    structureResult.symbols.filterNot(sym => keepModule(sym.module))
       .map(sym => sym -> selectedMetrics(sym, dimension))
       .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:212
211:      .map((sym, _) => sym.displayName)
212:    assertEquals(byAfferent, List("A"), "A (depended on) ranks highest by afferent, li

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:87:5
       pathFilter: Option[String] = None
   ): List[(SymbolStructure, DimensionMetrics)] =
     val keepModule = h.globMatcher(pathFilter.filter(_.nonEmpty))
-    structureResult.symbols
-      .filter(sym => keepModule(sym.module))
-      .map(sym => sym -> selectedMetrics(sym, dimension))
-      .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
-      .take(limit.value)
+    structureResult.symbols.filter(sym => keepModule(sym.module)).map(sym => sym -> selectedMetrics(sym, dimension)).sortBy((_, metrics) => -rankStructureMetrics(metrics, sort)).drop(limit.value)
       .ensuring(res => res.size <= limit.value)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:212
211:      .map((sym, _) => sym.displayName)
212:    assertEquals(byAfferent, List("A"), "A (depended on) ranks highest by afferent, li

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:92:33
       .map(sym => sym -> selectedMetrics(sym, dimension))
       .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
       .take(limit.value)
-      .ensuring(res => res.size <= limit.value)
+      .ensuring(res => res.size == limit.value)
 
   private lazy val structureResult: StructureResult = StructureMetrics(index).result()
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:92:33
       .map(sym => sym -> selectedMetrics(sym, dimension))
       .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
       .take(limit.value)
-      .ensuring(res => res.size <= limit.value)
+      .ensuring(res => res.size < limit.value)
 
   private lazy val structureResult: StructureResult = StructureMetrics(index).result()
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:135:27
       val defs = doc.occurrences.toList
         .collect {
           case occ
-              if occ.role == s.SymbolOccurrence.Role.DEFINITION && h.includeInOutline(occ.symbol) =>
+              if occ.role != s.SymbolOccurrence.Role.DEFINITION && h.includeInOutline(occ.symbol) =>
             occ.symbol -> occ.range.map(_.startLine).getOrElse(0)
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:135:65
       val defs = doc.occurrences.toList
         .collect {
           case occ
-              if occ.role == s.SymbolOccurrence.Role.DEFINITION && h.includeInOutline(occ.symbol) =>
+              if occ.role == s.SymbolOccurrence.Role.DEFINITION || h.includeInOutline(occ.symbol) =>
             occ.symbol -> occ.range.map(_.startLine).getOrElse(0)
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:70
69:    val kids = top.head.children
70:    assertEquals(kids.map(_.name), List("m", "v"), "members nested and ordered by line")
71:    assert(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:141:9
         .distinctBy(_._1)
       val definedSet = defs.map(_._1).toSet
       def parentOf(sym: String): Option[String] =
-        Some(index.owner(sym)).filter(definedSet.contains)
+        Some(index.owner(sym)).filterNot(definedSet.contains)
       def build(sym: String, line: Int): OutlineEntry =
         val kids = defs.filter((c, _) => parentOf(c).contains(sym)).sortBy(_._2)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:152:31
           outlineSignature(sym),
           kids.map((c, l) => build(c, l))
         )
-      defs.filter((sym, _) => parentOf(sym).isEmpty).sortBy(_._2).map((sym, l) => build(sym, l))
+      defs.filter((sym, _) => parentOf(sym).nonEmpty).sortBy(_._2).map((sym, l) => build(sym, l))
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:162:41
     index.info(symbol).map(_.signature) match
       case Some(_: s.MethodSignature) =>
         methodSignatureOf(symbol).map(_.rendered).getOrElse("")
-      case Some(v: s.ValueSignature) => s": ${h.renderType(v.tpe)}"
+      case Some(v: s.ValueSignature) => ""
       case _                         => ""
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:72
71:    assert(kids.find(_.name == "m").get.signature.startsWith("def m"), "method signature")
72:    assertEquals(kids.find(_.name == "v").get

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:163:41
       case Some(_: s.MethodSignature) =>
         methodSignatureOf(symbol).map(_.rendered).getOrElse("")
       case Some(v: s.ValueSignature) => s": ${h.renderType(v.tpe)}"
-      case _                         => ""
+      case _                         => "Stryker was here!"
 
   // --- annotated source -----------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:73
72:    assertEquals(kids.find(_.name == "v").get.signature, ": Int", "value type")
73:    assertEquals(top.head.signature, "", "a type needs n

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:213:38
       .toList
       .sortBy(e => (e.uri, e.range.start.line, e.range.start.character))
     RenamePlan(sym, oldName, name, edits.size, edits)
-      .ensuring(res => res.editCount == res.edits.size)
+      .ensuring(res => res.editCount != res.edits.size)
 
   // --- move plan ------------------------------------------------------------

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:239:35
     val toFqn = h.joinFqn(h.packageDotted(toOwner), name)
     val occs = index.occurrencesOf(sym)
     val defLoc = occs.collectFirst {
-      case (uri, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.role != s.SymbolOccurrence.Role.DEFINITION =>
         h.location(uri, occ.range)
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:146
145:    // the definition is the DEFINITION occurrence, not the first reference (kills `== DEFINITION`->`!=`)
146:    assertEquals(plan

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:245:37
     val defUri = defLoc.map(_.uri)
     val references = occs
       .collect {
-        case (uri, occ) if occ.role == s.SymbolOccurrence.Role.REFERENCE =>
+        case (uri, occ) if occ.role != s.SymbolOccurrence.Role.REFERENCE =>
           h.location(uri, occ.range)
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:148
147:    assertEquals(plan.definition.map(_.range.start.character), Some(0))
148:    assertEquals(plan.references.size, 3, "every cross-

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:251:19
       .distinct
       .toList
     // One import edit per referencing file, decided by that file's own package.
-    val imports = references
-      .map(_.uri)
-      .distinct
-      .filterNot(defUri.contains) // the definition's file moves with it
+    val imports = references.map(_.uri).distinct.filter(defUri.contains) // the definition's file moves with it
       .flatMap { uri =>
         val pkg = h.documentPackage(uri)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set()
=> Diff (- exp

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:257:12
       .filterNot(defUri.contains) // the definition's file moves with it
       .flatMap { uri =>
         val pkg = h.documentPackage(uri)
-        if pkg.contains(toOwner) then None // already in the destination package
+        if true then None // already in the destination package
         else if pkg.contains(fromOwner) then Some(MoveImport(uri, "", toFqn))
         else Some(MoveImport(uri, fromFqn, toFqn))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set()
=> Diff (- exp

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:257:12
       .filterNot(defUri.contains) // the definition's file moves with it
       .flatMap { uri =>
         val pkg = h.documentPackage(uri)
-        if pkg.contains(toOwner) then None // already in the destination package
+        if false then None // already in the destination package
         else if pkg.contains(fromOwner) then Some(MoveImport(uri, "", toFqn))
         else Some(MoveImport(uri, fromFqn, toFqn))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:258:17
       .flatMap { uri =>
         val pkg = h.documentPackage(uri)
         if pkg.contains(toOwner) then None // already in the destination package
-        else if pkg.contains(fromOwner) then Some(MoveImport(uri, "", toFqn))
+        else if true then Some(MoveImport(uri, "", toFqn))
         else Some(MoveImport(uri, fromFqn, toFqn))
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:258:17
       .flatMap { uri =>
         val pkg = h.documentPackage(uri)
         if pkg.contains(toOwner) then None // already in the destination package
-        else if pkg.contains(fromOwner) then Some(MoveImport(uri, "", toFqn))
+        else if false then Some(MoveImport(uri, "", toFqn))
         else Some(MoveImport(uri, fromFqn, toFqn))
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:299:23
 
       val occ = doc.occurrences
       // Definition occurrences of each local, used to decide inside/outside the selection.
-      val defInside = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+      val defInside = occ.iterator.filterNot(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
         .map(_.symbol)
         .filter(index.isLocal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:299:23
 
       val occ = doc.occurrences
       // Definition occurrences of each local, used to decide inside/outside the selection.
-      val defInside = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
-        .map(_.symbol)
-        .filter(index.isLocal)
+      val defInside = occ.iterator.filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection)).map(_.symbol).filterNot(index.isLocal)
         .toSet
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:300:70
       val occ = doc.occurrences
       // Definition occurrences of each local, used to decide inside/outside the selection.
       val defInside = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.forall(inSelection))
         .map(_.symbol)
         .filter(index.isLocal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:377
376:      "range-less DEF is not 'inside'"
377:    )
378:    assertEquals(plan.returns, Nil, "a range-less DEF is never a ret

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:300:67
       val occ = doc.occurrences
       // Definition occurrences of each local, used to decide inside/outside the selection.
       val defInside = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION || o.range.exists(inSelection))
         .map(_.symbol)
         .filter(index.isLocal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:307:20
 
       // Parameters: locals READ in the selection whose definition is NOT inside it (free vars),
       // ordered by first read position, de-duplicated.
-      val params = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
-        .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
+      val params = occ.iterator.filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection)).filterNot(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
         .toList
         .sortBy(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:307:20
 
       // Parameters: locals READ in the selection whose definition is NOT inside it (free vars),
       // ordered by first read position, de-duplicated.
-      val params = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
+      val params = occ.iterator.filterNot(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:331
330:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
331:    assertEquals(pla

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:308:66
       // Parameters: locals READ in the selection whose definition is NOT inside it (free vars),
       // ordered by first read position, de-duplicated.
       val params = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE || o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:331
330:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
331:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:308:69
       // Parameters: locals READ in the selection whose definition is NOT inside it (free vars),
       // ordered by first read position, de-duplicated.
       val params = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.forall(inSelection))
         .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:331
330:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
331:    assertEquals(pla
