[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:309:46
       // ordered by first read position, de-duplicated.
       val params = occ.iterator
         .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
-        .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
+        .filter(o => index.isLocal(o.symbol) || !defInside.contains(o.symbol))
         .toList
         .sortBy(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:317:23
         .map(sym => ExtractBinding(h.localName(sym), h.localTypeText(sym)))
 
       // Returns: locals DEFINED inside the selection that are still READ after it.
-      val readAfter = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
+      val readAfter = occ.iterator.filterNot(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
         .map(_.symbol)
         .toSet
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:183
182:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
183:    assertEquals(plan.returns.map(_.nam

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:318:69
 
       // Returns: locals DEFINED inside the selection that are still READ after it.
       val readAfter = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.forall(afterSelection))
         .map(_.symbol)
         .toSet
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:332
331:    assertEquals(plan.parameters.map(_.name), List("p"), "only the ranged free read is a param")
332:    assertEquals(plan.r

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:318:66
 
       // Returns: locals DEFINED inside the selection that are still READ after it.
       val readAfter = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE || o.range.exists(afterSelection))
         .map(_.symbol)
         .toSet
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:183
182:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
183:    assertEquals(plan.returns.map(_.nam

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:321:21
         .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
         .map(_.symbol)
         .toSet
-      val returns = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+      val returns = occ.iterator.filterNot(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:351
350:    assertEquals(plan.parameters.map(_.name), List("a", "b"))
351:    assertEquals(plan.returns, Nil, "a is defin

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:321:21
         .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
         .map(_.symbol)
         .toSet
-      val returns = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
-        .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
+      val returns = occ.iterator.filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection)).filterNot(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
         .toList
         .sortBy(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:183
182:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
183:    assertEquals(plan.returns.map(_.nam

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:322:67
         .map(_.symbol)
         .toSet
       val returns = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION || o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:351
350:    assertEquals(plan.parameters.map(_.name), List("a", "b"))
351:    assertEquals(plan.returns, Nil, "a is defin

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:322:70
         .map(_.symbol)
         .toSet
       val returns = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.forall(inSelection))
         .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: range-less DEF occurrences are ignored for params and returns: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:378
377:    )
378:    assertEquals(plan.returns, Nil, "a range-less DEF is never a return")
379:
a range-less DEF is never a retu

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:323:46
         .toSet
       val returns = occ.iterator
         .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
-        .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
+        .filter(o => index.isLocal(o.symbol) || readAfter.contains(o.symbol))
         .toList
         .sortBy(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:183
182:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
183:    assertEquals(plan.returns.map(_.nam

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:331:23
         .map(sym => ExtractBinding(h.localName(sym), h.localTypeText(sym)))
 
       // The method the selection sits in: nearest preceding method definition in the file.
-      val enclosing = occ
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
+      val enclosing = occ.filterNot(o => o.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
         .filter(o => o.range.exists(r => range.start.atOrAfter(r.startLine, r.startCharacter)))
         .maxByOption(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:187
186:    assertEquals(plan.call, "val b = extracted(a)")
187:    assertEquals(plan.enclosingMethod.map(_.displayName), Some("run"

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:332:67
 
       // The method the selection sits in: nearest preceding method definition in the file.
       val enclosing = occ
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
+        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION || index.isMethod(o.symbol))
         .filter(o => o.range.exists(r => range.start.atOrAfter(r.startLine, r.startCharacter)))
         .maxByOption(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:187
186:    assertEquals(plan.call, "val b = extracted(a)")
187:    assertEquals(plan.enclosingMethod.map(_.displayName), Some("run"

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:332:29
 
       // The method the selection sits in: nearest preceding method definition in the file.
       val enclosing = occ
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
+        .filter(o => o.role != s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
         .filter(o => o.range.exists(r => range.start.atOrAfter(r.startLine, r.startCharacter)))
         .maxByOption(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:187
186:    assertEquals(plan.call, "val b = extracted(a)")
187:    assertEquals(plan.enclosingMethod.map(_.displayName), Some("run"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:333:22
       // The method the selection sits in: nearest preceding method definition in the file.
       val enclosing = occ
         .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && index.isMethod(o.symbol))
-        .filter(o => o.range.exists(r => range.start.atOrAfter(r.startLine, r.startCharacter)))
+        .filter(o => o.range.forall(r => range.start.atOrAfter(r.startLine, r.startCharacter)))
         .maxByOption(o => o.range.map(r => (r.startLine, r.startCharacter)).getOrElse((0, 0)))
         .map(o => h.symbolRef(o.symbol))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: a range-less method definition is not chosen as the enclosing method
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: a range-less method definition is not chosen as the enclosing method: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:399
398:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
399:    assert

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:338:26
         .map(o => h.symbolRef(o.symbol))
 
       val returnType = returns match
-        case Nil      => "Unit"
+        case Nil      => ""
         case b :: Nil => b.tpe
         case many     => many.map(_.tpe).mkString("(", ", ", ")")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:281
280:    assertEquals(plan.returns, Nil)
281:    assertEquals(plan.returnType, "Unit")
282:    assertEquals(plan.signature, "def ex0(): Unit

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:341:72
         case Nil      => "Unit"
         case b :: Nil => b.tpe
         case many     => many.map(_.tpe).mkString("(", ", ", ")")
-      val paramText = params.map(p => s"${p.name}: ${p.tpe}").mkString(", ")
+      val paramText = params.map(p => s"${p.name}: ${p.tpe}").mkString("")
       val signature = s"def $name($paramText): $returnType"
       val args = params.map(_.name).mkString(", ")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:352
351:    assertEquals(plan.returns, Nil, "a is defined outside, so reading it after is not a return")
352:    assertEq

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:342:23
         case b :: Nil => b.tpe
         case many     => many.map(_.tpe).mkString("(", ", ", ")")
       val paramText = params.map(p => s"${p.name}: ${p.tpe}").mkString(", ")
-      val signature = s"def $name($paramText): $returnType"
+      val signature = ""
       val args = params.map(_.name).mkString(", ")
       val call = returns match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: no escaping local → Unit return and a bare call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:185
184:    assertEquals(plan.returnType, "Int")
185:    assertEquals(plan.signature, "def extracted(a: Int): Int")
186:    assertEq

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:343:46
         case many     => many.map(_.tpe).mkString("(", ", ", ")")
       val paramText = params.map(p => s"${p.name}: ${p.tpe}").mkString(", ")
       val signature = s"def $name($paramText): $returnType"
-      val args = params.map(_.name).mkString(", ")
+      val args = params.map(_.name).mkString("")
       val call = returns match
         case Nil      => s"$name($args)"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:353
352:    assertEquals(plan.signature, "def exp(a: Int, b: Int): Unit")
353:    assertEquals(plan.call, "exp(a, b)")
35

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:383:5
     val q = query.toLowerCase
     val wantedKind = kind.map(_.toUpperCase)
     val keepPath = h.bySymbolPath(pathFilter)
-    index.symbols.values.iterator
-      .filter(si => index.isGlobal(si.symbol))
+    index.symbols.values.iterator.filterNot(si => index.isGlobal(si.symbol))
       .filter(si => !findSymbolExcludedKinds.contains(si.kind))
       .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:383:5
     val q = query.toLowerCase
     val wantedKind = kind.map(_.toUpperCase)
     val keepPath = h.bySymbolPath(pathFilter)
-    index.symbols.values.iterator
-      .filter(si => index.isGlobal(si.symbol))
-      .filter(si => !findSymbolExcludedKinds.contains(si.kind))
+    index.symbols.values.iterator.filter(si => index.isGlobal(si.symbol)).filterNot(si => !findSymbolExcludedKinds.contains(si.kind))
       .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
       .filter { si =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:386:21
     index.symbols.values.iterator
       .filter(si => index.isGlobal(si.symbol))
       .filter(si => !findSymbolExcludedKinds.contains(si.kind))
-      .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
+      .filter(si => si.displayName.isEmpty && si.displayName != "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:386:63
     index.symbols.values.iterator
       .filter(si => index.isGlobal(si.symbol))
       .filter(si => !findSymbolExcludedKinds.contains(si.kind))
-      .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
+      .filter(si => si.displayName.nonEmpty && si.displayName == "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:389:25
       .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
-        if exact then n == q else n.contains(q)
+        if exact then n != q else n.contains(q)
       }
       .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase == k))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:389:12
       .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
-        if exact then n == q else n.contains(q)
+        if false then n == q else n.contains(q)
       }
       .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase == k))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:391:73
         val n = si.displayName.toLowerCase
         if exact then n == q else n.contains(q)
       }
-      .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase == k))
+      .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase != k))
       .filter(si => keepPath(si.symbol))
       .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:107
106:      "kind filter keeps only classes"
107:    )
108:    assertEquals(az.findSymbol("animal", limit = lim(1)).size, 1

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:391:21
         val n = si.displayName.toLowerCase
         if exact then n == q else n.contains(q)
       }
-      .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase == k))
+      .filter(si => wantedKind.exists(k => si.kind.toString.toUpperCase == k))
       .filter(si => keepPath(si.symbol))
       .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:97
96:      "exact (case-insensitive); AnimalKind/<init>/param excluded"
97:    )
98:    assertEquals(
exact (case-insensitiv
