[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:396:23
       .toList
       .sortBy { si =>
         val n = si.displayName.toLowerCase
-        val rank = if n == q then 0 else if n.startsWith(q) then 1 else 2
+        val rank = if true then 0 else if n.startsWith(q) then 1 else 2
         (rank, si.displayName.length, si.symbol)
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:257
256:      "exact first, then prefix, then substring — not by length alone"
257:    )
258:    assert(az.findSymbol("init").isEmpty

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:396:25
       .toList
       .sortBy { si =>
         val n = si.displayName.toLowerCase
-        val rank = if n == q then 0 else if n.startsWith(q) then 1 else 2
+        val rank = if n != q then 0 else if n.startsWith(q) then 1 else 2
         (rank, si.displayName.length, si.symbol)
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:257
256:      "exact first, then prefix, then substring — not by length alone"
257:    )
258:    assert(az.findSymbol("init").isEmpty

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:447:47
             Parameter(p.displayName, h.renderType(h.valueType(p)), h.isImplicit(p))
           }
           .toList
-        ParameterList(params, params.nonEmpty && params.forall(_.isImplicit))
+        ParameterList(params, params.nonEmpty || params.forall(_.isImplicit))
       }.toList
       val ret = h.renderType(m.returnType)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:129
128:      List(false)
129:    )
130:    assertEquals(
values are not the same
=> Obtained
List(
  true

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:447:31
             Parameter(p.displayName, h.renderType(h.valueType(p)), h.isImplicit(p))
           }
           .toList
-        ParameterList(params, params.nonEmpty && params.forall(_.isImplicit))
+        ParameterList(params, params.isEmpty && params.forall(_.isImplicit))
       }.toList
       val ret = h.renderType(m.returnType)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.methodSignature flags a list implicit only when non-empty and all-implicit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:125
124:      List(true)
125:    )
126:    assertEquals(
values are not the same
=> Obtained
List(
  false

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:476:21
     val sym = symbol.value
     val keep = h.bySymbolPath(pathFilter)
     index.info(sym).map(_.signature).collect { case c: s.ClassSignature =>
-      val parents = c.parents.flatMap(h.parentSymbol).filter(keep).map(h.symbolRef).toList
+      val parents = c.parents.flatMap(h.parentSymbol).filterNot(keep).map(h.symbolRef).toList
       ClassHierarchy(
         sym,
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:87
86:    val h = az.classHierarchy(tpe(s"${P}Puppy#")).getOrElse(fail("no hierarchy"))
87:    assertEquals(h.parents.map(_.displayName), List("Dog"))
8

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:481:9
         sym,
         index.displayName(sym),
         parents,
-        h.linearize(sym).filter(keep).map(h.symbolRef),
+        h.linearize(sym).filterNot(keep).map(h.symbolRef),
         h.knownSubtypes(sym).filter(keep).map(h.symbolRef)
       )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:88
87:    assertEquals(h.parents.map(_.displayName), List("Dog"))
88:    assertEquals(h.linearization.map(_.displayName), List("Dog", "Animal", "Object"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:482:9
         index.displayName(sym),
         parents,
         h.linearize(sym).filter(keep).map(h.symbolRef),
-        h.knownSubtypes(sym).filter(keep).map(h.symbolRef)
+        h.knownSubtypes(sym).filterNot(keep).map(h.symbolRef)
       )
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.classHierarchy: parents, full linearization, known subtypes: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:92
91:      List("Dog")
92:    )
93:
values are not the same
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:499:36
       .collect {
         case si
             if index
-              .isMethod(si.symbol) && index.owner(si.symbol) == own && si.displayName == name =>
+              .isMethod(si.symbol) || index.owner(si.symbol) == own && si.displayName == name =>
           si.symbol
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone): munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:145
144:    assertEquals(o.name, "put")
145:    assertEquals(o.overloads.map(_.symbol), List(s"${P}Box#put().", s"${P}Box#put(+1)."))
146:    as

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:499:69
       .collect {
         case si
             if index
-              .isMethod(si.symbol) && index.owner(si.symbol) == own && si.displayName == name =>
+              .isMethod(si.symbol) && index.owner(si.symbol) == own || si.displayName == name =>
           si.symbol
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone): munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:145
144:    assertEquals(o.name, "put")
145:    assertEquals(o.overloads.map(_.symbol), List(s"${P}Box#put().", s"${P}Box#put(+1)."))
146:    as

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:519:22
     val sym = symbol.value
     val keep = h.bySymbolPath(pathFilter)
     index.info(sym).map(_.signature).collect { case _: s.ClassSignature =>
-      val declared = h.declarationSymbols(sym).filter(keep).map(h.memberInfo(_, sym))
+      val declared = h.declarationSymbols(sym).filterNot(keep).map(h.memberInfo(_, sym))
       val declaredNames = declared.map(_.displayName).toSet
       val inherited = h
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:97
96:    val m = az.members(tpe(s"${P}Dog#")).getOrElse(fail("no members"))
97:    assertEquals(m.declared.map(_.displayName), List("barkM"))
98:

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:521:23
     index.info(sym).map(_.signature).collect { case _: s.ClassSignature =>
       val declared = h.declarationSymbols(sym).filter(keep).map(h.memberInfo(_, sym))
       val declaredNames = declared.map(_.displayName).toSet
-      val inherited = h
-        .linearize(sym)
-        .flatMap(parent => h.declarationSymbols(parent).map(h.memberInfo(_, parent)))
-        .filterNot(m => declaredNames.contains(m.displayName))
-        .filter(m => keep(m.symbol))
+      val inherited = h.linearize(sym).flatMap(parent => h.declarationSymbols(parent).map(h.memberInfo(_, parent))).filterNot(m => declaredNames.contains(m.displayName)).filterNot(m => keep(m.symbol))
         .distinctBy(_.displayName)
       MembersResult(sym, index.displayName(sym), declared, inherited)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:98
97:    assertEquals(m.declared.map(_.displayName), List("barkM"))
98:    assertEquals(m.inherited.map(_.displayName), List("greetM"))
99:
values

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:521:23
     index.info(sym).map(_.signature).collect { case _: s.ClassSignature =>
       val declared = h.declarationSymbols(sym).filter(keep).map(h.memberInfo(_, sym))
       val declaredNames = declared.map(_.displayName).toSet
-      val inherited = h
-        .linearize(sym)
-        .flatMap(parent => h.declarationSymbols(parent).map(h.memberInfo(_, parent)))
-        .filterNot(m => declaredNames.contains(m.displayName))
+      val inherited = h.linearize(sym).flatMap(parent => h.declarationSymbols(parent).map(h.memberInfo(_, parent))).filter(m => declaredNames.contains(m.displayName))
         .filter(m => keep(m.symbol))
         .distinctBy(_.displayName)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.members: declared on the type, inherited from the linearization: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:98
97:    assertEquals(m.declared.map(_.displayName), List("barkM"))
98:    assertEquals(m.inherited.map(_.displayName), List("greetM"))
99:
values

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:536:5
   @pure
   def typeAtPosition(uri: DocumentUri, position: SourcePosition): Option[TypeAtPosition] =
     val docUri = uri.value
-    index
-      .document(docUri)
-      .toSeq
-      .flatMap(_.occurrences)
-      .filter(occ =>
-        occ.range.exists(h.rangeContains(_, position.lineValue, position.characterValue))
-      )
+    index.document(docUri).toSeq.flatMap(_.occurrences).filterNot(occ => occ.range.exists(h.rangeContains(_, position.lineValue, position.characterValue)))
       .minByOption(occ => occ.range.map(h.rangeSpan).getOrElse(Long.MaxValue))
       .map { occ =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:231 nothing at position
230:    val pos = SourcePosition.from(1, 2).fold(fail(_), identity)
231:    val at = az.typeAtPosition(docUri("t.scala"), pos).getOr

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:541:9
       .toSeq
       .flatMap(_.occurrences)
       .filter(occ =>
-        occ.range.exists(h.rangeContains(_, position.lineValue, position.characterValue))
+        occ.range.forall(h.rangeContains(_, position.lineValue, position.characterValue))
       )
       .minByOption(occ => occ.range.map(h.rangeSpan).getOrElse(Long.MaxValue))

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:552:50
           h.typeString(occ.symbol)
         )
       }
-      .ensuring(res => res.forall(_.location.uri == uri.value))
+      .ensuring(res => res.forall(_.location.uri != uri.value))
 
   // --- resolve-implicits ----------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.typeAtPosition picks the smallest occurrence covering the point: java.lang.AssertionError: assertion failed

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:552:24
           h.typeString(occ.symbol)
         )
       }
-      .ensuring(res => res.forall(_.location.uri == uri.value))
+      .ensuring(res => res.exists(_.location.uri == uri.value))
 
   // --- resolve-implicits ----------------------------------------------------

[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:567:30
       ImplicitCandidate(
         h.symbolRef(si.symbol),
         h.renderType(h.producedType(si)),
-        fromExplicitImport = false
+        fromExplicitImport = true
       )
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:164 synthesized, not an explicit import
163:    assertEquals(r.candidates.map(_.target.displayName), List("intShow"))
164:    assert(!r.candidat

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:575:54
       case _          => None
     ImplicitResolution(sym, chosen, candidates)
       .ensuring(res =>
-        res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.forall(c =>
+        res.chosen.isDefined == (res.candidates.size != 1) && res.chosen.forall(c =>
           res.candidates.headOption.exists(_.target == c)
         )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:575:30
       case _          => None
     ImplicitResolution(sym, chosen, candidates)
       .ensuring(res =>
-        res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.forall(c =>
+        res.chosen.isDefined != (res.candidates.size == 1) && res.chosen.forall(c =>
           res.candidates.headOption.exists(_.target == c)
         )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:576:53
     ImplicitResolution(sym, chosen, candidates)
       .ensuring(res =>
         res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.forall(c =>
-          res.candidates.headOption.exists(_.target == c)
+          res.candidates.headOption.exists(_.target != c)
         )
       )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique: java.lang.AssertionError: assertion failed

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:576:11
     ImplicitResolution(sym, chosen, candidates)
       .ensuring(res =>
         res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.forall(c =>
-          res.candidates.headOption.exists(_.target == c)
+          res.candidates.headOption.forall(_.target == c)
         )
       )

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:595:14
       queue match
         case Nil         => steps
         case tpe :: rest =>
-          if seenTypes.contains(tpe) then loop(rest, seenTypes, steps)
+          if true then loop(rest, seenTypes, steps)
           else
             val produced = h.implicitsProducing(tpe)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:486 List()
485:    assertEquals(chain.queryType, "ic/Show#")
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:

[Survived] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:595:14
       queue match
         case Nil         => steps
         case tpe :: rest =>
-          if seenTypes.contains(tpe) then loop(rest, seenTypes, steps)
+          if false then loop(rest, seenTypes, steps)
           else
             val produced = h.implicitsProducing(tpe)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:619:14
       frontier match
         case Nil                          => Nil
         case (path @ (node :: _)) :: rest =>
-          if node == toSym then path.reverse
+          if true then path.reverse
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:619:19
       frontier match
         case Nil                          => Nil
         case (path @ (node :: _)) :: rest =>
-          if node == toSym then path.reverse
+          if node != toSym then path.reverse
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:621:25
         case (path @ (node :: _)) :: rest =>
           if node == toSym then path.reverse
           else
-            val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
+            val nexts = adjacency.getOrElse(node, Nil).map(_._1).filter(seen.contains)
             bfs(rest ::: nexts.map(_ :: path), seen ++ nexts)
         case _ :: rest => bfs(rest, seen) // unreachable: paths are always non-empty
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:188
187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:628:12
     // special case is needed for the trivial path.
     val nodes = bfs(List(List(fromSym)), Set(fromSym))
     val edges = nodes
-      .zip(nodes.drop(1))
+      .zip(nodes.take(1))
       .flatMap { (a, b) =>
         adjacency.getOrElse(a, Nil).find(_._1 == b).map { (_, loc) =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:192
191:      List("a" -> "b", "b" -> "c")
192:    )
193:    val self = az.callPath(method(s"${P}M#a()."), method(s"${P}M#a()."))
values ar

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:630:47
     val edges = nodes
       .zip(nodes.drop(1))
       .flatMap { (a, b) =>
-        adjacency.getOrElse(a, Nil).find(_._1 == b).map { (_, loc) =>
+        adjacency.getOrElse(a, Nil).find(_._1 != b).map { (_, loc) =>
           CallEdge(h.symbolRef(a), h.symbolRef(b), loc)
         }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:192
191:      List("a" -> "b", "b" -> "c")
192:    )
193:    val self = az.callPath(method(s"${P}M#a()."), method(s"${P}M#a()."))
values ar

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:649:10
   ): CallHierarchy =
     val sym = symbol.value
     val adj: Map[String, List[(String, Location)]] =
-      if direction == "callers" then reverseCallGraph else callGraph
+      if true then reverseCallGraph else callGraph
 
     def buildNode(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callees: expands outgoing edges depth-first up to depth limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy: depth=1 shows only direct callers/callees, not deeper
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callees: expands outgoing edges depth-first up to depth limit: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:222 a calls b
221:    val rootChildren = h.root.children.map(_.method.displayName).sorted
222:    assert(rootChildren.contains("b"), "a calls b")

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:649:10
   ): CallHierarchy =
     val sym = symbol.value
     val adj: Map[String, List[(String, Location)]] =
-      if direction == "callers" then reverseCallGraph else callGraph
+      if false then reverseCallGraph else callGraph
 
     def buildNode(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callers: expands incoming edges
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callers: expands incoming edges: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:242
241:    val rootChildren = h.root.children.map(_.method.displayName)
242:    assertEquals(rootChildren, List("b"), "c is called by b")
243:    val bCallers = h.ro

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:658:12
         visited: Set[String]
     ): CallHierarchyNode =
       val children =
-        if remaining <= 0 || visited.contains(current) then Nil
+        if false then Nil
         else
           adj.getOrElse(current, Nil).map { (child, loc) =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy: depth=1 shows only direct callers/callees, not deeper
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy: depth=1 shows only direct callers/callees, not deeper: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:259
258:    assertEquals(h.root.children.map(_.method.displayName), List("b"), "one level: b only")
259:    assertEquals(h.root.children.head.c

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:658:22
         visited: Set[String]
     ): CallHierarchyNode =
       val children =
-        if remaining <= 0 || visited.contains(current) then Nil
+        if remaining >= 0 || visited.contains(current) then Nil
         else
           adj.getOrElse(current, Nil).map { (child, loc) =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callees: expands outgoing edges depth-first up to depth limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callers: expands incoming edges; com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy: depth=1 shows only direct callers/callees, not deeper
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callHierarchy callees: expands outgoing edges depth-first up to depth limit: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerCoreSuite.scala:222 a calls b
221:    val rootChildren = h.root.children.map(_.method.displayName).sorted
222:    assert(rootChildren.contains("b"), "a calls b")

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:704:50
     )
 
     def isValueRef(sym: String): Boolean =
-      !index.isMethod(sym) && !index.isType(sym) && !index.isPackage(sym)
+      !index.isMethod(sym) && !index.isType(sym) || !index.isPackage(sym)
 
     def headType(sym: String): Option[String] =

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:704:28
     )
 
     def isValueRef(sym: String): Boolean =
-      !index.isMethod(sym) && !index.isType(sym) && !index.isPackage(sym)
+      !index.isMethod(sym) || !index.isType(sym) && !index.isPackage(sym)
 
     def headType(sym: String): Option[String] =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:711:38
 
     def widened(from: String, to: String): Boolean =
       (headType(from), headType(to)) match
-        case (Some(a), Some(b)) => a != b
+        case (Some(a), Some(b)) => a == b
         case _                  => false
 

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:712:36
     def widened(from: String, to: String): Boolean =
       (headType(from), headType(to)) match
         case (Some(a), Some(b)) => a != b
-        case _                  => false
+        case _                  => true
 
     def definitionLocation(sym: String): Option[Location] =
