[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:716:37
 
     def definitionLocation(sym: String): Option[Location] =
       index.occurrencesOf(sym).collectFirst {
-        case (uri, occ) if occ.role == DEFINITION => h.location(uri, occ.range)
+        case (uri, occ) if occ.role != DEFINITION => h.location(uri, occ.range)
       }
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:748:51
     // Is `occ` the last value reference in its enclosing method body — a tail/return position?
     def isTailReturn(doc: s.TextDocument, occ: s.SymbolOccurrence): Boolean =
       val ordered = doc.occurrences.sortBy(pos)
-      val methodDefs = ordered.filter(o => o.role == DEFINITION && index.isMethod(o.symbol))
+      val methodDefs = ordered.filter(o => o.role != DEFINITION && index.isMethod(o.symbol))
       val p = pos(occ)
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:748:24
     // Is `occ` the last value reference in its enclosing method body — a tail/return position?
     def isTailReturn(doc: s.TextDocument, occ: s.SymbolOccurrence): Boolean =
       val ordered = doc.occurrences.sortBy(pos)
-      val methodDefs = ordered.filter(o => o.role == DEFINITION && index.isMethod(o.symbol))
+      val methodDefs = ordered.filterNot(o => o.role == DEFINITION && index.isMethod(o.symbol))
       val p = pos(occ)
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:750:37
       val ordered = doc.occurrences.sortBy(pos)
       val methodDefs = ordered.filter(o => o.role == DEFINITION && index.isMethod(o.symbol))
       val p = pos(occ)
-      methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
+      methodDefs.filter(m => pos(m) >= p).lastOption.exists { enclosing =>
         val mPos = pos(enclosing)
         val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:750:7
       val ordered = doc.occurrences.sortBy(pos)
       val methodDefs = ordered.filter(o => o.role == DEFINITION && index.isMethod(o.symbol))
       val p = pos(occ)
-      methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
-        val mPos = pos(enclosing)
-        val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
-        val body = ordered.filter { o =>
-          val q = pos(o)
-          q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
-        }
-        body.lastOption.contains(occ)
-      }
+      methodDefs.filter(m => pos(m) <= p).lastOption.forall { enclosing =>
+  val mPos = pos(enclosing)
+  val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
+  val body = ordered.filter { o =>
+    val q = pos(o)
+    q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
+  }
+  body.lastOption.contains(occ)
+}
 
     def classifyRef(uri: String, doc: s.TextDocument, occ: s.SymbolOccurrence): Option[Flow] =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:752:51
       val p = pos(occ)
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
         val mPos = pos(enclosing)
-        val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
+        val nextDef = methodDefs.find(d => pos(d) < mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:752:51
       val p = pos(occ)
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
         val mPos = pos(enclosing)
-        val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
+        val nextDef = methodDefs.find(d => pos(d) >= mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:753:20
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
         val mPos = pos(enclosing)
         val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
-        val body = ordered.filter { o =>
-          val q = pos(o)
-          q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
-        }
+        val body = ordered.filterNot { o =>
+  val q = pos(o)
+  q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
+}
         body.lastOption.contains(occ)
       }

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:755:45
         val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)
-          q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
+          q > mPos && nextDef.forall(q < _) || o.role == REFERENCE && isValueRef(o.symbol)
         }
         body.lastOption.contains(occ)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:755:40
         val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)
-          q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
+          q > mPos && nextDef.forall(q > _) && o.role == REFERENCE && isValueRef(o.symbol)
         }
         body.lastOption.contains(occ)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:765:46
         occs.foldLeft(Option.empty[s.SymbolOccurrence]) { (acc, x) =>
           acc match
             case None      => Some(x)
-            case Some(max) => if startCol(x) > startCol(max) then Some(x) else Some(max)
+            case Some(max) => if startCol(x) == startCol(max) then Some(x) else Some(max)
         }
 

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:765:34
         occs.foldLeft(Option.empty[s.SymbolOccurrence]) { (acc, x) =>
           acc match
             case None      => Some(x)
-            case Some(max) => if startCol(x) > startCol(max) then Some(x) else Some(max)
+            case Some(max) => if true then Some(x) else Some(max)
         }
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:772:72
         val col = r.startCharacter
         val rEnd = r.endCharacter
         val at = h.location(uri, Some(r))
-        val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
+        val onLine = doc.occurrences.filter(_.range.exists(_.startLine != r.startLine))
         val receiver = onLine.exists(o =>
           o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:772:22
         val col = r.startCharacter
         val rEnd = r.endCharacter
         val at = h.location(uri, Some(r))
-        val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
+        val onLine = doc.occurrences.filterNot(_.range.exists(_.startLine == r.startLine))
         val receiver = onLine.exists(o =>
           o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:773:24
         val rEnd = r.endCharacter
         val at = h.location(uri, Some(r))
         val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
-        val receiver = onLine.exists(o =>
-          o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
-        )
+        val receiver = onLine.forall(o => o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1)
         if receiver then Flow("method_receiver", None, at)
         else

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:774:74
         val at = h.location(uri, Some(r))
         val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
         val receiver = onLine.exists(o =>
-          o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
+          o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) != rEnd + 1
         )
         if receiver then Flow("method_receiver", None, at)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:774:59
         val at = h.location(uri, Some(r))
         val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
         val receiver = onLine.exists(o =>
-          o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
+          o.role == REFERENCE && index.isMethod(o.symbol) || startCol(o) == rEnd + 1
         )
         if receiver then Flow("method_receiver", None, at)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:776:12
         val receiver = onLine.exists(o =>
           o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
         )
-        if receiver then Flow("method_receiver", None, at)
+        if false then Flow("method_receiver", None, at)
         else
           val before = onLine.filter(o => startCol(o) < col)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:776:12
         val receiver = onLine.exists(o =>
           o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
         )
-        if receiver then Flow("method_receiver", None, at)
+        if true then Flow("method_receiver", None, at)
         else
           val before = onLine.filter(o => startCol(o) < col)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:778:55
         )
         if receiver then Flow("method_receiver", None, at)
         else
-          val before = onLine.filter(o => startCol(o) < col)
+          val before = onLine.filter(o => startCol(o) <= col)
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:778:24
         )
         if receiver then Flow("method_receiver", None, at)
         else
-          val before = onLine.filter(o => startCol(o) < col)
+          val before = onLine.filterNot(o => startCol(o) < col)
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:779:69
         if receiver then Flow("method_receiver", None, at)
         else
           val before = onLine.filter(o => startCol(o) < col)
-          val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
+          val methodBefore = before.filter(o => o.role == REFERENCE || index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:779:30
         if receiver then Flow("method_receiver", None, at)
         else
           val before = onLine.filter(o => startCol(o) < col)
-          val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
+          val methodBefore = before.filterNot(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:781:13
           val before = onLine.filter(o => startCol(o) < col)
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
-            before.filter(o =>
-              o.role == DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol)
-            )
+            before.filterNot(o => o.role == DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol))
           val maxLocalDef = maxByStartCol(localDefBefore)
           val maxMethodBefore = maxByStartCol(methodBefore)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:782:36
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>
-              o.role == DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol)
+              o.role == DEFINITION || index.isLocal(o.symbol) && isValueRef(o.symbol)
             )
           val maxLocalDef = maxByStartCol(localDefBefore)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:782:63
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>
-              o.role == DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol)
+              o.role == DEFINITION && index.isLocal(o.symbol) || isValueRef(o.symbol)
             )
           val maxLocalDef = maxByStartCol(localDefBefore)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:791:22
               maxLocalDef match
                 case Some(ld) => Flow("assigned_to", Some(ld.symbol), at)
                 case None     =>
-                  if isTailReturn(doc, occ) then Flow("returned_from", None, at)
+                  if true then Flow("returned_from", None, at)
                   else Flow("discarded", None, at)
             case Some(callee) =>

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:791:22
               maxLocalDef match
                 case Some(ld) => Flow("assigned_to", Some(ld.symbol), at)
                 case None     =>
-                  if isTailReturn(doc, occ) then Flow("returned_from", None, at)
+                  if false then Flow("returned_from", None, at)
                   else Flow("discarded", None, at)
             case Some(callee) =>

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:792:29
                 case Some(ld) => Flow("assigned_to", Some(ld.symbol), at)
                 case None     =>
                   if isTailReturn(doc, occ) then Flow("returned_from", None, at)
-                  else Flow("discarded", None, at)
+                  else Flow("", None, at)
             case Some(callee) =>
               val calleeEnd = endCol(callee)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:796:24
             case Some(callee) =>
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
-                o.role == REFERENCE && isValueRef(o.symbol) &&
+                o.role != REFERENCE && isValueRef(o.symbol) &&
                   o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
               )

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:796:61
             case Some(callee) =>
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
-                o.role == REFERENCE && isValueRef(o.symbol) &&
+                o.role == REFERENCE && isValueRef(o.symbol) ||
                   o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
               )

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:797:91
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
                 o.role == REFERENCE && isValueRef(o.symbol) &&
-                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
+                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter <= col)
               )
               val allParams = valueParamSymbols(callee.symbol)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:797:19
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
                 o.role == REFERENCE && isValueRef(o.symbol) &&
-                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
+                  o.range.forall(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
               )
               val allParams = valueParamSymbols(callee.symbol)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:803:54
               allParams.lift(argIndex) match
                 case Some(p) =>
                   val pName = index.displayName(p)
-                  val coPars = allParams.filterNot(_ == p).map(index.displayName)
+                  val coPars = allParams.filterNot(_ != p).map(index.displayName)
                   Flow("passed_as_arg", Some(p), at, Some(pName), coPars)
                 case None => Flow("passed_as_arg", None, at)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:803:32
               allParams.lift(argIndex) match
                 case Some(p) =>
                   val pName = index.displayName(p)
-                  val coPars = allParams.filterNot(_ == p).map(index.displayName)
+                  val coPars = allParams.filter(_ == p).map(index.displayName)
                   Flow("passed_as_arg", Some(p), at, Some(pName), coPars)
                 case None => Flow("passed_as_arg", None, at)

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:805:35
                   val pName = index.displayName(p)
                   val coPars = allParams.filterNot(_ == p).map(index.displayName)
                   Flow("passed_as_arg", Some(p), at, Some(pName), coPars)
-                case None => Flow("passed_as_arg", None, at)
+                case None => Flow("", None, at)
       }
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:812:48
       index
         .occurrencesOf(sym)
         .iterator
-        .collect { case (uri, occ) if occ.role == REFERENCE => (uri, occ) }
+        .collect { case (uri, occ) if occ.role != REFERENCE => (uri, occ) }
         .flatMap((uri, occ) => index.document(uri).flatMap(classifyRef(uri, _, occ)))
         .toList

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:821:54
         case Flow("returned_from", _, _, _, _)    => "function_result"
         case Flow("method_receiver", _, _, _, _)  => "method_receiver"
         case Flow("passed_as_arg", None, _, _, _) => "external_boundary"
-        case _                                    => "discarded"
+        case _                                    => ""
       }
       List("function_result", "method_receiver", "external_boundary", "discarded")

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:823:50
         case Flow("passed_as_arg", None, _, _, _) => "external_boundary"
         case _                                    => "discarded"
       }
-      List("function_result", "method_receiver", "external_boundary", "discarded")
+      List("function_result", "method_receiver", "", "discarded")
         .find(cs.contains)
         .getOrElse("discarded")

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:823:12
         case Flow("passed_as_arg", None, _, _, _) => "external_boundary"
         case _                                    => "discarded"
       }
-      List("function_result", "method_receiver", "external_boundary", "discarded")
+      List("", "method_receiver", "external_boundary", "discarded")
         .find(cs.contains)
         .getOrElse("discarded")

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:849:20
           val visited2 = visited + sym
           val n = node(sym, depth)
           val nodes2 = n :: nodes
-          if depth >= limit then
+          if depth < limit then
             loop(
               rest,

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:849:14
           val visited2 = visited + sym
           val n = node(sym, depth)
           val nodes2 = n :: nodes
-          if depth >= limit then
+          if false then
             loop(
               rest,

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:856:38
               nodes2,
               edges,
               stopped,
-              ValueFlowTerminal(sym, "depth_limit", n.location) :: truncated
+              ValueFlowTerminal(sym, "", n.location) :: truncated
             )
           else

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:860:29
             )
           else
             val flows = classify(sym)
-            val edgeFlows = flows.filter(_.to.isDefined)
+            val edgeFlows = flows.filterNot(_.to.isDefined)
             val realEdges =
               edgeFlows

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:871:18
                 .distinct
             val targets = edgeFlows.flatMap(_.to).distinct
             val (widenTargets, flowTargets) =
-              if stopOnTypeWidening then targets.partition(widened(sym, _)) else (Nil, targets)
+              if false then targets.partition(widened(sym, _)) else (Nil, targets)
             val widenNodes = widenTargets.map(node(_, depth + 1))
             val widenTerms =

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:871:18
                 .distinct
             val targets = edgeFlows.flatMap(_.to).distinct
             val (widenTargets, flowTargets) =
-              if stopOnTypeWidening then targets.partition(widened(sym, _)) else (Nil, targets)
+              if true then targets.partition(widened(sym, _)) else (Nil, targets)
             val widenNodes = widenTargets.map(node(_, depth + 1))
             val widenTerms =

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:876:18
             val widenTerms =
               widenTargets.map(t => ValueFlowTerminal(t, "type_widened", definitionLocation(t)))
             val symTerminal =
-              if edgeFlows.nonEmpty then Nil
+              if true then Nil
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))
             val enqueue = flowTargets.filterNot(visited2).map((_, depth + 1))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:876:18
             val widenTerms =
               widenTargets.map(t => ValueFlowTerminal(t, "type_widened", definitionLocation(t)))
             val symTerminal =
-              if edgeFlows.nonEmpty then Nil
+              if edgeFlows.isEmpty then Nil
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))
             val enqueue = flowTargets.filterNot(visited2).map((_, depth + 1))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:878:27
             val symTerminal =
               if edgeFlows.nonEmpty then Nil
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))
-            val enqueue = flowTargets.filterNot(visited2).map((_, depth + 1))
+            val enqueue = flowTargets.filter(visited2).map((_, depth + 1))
             loop(
               rest ++ enqueue,
