[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:31:5
   )
 
   def includeInOutline(symbol: String): Boolean =
-    index.info(symbol).exists { si =>
-      outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName != "<init>"
-    }
+    index.info(symbol).forall {
+  si => outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName != "<init>"
+}
 
   // --- annotated source -----------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.includeInOutline keeps named class/field, drops <init> and non-outline kinds
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.includeInOutline keeps named class/field, drops <init> and non-outline kinds: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:187 unknown symbol excluded
186:    assert(!hi.includeInOutline("a/Dog#h."), "parameter kind excluded")
187:    assert(!hi.includeInOutline

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:32:38
 
   def includeInOutline(symbol: String): Boolean =
     index.info(symbol).exists { si =>
-      outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName != "<init>"
+      outlineKinds.contains(si.kind) || si.displayName.nonEmpty && si.displayName != "<init>"
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.includeInOutline keeps named class/field, drops <init> and non-outline kinds
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.includeInOutline keeps named class/field, drops <init> and non-outline kinds: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:186 parameter kind excluded
185:    assert(!hi.includeInOutline("a/Dog#`<init>`()."), "constructor excluded by name")
186:    assert(!hi.in

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:32:41
 
   def includeInOutline(symbol: String): Boolean =
     index.info(symbol).exists { si =>
-      outlineKinds.contains(si.kind) && si.displayName.nonEmpty && si.displayName != "<init>"
+      outlineKinds.contains(si.kind) && si.displayName.isEmpty && si.displayName != "<init>"
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:68
67:    val top = az.outline(docUri("o.scala")).getOrElse(fail("not indexed"))
68:    assertEquals(top.map(_.symbol), List("o/C#"), "one top-le

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:46:34
   def syntheticAnnotation(syn: s.Synthetic): Option[SourceAnnotation] =
     val r = syn.range.getOrElse(s.Range.defaultInstance)
     syn.tree match
-      case t: s.TypeApplyTree if t.typeArguments.nonEmpty =>
+      case t: s.TypeApplyTree if t.typeArguments.isEmpty =>
         Some(
           SourceAnnotation(

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:51:13
           SourceAnnotation(
             r.startLine,
             r.startCharacter,
-            "inferred-type-args",
+            "",
             t.typeArguments.map(renderType).mkString("[", ", ", "]")
           )

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:52:54
             r.startLine,
             r.startCharacter,
             "inferred-type-args",
-            t.typeArguments.map(renderType).mkString("[", ", ", "]")
+            t.typeArguments.map(renderType).mkString("", ", ", "]")
           )
         )

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:52:59
             r.startLine,
             r.startCharacter,
             "inferred-type-args",
-            t.typeArguments.map(renderType).mkString("[", ", ", "]")
+            t.typeArguments.map(renderType).mkString("[", "", "]")
           )
         )

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:61:25
           // range is the enclosing point, not where the args belong — no reliable column.
           case _: s.OriginalTree =>
             val args = app.arguments.iterator.flatMap(insertedName).toList
-            Option.when(args.nonEmpty)(
+            Option.when(args.isEmpty)(
               SourceAnnotation(
                 r.startLine,

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:66:42
                 r.startLine,
                 r.startCharacter,
                 "implicit",
-                args.mkString("(using ", ", ", ")")
+                args.mkString("(using ", "", ")")
               )
             )

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:73:86
           // expression, so the column is meaningful.
           case fn =>
             insertedName(fn).map(c =>
-              SourceAnnotation(r.startLine, r.startCharacter, "implicit-conversion", s"$c(…)")
+              SourceAnnotation(r.startLine, r.startCharacter, "implicit-conversion", "")
             )
       case _ => None

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:73:63
           // expression, so the column is meaningful.
           case fn =>
             insertedName(fn).map(c =>
-              SourceAnnotation(r.startLine, r.startCharacter, "implicit-conversion", s"$c(…)")
+              SourceAnnotation(r.startLine, r.startCharacter, "", s"$c(…)")
             )
       case _ => None

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:96:17
       occ: s.SymbolOccurrence,
       sourceLines: IndexedSeq[String]
   ): Option[SourceAnnotation] =
-    if occ.role != s.SymbolOccurrence.Role.DEFINITION then None
+    if occ.role == s.SymbolOccurrence.Role.DEFINITION then None
     else
       index

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:96:8
       occ: s.SymbolOccurrence,
       sourceLines: IndexedSeq[String]
   ): Option[SourceAnnotation] =
-    if occ.role != s.SymbolOccurrence.Role.DEFINITION then None
+    if false then None
     else
       index

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:98:7
   ): Option[SourceAnnotation] =
     if occ.role != s.SymbolOccurrence.Role.DEFINITION then None
     else
-      index
-        .info(occ.symbol)
-        .filter(si => annotatedDefKinds.contains(si.kind) && si.displayName != "<init>")
+      index.info(occ.symbol).filterNot(si => annotatedDefKinds.contains(si.kind) && si.displayName != "<init>")
         .flatMap { si =>
           val tpe = si.signature match

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:100:77
     else
       index
         .info(occ.symbol)
-        .filter(si => annotatedDefKinds.contains(si.kind) && si.displayName != "<init>")
+        .filter(si => annotatedDefKinds.contains(si.kind) && si.displayName == "<init>")
         .flatMap { si =>
           val tpe = si.signature match

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:100:59
     else
       index
         .info(occ.symbol)
-        .filter(si => annotatedDefKinds.contains(si.kind) && si.displayName != "<init>")
+        .filter(si => annotatedDefKinds.contains(si.kind) || si.displayName != "<init>")
         .flatMap { si =>
           val tpe = si.signature match

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:109:14
           val rendered = renderType(tpe)
           val r = occ.range.getOrElse(s.Range.defaultInstance)
           val line = sourceLines.lift(r.startLine).getOrElse("")
-          if rendered.isEmpty || alreadyAscribed(line, r.startCharacter) then None
+          if true then None
           else
             Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", s": $rendered"))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:109:14
           val rendered = renderType(tpe)
           val r = occ.range.getOrElse(s.Range.defaultInstance)
           val line = sourceLines.lift(r.startLine).getOrElse("")
-          if rendered.isEmpty || alreadyAscribed(line, r.startCharacter) then None
+          if rendered.nonEmpty || alreadyAscribed(line, r.startCharacter) then None
           else
             Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", s": $rendered"))

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:120:12
   def alreadyAscribed(line: String, nameStart: Int): Boolean =
     @annotation.tailrec
     def scan(i: Int, depth: Int): Boolean =
-      if i >= line.length then false
+      if i > line.length then false
       else
         line.charAt(i) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start: java.lang.StringIndexOutOfBoundsException: Index 5 out of bounds for length 5

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:120:10
   def alreadyAscribed(line: String, nameStart: Int): Boolean =
     @annotation.tailrec
     def scan(i: Int, depth: Int): Boolean =
-      if i >= line.length then false
+      if false then false
       else
         line.charAt(i) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start: java.lang.StringIndexOutOfBoundsException: Index 5 out of bounds for length 5

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:123:29
       if i >= line.length then false
       else
         line.charAt(i) match
-          case '=' if depth == 0 => false
+          case '=' if depth != 0 => false
           case ':' if depth == 0 => true
           case '(' | '['         => scan(i + 1, depth + 1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: 201:    assert(!h.alreadyAscribed("val x", 0), "scanned to end with no colon/equals -> not ascribed")
202:    assert(!h.alreadyAscribed("a = b: c", 0), "a top-level '=' stops the scan before the later ':'")
203:    assert(h.alreadyAscribed("x: Int", 0), "a colon at start position counts (nameStart == 0)")

[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:123:37
       if i >= line.length then false
       else
         line.charAt(i) match
-          case '=' if depth == 0 => false
+          case '=' if depth == 0 => true
           case ':' if depth == 0 => true
           case '(' | '['         => scan(i + 1, depth + 1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:96 no ascription
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "explicit ascription")
96:    assert(!h.alreadyAscribed("val x = 1", 4), "no ascripti

[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:124:37
       else
         line.charAt(i) match
           case '=' if depth == 0 => false
-          case ':' if depth == 0 => true
+          case ':' if depth == 0 => false
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:95 explicit ascription
94:  test("alreadyAscribed finds a top-level colon before the body's ="):
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "expl

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:124:29
       else
         line.charAt(i) match
           case '=' if depth == 0 => false
-          case ':' if depth == 0 => true
+          case ':' if depth != 0 => true
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:95 explicit ascription
94:  test("alreadyAscribed finds a top-level colon before the body's ="):
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "expl

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:128:33
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
           case _                 => scan(i + 1, depth)
-    nameStart >= 0 && nameStart < line.length && scan(nameStart, 0)
+    nameStart >= 0 && nameStart == line.length && scan(nameStart, 0)
 
   // --- move plan ------------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:95 explicit ascription
94:  test("alreadyAscribed finds a top-level colon before the body's ="):
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "expl

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:128:47
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
           case _                 => scan(i + 1, depth)
-    nameStart >= 0 && nameStart < line.length && scan(nameStart, 0)
+    nameStart >= 0 && nameStart < line.length || scan(nameStart, 0)
 
   // --- move plan ------------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:96 no ascription
95:    assert(h.alreadyAscribed("val x: Int = 1", 4), "explicit ascription")
96:    assert(!h.alreadyAscribed("val x = 1", 4), "no ascripti

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:150:13
     */
   @pure
   def joinFqn(pkg: String, name: String): String =
-    require(name.nonEmpty)
+    require(name.isEmpty)
     if pkg.isEmpty then name else s"$pkg.$name"
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: java.lang.IllegalArgumentException: requirement failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:151:8
   @pure
   def joinFqn(pkg: String, name: String): String =
     require(name.nonEmpty)
-    if pkg.isEmpty then name else s"$pkg.$name"
+    if true then name else s"$pkg.$name"
 
   /** The package a document belongs to: the owner of its first top-level global definition. `None`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:143
142:    val plan = az.movePlan(sym, dest)
143:    assertEquals(plan.fromFqn, "m.pkg.Foo")
144:    assertEquals(plan.toFqn, "m.dest.Foo"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:151:8
   @pure
   def joinFqn(pkg: String, name: String): String =
     require(name.nonEmpty)
-    if pkg.isEmpty then name else s"$pkg.$name"
+    if pkg.nonEmpty then name else s"$pkg.$name"
 
   /** The package a document belongs to: the owner of its first top-level global definition. `None`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:143
142:    val plan = az.movePlan(sym, dest)
143:    assertEquals(plan.fromFqn, "m.pkg.Foo")
144:    assertEquals(plan.toFqn, "m.dest.Foo"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:158:7
     */
   def documentPackage(uri: String): Option[String] =
     index.document(uri).flatMap { doc =>
-      doc.occurrences.iterator
-        .filter(_.role == s.SymbolOccurrence.Role.DEFINITION)
+      doc.occurrences.iterator.filterNot(_.role == s.SymbolOccurrence.Role.DEFINITION)
         .map(_.symbol)
         .filter(index.isGlobal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:158:7
     */
   def documentPackage(uri: String): Option[String] =
     index.document(uri).flatMap { doc =>
-      doc.occurrences.iterator
-        .filter(_.role == s.SymbolOccurrence.Role.DEFINITION)
-        .map(_.symbol)
-        .filter(index.isGlobal)
+      doc.occurrences.iterator.filter(_.role == s.SymbolOccurrence.Role.DEFINITION).map(_.symbol).filterNot(index.isGlobal)
         .map(index.owner)
         .find(index.isPackage)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:159:24
   def documentPackage(uri: String): Option[String] =
     index.document(uri).flatMap { doc =>
       doc.occurrences.iterator
-        .filter(_.role == s.SymbolOccurrence.Role.DEFINITION)
+        .filter(_.role != s.SymbolOccurrence.Role.DEFINITION)
         .map(_.symbol)
         .filter(index.isGlobal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:156
155:      "dest-package referrer needs no import"
156:    )
157:
dest-package referrer needs no import
=> Obtained
Set(
  MoveImport(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:170:50
 
   /** A local symbol's display name (locals carry no descriptor, so fall back to the index). */
   def localName(symbol: String): String =
-    index.info(symbol).map(_.displayName).filter(_.nonEmpty).getOrElse(symbol)
+    index.info(symbol).map(_.displayName).filter(_.isEmpty).getOrElse(symbol)
 
   /** A local's rendered type, or `?` when SemanticDB recorded none — Scala leaves the inferred type
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:170:5
 
   /** A local symbol's display name (locals carry no descriptor, so fall back to the index). */
   def localName(symbol: String): String =
-    index.info(symbol).map(_.displayName).filter(_.nonEmpty).getOrElse(symbol)
+    index.info(symbol).map(_.displayName).filterNot(_.nonEmpty).getOrElse(symbol)
 
   /** A local's rendered type, or `?` when SemanticDB recorded none — Scala leaves the inferred type
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: occurrences without a range never enter the selection sets
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:182
181:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
182:    assertEquals(pla

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:178:8
     */
   def localTypeText(symbol: String): String =
     val rendered = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))
-    if rendered.isEmpty then "?" else rendered
+    if false then "?" else rendered
 
   // --- path / glob predicates -----------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.localTypeText renders the type, or '?' when SemanticDB recorded none
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.localTypeText renders the type, or '?' when SemanticDB recorded none: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:218
217:    assertEquals(lh.localTypeText("local0"), "Int")
218:    assertEquals(lh.localTypeText("local1"), "?", "an unascribed local ha

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:178:8
     */
   def localTypeText(symbol: String): String =
     val rendered = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))
-    if rendered.isEmpty then "?" else rendered
+    if true then "?" else rendered
 
   // --- path / glob predicates -----------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two params render with separators; a param read after is not a return
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:184
183:    assertEquals(plan.returns.map(_.name), List("b"), "defined inside, read after")
184:    assertEquals(plan.returnType, "I

[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:187:31
     */
   def globMatcher(pattern: Option[String]): String => Boolean =
     pattern match
-      case None       => _ => true
+      case None       => _ => false
       case Some(glob) =>
         val regex = glob.split("\\*", -1).map(java.util.regex.Pattern.quote).mkString(".*").r
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols sorts by the chosen metric and honours the limit: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:212
211:      .map((sym, _) => sym.displayName)
212:    assertEquals(byAfferent, List("A"), "A (depended on) ranks highest by afferent, li

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:189:32
     pattern match
       case None       => _ => true
       case Some(glob) =>
-        val regex = glob.split("\\*", -1).map(java.util.regex.Pattern.quote).mkString(".*").r
+        val regex = glob.split("", -1).map(java.util.regex.Pattern.quote).mkString(".*").r
         uri => regex.findFirstIn(uri).isDefined
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.globMatcher: None keeps all; literal is substring; * is wildcard
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.globMatcher: None keeps all; literal is substring; * is wildcard: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:114 assertion failed
113:    val abGlob = h.globMatcher(Some("a*b"))
114:    assert(abGlob("axxb"))
115:    assert(abGlob("ab"))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:201:16
       case None    => _ => true
       case Some(_) =>
         val keepUri = globMatcher(pattern)
-        sym => definitionUri(sym).exists(keepUri)
+        sym => definitionUri(sym).forall(keepUri)
 
   /** The document uri of a symbol's definition occurrence, if the index has one. */
