[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:206:35
   /** The document uri of a symbol's definition occurrence, if the index has one. */
   def definitionUri(symbol: String): Option[String] =
     index.occurrencesOf(symbol).collectFirst {
-      case (uri, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => uri
+      case (uri, occ) if occ.role != s.SymbolOccurrence.Role.DEFINITION => uri
     }
 

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:225:14
       queue match
         case Nil          => acc.reverse
         case head :: tail =>
-          if seen.contains(head) then loop(tail, seen, acc)
+          if true then loop(tail, seen, acc)
           else loop(parentsOf(head) ::: tail, seen + head, head :: acc)
     loop(parentsOf(symbol), Set.empty, Nil)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.linearize and knownSubtypes walk the parent relation; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.linearize de-duplicates a diamond (a shared ancestor appears once)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.linearize and knownSubtypes walk the parent relation: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:194
193:  test("linearize and knownSubtypes walk the parent relation"):
194:    assertEquals(hi.linearize("a/Dog#"), List("a/Animal#"))
195:    assertEqu

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:225:14
       queue match
         case Nil          => acc.reverse
         case head :: tail =>
-          if seen.contains(head) then loop(tail, seen, acc)
+          if false then loop(tail, seen, acc)
           else loop(parentsOf(head) ::: tail, seen + head, head :: acc)
     loop(parentsOf(symbol), Set.empty, Nil)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.linearize de-duplicates a diamond (a shared ancestor appears once)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.linearize de-duplicates a diamond (a shared ancestor appears once): munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:245
244:    val lin = AnalyzerHelpers(dia).linearize("d/A#")
245:    assertEquals(lin.distinct, lin, s"no duplicate ancestors: $lin")
246:

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:247:42
   def implicitsProducing(typeSymbol: String): List[s.SymbolInformation] =
     index.symbols.values
       .collect {
-        case si if isGivenDefinition(si) && parentSymbol(producedType(si)).contains(typeSymbol) =>
+        case si if isGivenDefinition(si) || parentSymbol(producedType(si)).contains(typeSymbol) =>
           si
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.implicitsProducing returns only givens whose produced type matches; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.implicitsProducing returns only givens whose produced type matches: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:283
282:    )
283:    assertEquals(gh.implicitsProducing("g/T#").map(_.symbol), List("g/inst."))
284:
values are not the same
=> Obtained
L

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:255:22
 
   def isGivenDefinition(info: s.SymbolInformation): Boolean =
     val k = info.kind
-    isImplicit(info) &&
+    isImplicit(info) ||
     (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
     !index.info(index.owner(info.symbol)).exists(isImplicit)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.isGivenDefinition requires implicit AND an object/def kind
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.isGivenDefinition requires implicit AND an object/def kind: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:259 object but not implicit
258:      "object but not implicit"
259:    )
260:    assert(!h.isGivenDefinition(info(s.SymbolInformation.Kind.FIELD, IMPL)), "i

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:256:48
   def isGivenDefinition(info: s.SymbolInformation): Boolean =
     val k = info.kind
     isImplicit(info) &&
-    (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
+    (k == s.SymbolInformation.Kind.OBJECT || k != s.SymbolInformation.Kind.METHOD) &&
     !index.info(index.owner(info.symbol)).exists(isImplicit)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:486 List()
485:    assertEquals(chain.queryType, "ic/Show#")
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:256:84
   def isGivenDefinition(info: s.SymbolInformation): Boolean =
     val k = info.kind
     isImplicit(info) &&
-    (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
+    (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) ||
     !index.info(index.owner(info.symbol)).exists(isImplicit)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.isGivenDefinition requires implicit AND an object/def kind; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.implicitsProducing returns only givens whose produced type matches; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.isGivenDefinition requires implicit AND an object/def kind: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:259 object but not implicit
258:      "object but not implicit"
259:    )
260:    assert(!h.isGivenDefinition(info(s.SymbolInformation.Kind.FIELD, IMPL)), "i

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:257:6
     val k = info.kind
     isImplicit(info) &&
     (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
-    !index.info(index.owner(info.symbol)).exists(isImplicit)
+    !index.info(index.owner(info.symbol)).forall(isImplicit)
 
   /** The type an implicit instance provides: a given object's first non-Object parent, or a given
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:486 List()
485:    assertEquals(chain.queryType, "ic/Show#")
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:273:78
     * with the interface that class extends; otherwise return `tpe` unchanged.
     */
   def unwrapSelfClass(tpe: s.Type, givenName: String): s.Type =
-    val isSelfClass = parentSymbol(tpe).exists(sym => index.displayName(sym) == givenName)
+    val isSelfClass = parentSymbol(tpe).exists(sym => index.displayName(sym) != givenName)
     if !isSelfClass then tpe
     else
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:307
306:    // the produced type is the interface Show, not the synthetic self-class foo
307:    assertEquals(wh.parentSymbol(wh.producedT

[Survived] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:273:23
     * with the interface that class extends; otherwise return `tpe` unchanged.
     */
   def unwrapSelfClass(tpe: s.Type, givenName: String): s.Type =
-    val isSelfClass = parentSymbol(tpe).exists(sym => index.displayName(sym) == givenName)
+    val isSelfClass = parentSymbol(tpe).forall(sym => index.displayName(sym) == givenName)
     if !isSelfClass then tpe
     else

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:274:8
     */
   def unwrapSelfClass(tpe: s.Type, givenName: String): s.Type =
     val isSelfClass = parentSymbol(tpe).exists(sym => index.displayName(sym) == givenName)
-    if !isSelfClass then tpe
+    if false then tpe
     else
       parentSymbol(tpe)
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] resolve-implicits: Show has candidates
statusReason: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] resolve-implicits: Show has candidates: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/CompatSuite.scala:118 expected at least intShow/listShow
117:      val r = az.resolveImplicits(tpe(show))
118:      assert(r.candidates.nonEmpty, "expected at least intShow/listShow")
119:

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:274:8
     */
   def unwrapSelfClass(tpe: s.Type, givenName: String): s.Type =
     val isSelfClass = parentSymbol(tpe).exists(sym => index.displayName(sym) == givenName)
-    if !isSelfClass then tpe
+    if true then tpe
     else
       parentSymbol(tpe)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:307
306:    // the produced type is the interface Show, not the synthetic self-class foo
307:    assertEquals(wh.parentSymbol(wh.producedT

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:284:33
         .getOrElse(tpe)
 
   def notObject(tpe: s.Type): Boolean =
-    !parentSymbol(tpe).contains("java/lang/Object#")
+    !parentSymbol(tpe).contains("")
 
   /** Head symbols of an implicit method's implicit-parameter types (its dependencies). */
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.parentSymbol and notObject
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.parentSymbol and notObject: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:123 Object is Object
122:    assert(h.notObject(IntT), "Int is not Object")
123:    assert(!h.notObject(ref("java/lang/Object#")), "Object is Object")
124:

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:290:9
   def implicitDependencyHeads(info: s.SymbolInformation): List[String] =
     info.signature match
       case m: s.MethodSignature =>
-        m.parameterLists.toList
-          .flatMap(scope => scopeInfos(Some(scope)))
-          .filter(isImplicit)
+        m.parameterLists.toList.flatMap(scope => scopeInfos(Some(scope))).filterNot(isImplicit)
           .flatMap(p => parentSymbol(valueType(p)))
       case _ => Nil
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:487 transitive Eq given reached
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:    assert(chain.steps.exists(_.

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:362:10
 
   def scopeInfos(scope: Option[s.Scope]): Seq[s.SymbolInformation] =
     scope.toSeq.flatMap { sc =>
-      if sc.hardlinks.nonEmpty then sc.hardlinks
+      if sc.hardlinks.isEmpty then sc.hardlinks
       else sc.symlinks.flatMap(index.info)
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:487 transitive Eq given reached
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:    assert(chain.steps.exists(_.

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:362:10
 
   def scopeInfos(scope: Option[s.Scope]): Seq[s.SymbolInformation] =
     scope.toSeq.flatMap { sc =>
-      if sc.hardlinks.nonEmpty then sc.hardlinks
+      if false then sc.hardlinks
       else sc.symlinks.flatMap(index.info)
     }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:487 transitive Eq given reached
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:    assert(chain.steps.exists(_.

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:373:69
       case _                    => s.Type.Empty
 
   def isImplicit(info: s.SymbolInformation): Boolean =
-    (info.properties & s.SymbolInformation.Property.IMPLICIT.value) != 0
+    (info.properties & s.SymbolInformation.Property.IMPLICIT.value) == 0
 
   def renderMethod(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain walks given dependencies transitively: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:486 List()
485:    assertEquals(chain.queryType, "ic/Show#")
486:    assert(chain.steps.exists(_.target.displayName == "showFromEq"), chain.steps.toString)
487:

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:381:17
       plists: List[ParameterList],
       ret: String
   ): String =
-    val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
+    val tp = if true then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
       val prefix = if pl.isImplicit then "implicit " else ""
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:74
73:      "def g[A, B](x: A, y: B): B"
74:    )
75:    assertEquals(
values are not the same
=> Obtained
def g(x: A, y: B): B
=> Diff (- expected, + o

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:381:17
       plists: List[ParameterList],
       ret: String
   ): String =
-    val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
+    val tp = if false then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
       val prefix = if pl.isImplicit then "implicit " else ""
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:65
64:      "def f(x: Int): Int"
65:    )
66:    assertEquals(
values are not the same
=> Obtained
def f[](x: Int): Int
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:383:23
   ): String =
     val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
-      val prefix = if pl.isImplicit then "implicit " else ""
+      val prefix = if true then "implicit " else ""
       pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
     }.mkString
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:65
64:      "def f(x: Int): Int"
65:    )
66:    assertEquals(
values are not the same
=> Obtained
def f(implicit x: Int): Int
=> Diff (- expected, + ob

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:383:23
   ): String =
     val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
-      val prefix = if pl.isImplicit then "implicit " else ""
+      val prefix = if false then "implicit " else ""
       pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
     }.mkString
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:78
77:      "def e(implicit c: C): Unit"
78:    )
79:
values are not the same
=> Obtained
def e(c: C): Unit
=> Diff (- expected, + obtained)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:384:82
     val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
       val prefix = if pl.isImplicit then "implicit " else ""
-      pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
+      pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", "")
     }.mkString
     s"def $name$tp$ps: $ret"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:65
64:      "def f(x: Int): Int"
65:    )
66:    assertEquals(
values are not the same
=> Obtained
def f(x: Int: Int
=> Diff (- expected, + obtained)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:384:76
     val tp = if tparams.isEmpty then "" else tparams.mkString("[", ", ", "]")
     val ps = plists.map { pl =>
       val prefix = if pl.isImplicit then "implicit " else ""
-      pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
+      pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", "", ")")
     }.mkString
     s"def $name$tp$ps: $ret"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderMethod: type params, implicit lists, separators: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:74
73:      "def g[A, B](x: A, y: B): B"
74:    )
75:    assertEquals(
values are not the same
=> Obtained
def g[A, B](x: Ay: B): B
=> Diff (- expected,

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:386:5
       val prefix = if pl.isImplicit then "implicit " else ""
       pl.parameters.map(p => s"${p.name}: ${p.tpe}").mkString(s"($prefix", ", ", ")")
     }.mkString
-    s"def $name$tp$ps: $ret"
+    ""
 
   /** Best-effort rendering of a SemanticDB type to readable Scala-ish text. */
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.FailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:71 method signature
70:    assertEquals(kids.map(_.name), List("m", "v"), "members nested and ordered by line")
71:    assert(kids.find(_.name == "m").get.

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:393:12
     tpe match
       case s.TypeRef(_, sym, args) =>
         val base = index.displayName(sym)
-        if args.isEmpty then base else args.map(renderType).mkString(s"$base[", ", ", "]")
+        if false then base else args.map(renderType).mkString(s"$base[", ", ", "]")
       case s.SingleType(_, sym)    => s"${index.displayName(sym)}.type"
       case s.ThisType(sym)         => s"${index.displayName(sym)}.this"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outline nests members under their type with per-entry signatures: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:72
71:    assert(kids.find(_.name == "m").get.signature.startsWith("def m"), "method signature")
72:    assertEquals(kids.find(_.name == "v").get

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:393:12
     tpe match
       case s.TypeRef(_, sym, args) =>
         val base = index.displayName(sym)
-        if args.isEmpty then base else args.map(renderType).mkString(s"$base[", ", ", "]")
+        if true then base else args.map(renderType).mkString(s"$base[", ", ", "]")
       case s.SingleType(_, sym)    => s"${index.displayName(sym)}.type"
       case s.ThisType(sym)         => s"${index.displayName(sym)}.this"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: TypeRef with and without type arguments
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: TypeRef with and without type arguments: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:26
25:    assertEquals(h.renderType(IntT), "Int")
26:    assertEquals(h.renderType(ref("scala/collection/immutable/List#", IntT)), "List[Int]")
27:    ass

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:397:39
       case s.SingleType(_, sym)    => s"${index.displayName(sym)}.type"
       case s.ThisType(sym)         => s"${index.displayName(sym)}.this"
       case s.SuperType(_, sym)     => index.displayName(sym)
-      case s.ByNameType(t)         => s"=> ${renderType(t)}"
+      case s.ByNameType(t)         => ""
       case s.RepeatedType(t)       => s"${renderType(t)}*"
       case s.WithType(ts)          => ts.map(renderType).mkString(" with ")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:33
32:    assertEquals(h.renderType(s.SuperType(s.Type.Empty, "a/B#")), "B")
33:    assertEquals(h.renderType(s.ByNameType(IntT)), "=> Int")
34:

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:398:39
       case s.ThisType(sym)         => s"${index.displayName(sym)}.this"
       case s.SuperType(_, sym)     => index.displayName(sym)
       case s.ByNameType(t)         => s"=> ${renderType(t)}"
-      case s.RepeatedType(t)       => s"${renderType(t)}*"
+      case s.RepeatedType(t)       => ""
       case s.WithType(ts)          => ts.map(renderType).mkString(" with ")
       case s.IntersectionType(ts)  => ts.map(renderType).mkString(" & ")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:34
33:    assertEquals(h.renderType(s.ByNameType(IntT)), "=> Int")
34:    assertEquals(h.renderType(s.RepeatedType(IntT)), "Int*")
35:    assertEqua

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:399:67
       case s.SuperType(_, sym)     => index.displayName(sym)
       case s.ByNameType(t)         => s"=> ${renderType(t)}"
       case s.RepeatedType(t)       => s"${renderType(t)}*"
-      case s.WithType(ts)          => ts.map(renderType).mkString(" with ")
+      case s.WithType(ts)          => ts.map(renderType).mkString("")
       case s.IntersectionType(ts)  => ts.map(renderType).mkString(" & ")
       case s.UnionType(ts)         => ts.map(renderType).mkString(" | ")
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:35
34:    assertEquals(h.renderType(s.RepeatedType(IntT)), "Int*")
35:    assertEquals(h.renderType(s.WithType(List(IntT, StringT))), "Int with Stri

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:400:67
       case s.ByNameType(t)         => s"=> ${renderType(t)}"
       case s.RepeatedType(t)       => s"${renderType(t)}*"
       case s.WithType(ts)          => ts.map(renderType).mkString(" with ")
-      case s.IntersectionType(ts)  => ts.map(renderType).mkString(" & ")
+      case s.IntersectionType(ts)  => ts.map(renderType).mkString("")
       case s.UnionType(ts)         => ts.map(renderType).mkString(" | ")
       case s.AnnotatedType(_, t)   => renderType(t)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderType: every non-TypeRef shape and the empty default: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:36
35:    assertEquals(h.renderType(s.WithType(List(IntT, StringT))), "Int with String")
36:    assertEquals(h.renderType(s.IntersectionType(List(In
