[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:417:36
       case s.FloatConstant(v)   => s"${v}f"
       case s.DoubleConstant(v)  => v.toString
       case s.BooleanConstant(v) => v.toString
-      case s.CharConstant(v)    => s"'${v.toChar}'"
+      case s.CharConstant(v)    => ""
       case s.StringConstant(v)  => s"\"$v\""
       case s.ShortConstant(v)   => v.toString
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:53
52:    assertEquals(h.renderConstant(s.BooleanConstant(true)), "true")
53:    assertEquals(h.renderConstant(s.CharConstant('a'.toInt)), "'a'")
54:    assertEquals(h.re

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:421:36
       case s.StringConstant(v)  => s"\"$v\""
       case s.ShortConstant(v)   => v.toString
       case s.ByteConstant(v)    => v.toString
-      case s.UnitConstant()     => "Unit"
+      case s.UnitConstant()     => ""
       case s.NullConstant()     => "null"
       case _                    => ""
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.renderConstant: every constant kind: munit.ComparisonFailException: analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerHelpersSuite.scala:57
56:    assertEquals(h.renderConstant(s.ByteConstant(4)), "4")
57:    assertEquals(h.renderConstant(s.UnitConstant()), "Unit")
58:    assertEquals(h.renderConstant(s.Nu
