[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/PureKernels.scala:121:17
   @pure
   def rangeSpan(startLine: Int, endLine: Int, startChar: Int, endChar: Int): Long =
     require(
-      startLine >= 0 && endLine >= startLine &&
+      startLine > 0 && endLine >= startLine &&
         startChar >= 0 && endChar >= 0 &&
         (if endLine == startLine then endChar >= startChar
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange returns None before any declaration (no enclosing def)
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange returns None before any declaration (no enclosing def): java.lang.IllegalArgumentException: requirement failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/PureKernels.scala:144:9
   @pure
   def nextLevel(acc: Int, childLevel: Int): Int =
     require(acc >= 0 && childLevel >= 0 && childLevel < Int.MaxValue)
-    (if acc >= childLevel + 1 then acc else childLevel + 1).ensuring(r =>
+    (if false then acc else childLevel + 1).ensuring(r =>
       r >= acc && r >= childLevel + 1 && r >= 0
     )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations: java.lang.AssertionError: assertion failed
