[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:50:67
       case t: s.TypeApplyTree if t.typeArguments.nonEmpty =>
         // Anchor the inferred type-args to the CALL they apply to (`a.map[String]`), not the token
         // at the range start — which is the receiver (`a`), reading as `a[String]`.
-        val targs = t.typeArguments.map(renderType).mkString("[", ", ", "]")
+        val targs = t.typeArguments.map(renderType).mkString("[", "", "]")
         val anchor = functionAnchor(t.function, sourceLines)
         Some(

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:57:16
             r.startLine,
             r.startCharacter,
             "inferred-type-args",
-            if anchor.isEmpty then targs else s"$anchor$targs"
+            if true then targs else s"$anchor$targs"
           )
         )

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:57:16
             r.startLine,
             r.startCharacter,
             "inferred-type-args",
-            if anchor.isEmpty then targs else s"$anchor$targs"
+            if false then targs else s"$anchor$targs"
           )
         )

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:65:25
           // using-args appended to a visible call: the function IS the original expression.
           case _: s.OriginalTree =>
             val args = app.arguments.iterator.flatMap(insertedSymbol).map(givenDisplay).toList
-            Option.when(args.nonEmpty)(
+            Option.when(args.isEmpty)(
               SourceAnnotation(
                 r.startLine,

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:70:31
                 r.startLine,
                 r.startCharacter,
                 "implicit",
-                args.mkString("(using ", ", ", ")")
+                args.mkString("", ", ", ")")
               )
             )

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:77:13
           // `apply` is the compiler's `.apply` insertion, not a real conversion — the type-args
           // note already covers that call, so drop it here.
           case fn =>
-            insertedName(fn).filter(_ != "apply").map { c =>
+            insertedName(fn).filterNot(_ != "apply").map { c =>
               val arg =
                 app.arguments.headOption.flatMap(convertedText(_, sourceLines)).getOrElse("…")

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:77:39
           // `apply` is the compiler's `.apply` insertion, not a real conversion — the type-args
           // note already covers that call, so drop it here.
           case fn =>
-            insertedName(fn).filter(_ != "apply").map { c =>
+            insertedName(fn).filter(_ == "apply").map { c =>
               val arg =
                 app.arguments.headOption.flatMap(convertedText(_, sourceLines)).getOrElse("…")

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:120:63
     */
   private def givenDisplay(symbol: String): String =
     val name = index.displayName(symbol)
-    val uninformative = name.isEmpty || name.contains('$') || name.headOption.exists(_.isUpper)
+    val uninformative = name.isEmpty || name.contains('$') || name.headOption.forall(_.isUpper)
     if !uninformative then name
     else

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:120:60
     */
   private def givenDisplay(symbol: String): String =
     val name = index.displayName(symbol)
-    val uninformative = name.isEmpty || name.contains('$') || name.headOption.exists(_.isUpper)
+    val uninformative = name.isEmpty || name.contains('$') && name.headOption.exists(_.isUpper)
     if !uninformative then name
     else

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:121:8
   private def givenDisplay(symbol: String): String =
     val name = index.displayName(symbol)
     val uninformative = name.isEmpty || name.contains('$') || name.headOption.exists(_.isUpper)
-    if !uninformative then name
+    if false then name
     else
       val tpe = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:121:8
   private def givenDisplay(symbol: String): String =
     val name = index.displayName(symbol)
     val uninformative = name.isEmpty || name.contains('$') || name.headOption.exists(_.isUpper)
-    if !uninformative then name
+    if true then name
     else
       val tpe = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:124:10
     if !uninformative then name
     else
       val tpe = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))
-      if tpe.nonEmpty then tpe
+      if true then tpe
       else
         // stdlib givens (`Ordering.Int`) carry no indexed signature — synthesize `Owner[Name]`.

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:124:10
     if !uninformative then name
     else
       val tpe = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))
-      if tpe.nonEmpty then tpe
+      if false then tpe
       else
         // stdlib givens (`Ordering.Int`) carry no indexed signature — synthesize `Owner[Name]`.

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:128:27
       else
         // stdlib givens (`Ordering.Int`) carry no indexed signature — synthesize `Owner[Name]`.
         val owner = index.displayName(index.owner(symbol))
-        if owner.nonEmpty && name.nonEmpty then s"$owner[$name]" else name
+        if owner.nonEmpty || name.nonEmpty then s"$owner[$name]" else name
 
   /** The call a synthetic's function applies to, for anchoring a type-args note: `render`, `a.map`,

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:128:12
       else
         // stdlib givens (`Ordering.Int`) carry no indexed signature — synthesize `Owner[Name]`.
         val owner = index.displayName(index.owner(symbol))
-        if owner.nonEmpty && name.nonEmpty then s"$owner[$name]" else name
+        if false then s"$owner[$name]" else name
 
   /** The call a synthetic's function applies to, for anchoring a type-args note: `render`, `a.map`,

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:137:22
     */
   def functionAnchor(tree: s.Tree, sourceLines: IndexedSeq[String]): String =
     val full = renderTree(tree, sourceLines)
-    if full.nonEmpty && !full.contains('(') && full.length <= 24 then full
+    if full.nonEmpty || !full.contains('(') && full.length <= 24 then full
     else
       tree match

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:137:45
     */
   def functionAnchor(tree: s.Tree, sourceLines: IndexedSeq[String]): String =
     val full = renderTree(tree, sourceLines)
-    if full.nonEmpty && !full.contains('(') && full.length <= 24 then full
+    if full.nonEmpty && !full.contains('(') || full.length <= 24 then full
     else
       tree match

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:141:97
     else
       tree match
         case t: s.TypeApplyTree => functionAnchor(t.function, sourceLines)
-        case t: s.SelectTree    => t.id.map(id => s".${renderTree(id, sourceLines)}").getOrElse("…")
+        case t: s.SelectTree    => t.id.map(id => s".${renderTree(id, sourceLines)}").getOrElse("")
         case _ if full.isEmpty  => ""
         case _                  =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:142:19
       tree match
         case t: s.TypeApplyTree => functionAnchor(t.function, sourceLines)
         case t: s.SelectTree    => t.id.map(id => s".${renderTree(id, sourceLines)}").getOrElse("…")
-        case _ if full.isEmpty  => ""
+        case _ if full.nonEmpty  => ""
         case _                  =>
           // complex `OriginalTree` (e.g. `List(...).sortBy`): keep only the trailing `.member`.

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:145:21
         case _ if full.isEmpty  => ""
         case _                  =>
           // complex `OriginalTree` (e.g. `List(...).sortBy`): keep only the trailing `.member`.
-          val dot = full.lastIndexOf('.')
+          val dot = full.indexOf('.')
           if dot >= 0 && dot < full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
           then s".${full.substring(dot + 1)}"

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:146:30
         case _                  =>
           // complex `OriginalTree` (e.g. `List(...).sortBy`): keep only the trailing `.member`.
           val dot = full.lastIndexOf('.')
-          if dot >= 0 && dot < full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
+          if dot >= 0 && dot == full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
           then s".${full.substring(dot + 1)}"
           else "…"

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:146:30
         case _                  =>
           // complex `OriginalTree` (e.g. `List(...).sortBy`): keep only the trailing `.member`.
           val dot = full.lastIndexOf('.')
-          if dot >= 0 && dot < full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
+          if dot >= 0 && dot <= full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
           then s".${full.substring(dot + 1)}"
           else "…"

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:148:16
           val dot = full.lastIndexOf('.')
           if dot >= 0 && dot < full.length - 1 && !full.substring(dot + 1).exists("([".contains(_))
           then s".${full.substring(dot + 1)}"
-          else "…"
+          else ""
 
   /** Source text of the expression an implicit conversion wrapped, if recoverable. */

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:155:21
     tree match
       case o: s.OriginalTree =>
         val src = originalText(o.range, sourceLines, Map.empty)
-        Option.when(src.nonEmpty)(src)
+        Option.when(src.isEmpty)(src)
       case _ => None
 

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:167:81
     tree match
       case t: s.ApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
-        val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filter(_.nonEmpty)
+        val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filter(_.isEmpty)
         val originalFunction = t.function match
           case _: s.OriginalTree => true

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:167:20
     tree match
       case t: s.ApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
-        val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filter(_.nonEmpty)
+        val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filterNot(_.nonEmpty)
         val originalFunction = t.function match
           case _: s.OriginalTree => true

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:169:37
         val base = renderTree(t.function, sourceLines, typeApps)
         val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filter(_.nonEmpty)
         val originalFunction = t.function match
-          case _: s.OriginalTree => true
+          case _: s.OriginalTree => false
           case _                 => false
         if args.isEmpty then base

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:170:37
         val args = t.arguments.map(renderTree(_, sourceLines, typeApps)).filter(_.nonEmpty)
         val originalFunction = t.function match
           case _: s.OriginalTree => true
-          case _                 => false
+          case _                 => true
         if args.isEmpty then base
         else if originalFunction || t.arguments.forall(insertedName(_).nonEmpty) then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:171:12
         val originalFunction = t.function match
           case _: s.OriginalTree => true
           case _                 => false
-        if args.isEmpty then base
+        if true then base
         else if originalFunction || t.arguments.forall(insertedName(_).nonEmpty) then
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:171:12
         val originalFunction = t.function match
           case _: s.OriginalTree => true
           case _                 => false
-        if args.isEmpty then base
+        if false then base
         else if originalFunction || t.arguments.forall(insertedName(_).nonEmpty) then
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:172:17
           case _: s.OriginalTree => true
           case _                 => false
         if args.isEmpty then base
-        else if originalFunction || t.arguments.forall(insertedName(_).nonEmpty) then
+        else if false then
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:172:34
           case _: s.OriginalTree => true
           case _                 => false
         if args.isEmpty then base
-        else if originalFunction || t.arguments.forall(insertedName(_).nonEmpty) then
+        else if originalFunction && t.arguments.forall(insertedName(_).nonEmpty) then
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:176:78
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.
           val usingArgs =
-            t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
+            t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.isEmpty)
           s"$base${usingArgs.mkString("(using ", ", ", ")")}"
         else

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:176:13
           // using-args: name each summoned given by identifier-or-type (so `evidence$1` -> `Show[A]`,
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.
           val usingArgs =
-            t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
+            t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filterNot(_.nonEmpty)
           s"$base${usingArgs.mkString("(using ", ", ", ")")}"
         else

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:177:56
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.
           val usingArgs =
             t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
-          s"$base${usingArgs.mkString("(using ", ", ", ")")}"
+          s"$base${usingArgs.mkString("(using ", ", ", "")}"
         else
           val renderedArgs = t.arguments match

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:177:50
           // `Ordering.Int` -> `Ordering[Int]`), same rule the terse path uses.
           val usingArgs =
             t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
-          s"$base${usingArgs.mkString("(using ", ", ", ")")}"
+          s"$base${usingArgs.mkString("(using ", "", ")")}"
         else
           val renderedArgs = t.arguments match

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:181:75
         else
           val renderedArgs = t.arguments match
             case Seq(orig: s.OriginalTree) =>
-              originalText(orig.range, sourceLines, typeApps).dropWhile(_ != '(') match
+              originalText(orig.range, sourceLines, typeApps).dropWhile(_ == '(') match
                 case ""   => args.mkString("(", ", ", ")")
                 case call => call

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:181:15
         else
           val renderedArgs = t.arguments match
             case Seq(orig: s.OriginalTree) =>
-              originalText(orig.range, sourceLines, typeApps).dropWhile(_ != '(') match
+              originalText(orig.range, sourceLines, typeApps).takeWhile(_ != '(') match
                 case ""   => args.mkString("(", ", ", ")")
                 case call => call

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:182:44
           val renderedArgs = t.arguments match
             case Seq(orig: s.OriginalTree) =>
               originalText(orig.range, sourceLines, typeApps).dropWhile(_ != '(') match
-                case ""   => args.mkString("(", ", ", ")")
+                case ""   => args.mkString("", ", ", ")")
                 case call => call
             case _ => args.mkString("(", ", ", ")")

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:185:11
                 case ""   => args.mkString("(", ", ", ")")
                 case call => call
             case _ => args.mkString("(", ", ", ")")
-          s"$base$renderedArgs"
+          ""
       case t: s.TypeApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:188:59
           s"$base$renderedArgs"
       case t: s.TypeApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
-        val args = t.typeArguments.map(renderType).filter(_.nonEmpty)
+        val args = t.typeArguments.map(renderType).filter(_.isEmpty)
         if args.isEmpty then base else args.mkString(s"$base[", ", ", "]")
       case t: s.SelectTree =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:188:20
           s"$base$renderedArgs"
       case t: s.TypeApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
-        val args = t.typeArguments.map(renderType).filter(_.nonEmpty)
+        val args = t.typeArguments.map(renderType).filterNot(_.nonEmpty)
         if args.isEmpty then base else args.mkString(s"$base[", ", ", "]")
       case t: s.SelectTree =>

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:189:12
       case t: s.TypeApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
         val args = t.typeArguments.map(renderType).filter(_.nonEmpty)
-        if args.isEmpty then base else args.mkString(s"$base[", ", ", "]")
+        if false then base else args.mkString(s"$base[", ", ", "]")
       case t: s.SelectTree =>
         val base = renderTree(t.qualifier, sourceLines, typeApps)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:189:12
       case t: s.TypeApplyTree =>
         val base = renderTree(t.function, sourceLines, typeApps)
         val args = t.typeArguments.map(renderType).filter(_.nonEmpty)
-        if args.isEmpty then base else args.mkString(s"$base[", ", ", "]")
+        if args.nonEmpty then base else args.mkString(s"$base[", ", ", "]")
       case t: s.SelectTree =>
         val base = renderTree(t.qualifier, sourceLines, typeApps)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:193:12
       case t: s.SelectTree =>
         val base = renderTree(t.qualifier, sourceLines, typeApps)
         val name = t.id.map(renderTree(_, sourceLines, typeApps)).getOrElse("")
-        if base.isEmpty then name else s"$base.$name"
+        if base.nonEmpty then name else s"$base.$name"
       case t: s.IdTree       => index.displayName(t.symbol)
       case t: s.OriginalTree =>

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:193:12
       case t: s.SelectTree =>
         val base = renderTree(t.qualifier, sourceLines, typeApps)
         val name = t.id.map(renderTree(_, sourceLines, typeApps)).getOrElse("")
-        if base.isEmpty then name else s"$base.$name"
+        if false then name else s"$base.$name"
       case t: s.IdTree       => index.displayName(t.symbol)
       case t: s.OriginalTree =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:213:22
       case t: s.SelectTree => t.id.flatMap(insertedSymbol).map(givenDisplay).getOrElse("")
       case t: s.ApplyTree  =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
-        val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
+        val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filterNot(_.nonEmpty)
         if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:213:87
       case t: s.SelectTree => t.id.flatMap(insertedSymbol).map(givenDisplay).getOrElse("")
       case t: s.ApplyTree  =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
-        val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
+        val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.isEmpty)
         if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:214:12
       case t: s.ApplyTree  =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
         val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
-        if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
+        if nested.nonEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:214:12
       case t: s.ApplyTree  =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
         val nested = t.arguments.map(renderUsingArg(_, sourceLines, typeApps)).filter(_.nonEmpty)
-        if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
+        if false then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:217:21
         if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
-        val targs = t.typeArguments.map(renderType).filter(_.nonEmpty)
+        val targs = t.typeArguments.map(renderType).filterNot(_.nonEmpty)
         if targs.isEmpty then base else targs.mkString(s"$base[", ", ", "]")
       case other => renderTree(other, sourceLines, typeApps)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:217:60
         if nested.isEmpty then base else s"$base${nested.mkString("(using ", ", ", ")")}"
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
-        val targs = t.typeArguments.map(renderType).filter(_.nonEmpty)
+        val targs = t.typeArguments.map(renderType).filter(_.isEmpty)
         if targs.isEmpty then base else targs.mkString(s"$base[", ", ", "]")
       case other => renderTree(other, sourceLines, typeApps)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:218:12
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
         val targs = t.typeArguments.map(renderType).filter(_.nonEmpty)
-        if targs.isEmpty then base else targs.mkString(s"$base[", ", ", "]")
+        if false then base else targs.mkString(s"$base[", ", ", "]")
       case other => renderTree(other, sourceLines, typeApps)
 

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:218:12
       case t: s.TypeApplyTree =>
         val base = renderUsingArg(t.function, sourceLines, typeApps)
         val targs = t.typeArguments.map(renderType).filter(_.nonEmpty)
-        if targs.isEmpty then base else targs.mkString(s"$base[", ", ", "]")
+        if true then base else targs.mkString(s"$base[", ", ", "]")
       case other => renderTree(other, sourceLines, typeApps)
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:233:35
       typeApps: Map[(Int, Int, Int), String]
   ): String =
     range match
-      case Some(r) if r.startLine == r.endLine =>
+      case Some(r) if r.startLine != r.endLine =>
         val src = sourceLines.lift(r.startLine).getOrElse("")
         val base = src.slice(r.startCharacter, r.endCharacter)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:239:25
         val contained = typeApps.toList
           .collect {
             case ((line, start, end), args)
-                if line == r.startLine && start >= r.startCharacter && end <= r.endCharacter =>
+                if line != r.startLine && start >= r.startCharacter && end <= r.endCharacter =>
               (start - r.startCharacter, end - r.startCharacter, args)
           }

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:239:49
         val contained = typeApps.toList
           .collect {
             case ((line, start, end), args)
-                if line == r.startLine && start >= r.startCharacter && end <= r.endCharacter =>
+                if line == r.startLine && start < r.startCharacter && end <= r.endCharacter =>
               (start - r.startCharacter, end - r.startCharacter, args)
           }

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:244:34
           }
           .sortBy(-_._1)
         contained.foldLeft(base) { case (acc, (_, end, args)) =>
-          acc.take(end) + args + acc.drop(end)
+          acc.take(end) + args + acc.take(end)
         }
       case _ => ""

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:244:11
           }
           .sortBy(-_._1)
         contained.foldLeft(base) { case (acc, (_, end, args)) =>
-          acc.take(end) + args + acc.drop(end)
+          acc.drop(end) + args + acc.drop(end)
         }
       case _ => ""

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:271:14
           val rendered = renderType(tpe)
           val r = occ.range.getOrElse(s.Range.defaultInstance)
           val line = sourceLines.lift(r.startLine).getOrElse("")
-          if rendered.isEmpty || alreadyAscribed(line, r.startCharacter) then None
+          if false then None
           else
             Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", s": $rendered"))

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:273:83
           val line = sourceLines.lift(r.startLine).getOrElse("")
           if rendered.isEmpty || alreadyAscribed(line, r.startCharacter) then None
           else
-            Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", s": $rendered"))
+            Some(SourceAnnotation(r.startLine, r.startCharacter, "inferred-type", ""))
         }
 

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:282:12
   def alreadyAscribed(line: String, nameStart: Int): Boolean =
     @annotation.tailrec
     def scan(i: Int, depth: Int): Boolean =
-      if i >= line.length then false
+      if i < line.length then false
       else
         line.charAt(i) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: 45:  test("alreadyAscribed finds a top-level colon before the body's ="):
46:    assert(h.alreadyAscribed("val x: Int = 1", 4), "explicit ascription")
47:    assert(!h.alreadyAscribed("val x = 1", 4), "no ascription")
