[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:282:10
   def alreadyAscribed(line: String, nameStart: Int): Boolean =
     @annotation.tailrec
     def scan(i: Int, depth: Int): Boolean =
-      if i >= line.length then false
+      if true then false
       else
         line.charAt(i) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed: no-colon line, '=' before ':', and a zero start
statusReason: 45:  test("alreadyAscribed finds a top-level colon before the body's ="):
46:    assert(h.alreadyAscribed("val x: Int = 1", 4), "explicit ascription")
47:    assert(!h.alreadyAscribed("val x = 1", 4), "no ascription")

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:290:15
           case '(' | '['         => scan(i + 1, depth + 1)
           case ')' | ']'         => scan(i + 1, depth - 1)
           case _                 => scan(i + 1, depth)
-    nameStart >= 0 && nameStart < line.length && scan(nameStart, 0)
+    nameStart == 0 && nameStart < line.length && scan(nameStart, 0)
 
   // --- move plan ------------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.alreadyAscribed finds a top-level colon before the body's =
statusReason: 45:  test("alreadyAscribed finds a top-level colon before the body's ="):
46:    assert(h.alreadyAscribed("val x: Int = 1", 4), "explicit ascription")
47:    assert(!h.alreadyAscribed("val x = 1", 4), "no ascription")

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:308:8
     */
   @pure
   def typeSymbolFqn(sym: String): String =
-    if sym == "scala/package.List#" then "scala.collection.immutable.List"
+    if true then "scala.collection.immutable.List"
     else sym.stripSuffix("#").replace('/', '.').replace('#', '.')
 

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:308:8
     */
   @pure
   def typeSymbolFqn(sym: String): String =
-    if sym == "scala/package.List#" then "scala.collection.immutable.List"
+    if false then "scala.collection.immutable.List"
     else sym.stripSuffix("#").replace('/', '.').replace('#', '.')
 

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:309:26
   @pure
   def typeSymbolFqn(sym: String): String =
     if sym == "scala/package.List#" then "scala.collection.immutable.List"
-    else sym.stripSuffix("#").replace('/', '.').replace('#', '.')
+    else sym.stripSuffix("").replace('/', '.').replace('#', '.')
 
   /** Blank out line and block comments while preserving line count and string literals. */

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:320:31
     )
   )
   def stripComments(lines: IndexedSeq[String]): IndexedSeq[String] =
-    val text = lines.mkString("\n")
+    val text = lines.mkString("")
     val out = new StringBuilder(text.length)
     // scalafix:off DisableSyntax.var

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:324:20
     val out = new StringBuilder(text.length)
     // scalafix:off DisableSyntax.var
     var i = 0
-    var inString = false
+    var inString = true
     var inChar = false
     var block = 0

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:325:18
     // scalafix:off DisableSyntax.var
     var i = 0
     var inString = false
-    var inChar = false
+    var inChar = true
     var block = 0
     while i < text.length do

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:327:11
     var inString = false
     var inChar = false
     var block = 0
-    while i < text.length do
+    while false do
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:327:13
     var inString = false
     var inChar = false
     var block = 0
-    while i < text.length do
+    while i > text.length do
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:329:24
     var block = 0
     while i < text.length do
       val c = text.charAt(i)
-      val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
+      val d = if i + 1 > text.length then text.charAt(i + 1) else '\u0000'
       if block > 0 then
         if c == '*' && d == '/' then

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:329:24
     var block = 0
     while i < text.length do
       val c = text.charAt(i)
-      val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
+      val d = if i + 1 == text.length then text.charAt(i + 1) else '\u0000'
       if block > 0 then
         if c == '*' && d == '/' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:330:10
     while i < text.length do
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
-      if block > 0 then
+      if false then
         if c == '*' && d == '/' then
           out.append("  ")

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:330:16
     while i < text.length do
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
-      if block > 0 then
+      if block >= 0 then
         if c == '*' && d == '/' then
           out.append("  ")

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:331:14
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
       if block > 0 then
-        if c == '*' && d == '/' then
+        if c != '*' && d == '/' then
           out.append("  ")
           i += 2

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:331:12
       val c = text.charAt(i)
       val d = if i + 1 < text.length then text.charAt(i + 1) else '\u0000'
       if block > 0 then
-        if c == '*' && d == '/' then
+        if true then
           out.append("  ")
           i += 2

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:336:25
           i += 2
           block -= 1
         else
-          out.append(if c == '\n' then '\n' else ' ')
+          out.append(if false then '\n' else ' ')
           i += 1
       else if inString then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:336:25
           i += 2
           block -= 1
         else
-          out.append(if c == '\n' then '\n' else ' ')
+          out.append(if true then '\n' else ' ')
           i += 1
       else if inString then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:338:15
         else
           out.append(if c == '\n' then '\n' else ' ')
           i += 1
-      else if inString then
+      else if true then
         out.append(c)
         if c == '\\' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:338:15
         else
           out.append(if c == '\n' then '\n' else ' ')
           i += 1
-      else if inString then
+      else if false then
         out.append(c)
         if c == '\\' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:340:12
           i += 1
       else if inString then
         out.append(c)
-        if c == '\\' then
+        if false then
           out.append(d)
           i += 2

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:340:12
           i += 1
       else if inString then
         out.append(c)
-        if c == '\\' then
+        if true then
           out.append(d)
           i += 2

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:344:14
           out.append(d)
           i += 2
         else
-          if c == '"' then inString = false
+          if true then inString = false
           i += 1
       else if inChar then

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:344:16
           out.append(d)
           i += 2
         else
-          if c == '"' then inString = false
+          if c != '"' then inString = false
           i += 1
       else if inChar then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:346:15
         else
           if c == '"' then inString = false
           i += 1
-      else if inChar then
+      else if false then
         out.append(c)
         if c == '\\' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:346:15
         else
           if c == '"' then inString = false
           i += 1
-      else if inChar then
+      else if true then
         out.append(c)
         if c == '\\' then

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:348:14
           i += 1
       else if inChar then
         out.append(c)
-        if c == '\\' then
+        if c != '\\' then
           out.append(d)
           i += 2

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:352:38
           out.append(d)
           i += 2
         else
-          if c == '\'' then inChar = false
+          if c == '\'' then inChar = true
           i += 1
       else if c == '"' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:352:14
           out.append(d)
           i += 2
         else
-          if c == '\'' then inChar = false
+          if true then inChar = false
           i += 1
       else if c == '"' then

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:354:15
         else
           if c == '\'' then inChar = false
           i += 1
-      else if c == '"' then
+      else if false then
         inString = true
         out.append(c)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:354:17
         else
           if c == '\'' then inChar = false
           i += 1
-      else if c == '"' then
+      else if c != '"' then
         inString = true
         out.append(c)

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:355:20
           if c == '\'' then inChar = false
           i += 1
       else if c == '"' then
-        inString = true
+        inString = false
         out.append(c)
         i += 1

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:358:17
         inString = true
         out.append(c)
         i += 1
-      else if c == '\'' then
+      else if c != '\'' then
         inChar = true
         out.append(c)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:358:15
         inString = true
         out.append(c)
         i += 1
-      else if c == '\'' then
+      else if false then
         inChar = true
         out.append(c)

[NoCoverage] BooleanLiteral
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:359:18
         out.append(c)
         i += 1
       else if c == '\'' then
-        inChar = true
+        inChar = false
         out.append(c)
         i += 1

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:362:17
         inChar = true
         out.append(c)
         i += 1
-      else if c == '/' && d == '/' then
+      else if c != '/' && d == '/' then
         while i < text.length && text.charAt(i) != '\n' do
           out.append(' ')

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:362:15
         inChar = true
         out.append(c)
         i += 1
-      else if c == '/' && d == '/' then
+      else if false then
         while i < text.length && text.charAt(i) != '\n' do
           out.append(' ')

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:363:31
         out.append(c)
         i += 1
       else if c == '/' && d == '/' then
-        while i < text.length && text.charAt(i) != '\n' do
+        while i < text.length || text.charAt(i) != '\n' do
           out.append(' ')
           i += 1

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:363:17
         out.append(c)
         i += 1
       else if c == '/' && d == '/' then
-        while i < text.length && text.charAt(i) != '\n' do
+        while i <= text.length && text.charAt(i) != '\n' do
           out.append(' ')
           i += 1

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:366:15
         while i < text.length && text.charAt(i) != '\n' do
           out.append(' ')
           i += 1
-      else if c == '/' && d == '*' then
+      else if false then
         block += 1
         out.append("  ")

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:366:24
         while i < text.length && text.charAt(i) != '\n' do
           out.append(' ')
           i += 1
-      else if c == '/' && d == '*' then
+      else if c == '/' || d == '*' then
         block += 1
         out.append("  ")

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:413:8
     */
   def localTypeText(symbol: String): String =
     val rendered = renderType(index.info(symbol).map(valueType).getOrElse(s.Type.Empty))
-    if rendered.isEmpty then "?" else rendered
+    if rendered.nonEmpty then "?" else rendered
 
   // --- path / glob predicates -----------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.localTypeText renders the type, or '?' when SemanticDB recorded none
statusReason: 189:    )
190:    assertEquals(lh.localTypeText("local0"), "Int")
191:    assertEquals(lh.localTypeText("local1"), "?", "an unascribed local has no recorded type")
values are not the same
=> Obtained
?
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:443:37
     index
       .occurrencesOf(symbol)
       .collectFirst:
-        case (uri, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => uri
+        case (uri, occ) if occ.role != s.SymbolOccurrence.Role.DEFINITION => uri
 
   // --- class hierarchy ------------------------------------------------------
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange returns None before any declaration (no enclosing def)
statusReason: 462:    val (sym, range) =
463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:482:42
   def implicitsProducing(typeSymbol: String): List[s.SymbolInformation] =
     index.symbols.values
       .collect:
-        case si if isGivenDefinition(si) && parentSymbol(producedType(si)).contains(typeSymbol) =>
+        case si if isGivenDefinition(si) || parentSymbol(producedType(si)).contains(typeSymbol) =>
           si
       .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.implicitsProducing returns only givens whose produced type matches; com.github.mercurievv.scalasemantic.analysis.AnalyzerHelpersSuite.producedType unwraps the synthetic self-class of a `given ... with`
statusReason: 246:    )
247:    assertEquals(gh.implicitsProducing("g/T#").map(_.symbol), List("g/inst."))
248:
values are not the same
=> Obtained
List(
  "g/Plain#",

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:490:8
   def isGivenDefinition(info: s.SymbolInformation): Boolean =
     val k = info.kind
     isImplicit(info) &&
-    (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
+    (k != s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
     !index.info(index.owner(info.symbol)).exists(isImplicit)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: 162:    val r = one.resolveImplicits(tpe(s"${P}Show#"))
163:    assertEquals(r.candidates.map(_.target.displayName), List("intShow"))
164:    assert(!r.candidates.head.fromExplicitImport, "synthesized, not an explicit import")
values are not the same
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:490:43
   def isGivenDefinition(info: s.SymbolInformation): Boolean =
     val k = info.kind
     isImplicit(info) &&
-    (k == s.SymbolInformation.Kind.OBJECT || k == s.SymbolInformation.Kind.METHOD) &&
+    (k == s.SymbolInformation.Kind.OBJECT && k == s.SymbolInformation.Kind.METHOD) &&
     !index.info(index.owner(info.symbol)).exists(isImplicit)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: 162:    val r = one.resolveImplicits(tpe(s"${P}Show#"))
163:    assertEquals(r.candidates.map(_.target.displayName), List("intShow"))
164:    assert(!r.candidates.head.fromExplicitImport, "synthesized, not an explicit import")
values are not the same
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:562:8
     * compiler/version did not emit.
     */
   def classSymbolOf(symbol: String): Option[String] =
-    if symbol.endsWith("#") then Some(symbol).filter(known)
+    if true then Some(symbol).filter(known)
     else if symbol.endsWith(".") then Some(symbol.dropRight(1) + "#").filter(known)
     else None
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.classSymbolOf normalises the companion spelling and rejects what the index lacks
statusReason: 231:      "querying the companion must not relate it to itself"
232:    )
233:
querying the companion must not relate it to itself
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:562:34
     * compiler/version did not emit.
     */
   def classSymbolOf(symbol: String): Option[String] =
-    if symbol.endsWith("#") then Some(symbol).filter(known)
+    if symbol.endsWith("#") then Some(symbol).filterNot(known)
     else if symbol.endsWith(".") then Some(symbol.dropRight(1) + "#").filter(known)
     else None
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] related product-record usages cover sites the class symbol misses; com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-3] related product-record usages cover sites the class symbol misses
statusReason: 81:      val full = az.findUsages(sym)
82:      assert(full.related.nonEmpty, s"[$version] no related groups for a case class")
83:      val plainLocs = (plain.definitions ++ plain.references).toSet

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:563:44
     */
   def classSymbolOf(symbol: String): Option[String] =
     if symbol.endsWith("#") then Some(symbol).filter(known)
-    else if symbol.endsWith(".") then Some(symbol.dropRight(1) + "#").filter(known)
+    else if symbol.endsWith(".") then Some(symbol.takeRight(1) + "#").filter(known)
     else None
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.classSymbolOf normalises the companion spelling and rejects what the index lacks
statusReason: 231:      "querying the companion must not relate it to itself"
232:    )
233:
querying the companion must not relate it to itself
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:563:39
     */
   def classSymbolOf(symbol: String): Option[String] =
     if symbol.endsWith("#") then Some(symbol).filter(known)
-    else if symbol.endsWith(".") then Some(symbol.dropRight(1) + "#").filter(known)
+    else if symbol.endsWith(".") then Some(symbol.dropRight(1) + "#").filterNot(known)
     else None
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.classSymbolOf normalises the companion spelling and rejects what the index lacks
statusReason: 231:      "querying the companion must not relate it to itself"
232:    )
233:
querying the companion must not relate it to itself
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:574:44
     * ``Foo#`<init>`().`` — both of which are frequently absent from the index entirely.
     */
   def companionObjectOf(classSymbol: String): Option[String] =
-    Option.when(classSymbol.endsWith("#"))(classSymbol.dropRight(1) + ".").filter(known)
+    Option.when(classSymbol.endsWith("#"))(classSymbol.takeRight(1) + ".").filter(known)
 
   /** True for a case class / case object / enum case — anything carrying SemanticDB's `CASE`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols labels exactly the generated members, and nothing else; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.companionObjectOf only derives from a class symbol
statusReason: 217:      "`helper` is a method but not a constructor parameter, so it is not an accessor"
218:    )
219:
`helper` is a method but not a constructor parameter, so it is not an accessor
=> Obtained
List(
  Tuple2(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:574:5
     * ``Foo#`<init>`().`` — both of which are frequently absent from the index entirely.
     */
   def companionObjectOf(classSymbol: String): Option[String] =
-    Option.when(classSymbol.endsWith("#"))(classSymbol.dropRight(1) + ".").filter(known)
+    Option.when(classSymbol.endsWith("#"))(classSymbol.dropRight(1) + ".").filterNot(known)
 
   /** True for a case class / case object / enum case — anything carrying SemanticDB's `CASE`
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols labels exactly the generated members, and nothing else; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.companionObjectOf only derives from a class symbol
statusReason: 217:      "`helper` is a method but not a constructor parameter, so it is not an accessor"
218:    )
219:
`helper` is a method but not a constructor parameter, so it is not an accessor
=> Obtained
List(
  Tuple2(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:580:5
     * property, i.e. the types whose construction and `copy` sites live on generated members.
     */
   def isCaseLike(symbol: String): Boolean =
-    classSymbolOf(symbol).exists { cls =>
-      index.info(cls).exists(si => (si.properties & s.SymbolInformation.Property.CASE.value) != 0)
-    }
+    classSymbolOf(symbol).forall {
+  cls => index.info(cls).exists(si => (si.properties & s.SymbolInformation.Property.CASE.value) != 0)
+}
 
   /** Symbols generated for a product record, each labelled by how it relates to the class, in a
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.isCaseLike is false for a plain class and for a symbol the index does not know
statusReason: 240:    assert(!productHelpers.isCaseLike("p/Plain#"), "no CASE property")
241:    assert(!productHelpers.isCaseLike("p/Nope#"), "an unknown symbol is not case-like")
242:    // Known only by an occurrence, with no SymbolInformation: absent properties must read as "not

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:581:7
     */
   def isCaseLike(symbol: String): Boolean =
     classSymbolOf(symbol).exists { cls =>
-      index.info(cls).exists(si => (si.properties & s.SymbolInformation.Property.CASE.value) != 0)
+      index.info(cls).forall(si => (si.properties & s.SymbolInformation.Property.CASE.value) != 0)
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.isCaseLike is false for a plain class and for a symbol the index does not know
statusReason: 243:    // a case class", never as "no evidence against it".
244:    assert(!productHelpers.isCaseLike("p/Ghost#"), "no SymbolInformation ⇒ not case-like")
245:

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:581:94
     */
   def isCaseLike(symbol: String): Boolean =
     classSymbolOf(symbol).exists { cls =>
-      index.info(cls).exists(si => (si.properties & s.SymbolInformation.Property.CASE.value) != 0)
+      index.info(cls).exists(si => (si.properties & s.SymbolInformation.Property.CASE.value) == 0)
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] related product-record usages cover sites the class symbol misses; com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-3] related product-record usages cover sites the class symbol misses
statusReason: 81:      val full = az.findUsages(sym)
82:      assert(full.related.nonEmpty, s"[$version] no related groups for a case class")
83:      val plainLocs = (plain.definitions ++ plain.references).toSet

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:589:5
     * unchecked, because Scala 2.13 and Scala 3 disagree about which of these members exist.
     */
   def relatedProductSymbols(symbol: String): List[(String, String)] =
-    classSymbolOf(symbol).filter(_ => isCaseLike(symbol)).toList.flatMap { cls =>
+    classSymbolOf(symbol).filterNot(_ => isCaseLike(symbol)).toList.flatMap { cls =>
       val decls = declarationSymbols(cls)
       val companion = companionObjectOf(cls)
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] related product-record usages cover sites the class symbol misses; com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-3] related product-record usages cover sites the class symbol misses
statusReason: 81:      val full = az.findUsages(sym)
82:      assert(full.related.nonEmpty, s"[$version] no related groups for a case class")
83:      val plainLocs = (plain.definitions ++ plain.references).toSet

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/AnalyzerHelpers.scala:592:26
     classSymbolOf(symbol).filter(_ => isCaseLike(symbol)).toList.flatMap { cls =>
       val decls = declarationSymbols(cls)
       val companion = companionObjectOf(cls)
-      val constructors = decls.filter(named("<init>"))
+      val constructors = decls.filterNot(named("<init>"))
       val paramNames = constructorParamNames(constructors)
       val related =
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols labels exactly the generated members, and nothing else; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.relatedProductSymbols works from the companion spelling and drops the queried symbol; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findUsages omits a related group whose symbol has no occurrences
statusReason: 217:      "`helper` is a method but not a constructor parameter, so it is not an accessor"
218:    )
219:
`helper` is a method but not a constructor parameter, so it is not an accessor
=> Obtained
List(
  Tuple2(
