[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:38:31
   /** True when no `*.semanticdb` file was found/loaded at all — SemanticDB likely isn't enabled or
     * the project hasn't been compiled yet, as opposed to a query simply matching nothing.
     */
-  def isIndexEmpty: Boolean = index.documents.isEmpty
+  def isIndexEmpty: Boolean = index.documents.nonEmpty
 
   /** An analyzer whose index has `code` (the live contents of the file at `fileUri`) overlaid via

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:101:33
       .map(sym => sym -> selectedMetrics(sym, dimension))
       .sortBy((_, metrics) => -rankStructureMetrics(metrics, sort))
       .take(limit.value)
-      .ensuring(res => res.size <= limit.value)
+      .ensuring(res => res.size >= limit.value)
 
   private lazy val structureResult: StructureResult = StructureMetrics(index).result()
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.rankedStructureSymbols: a non-empty pathFilter keeps only matching modules: java.lang.AssertionError: assertion failed

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:188:75
       kind: Option[String] = None
   ): Option[List[OutlineEntry]] =
     val matches: OutlineEntry => Boolean = e =>
-      query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
+      query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) ||
         symbol.forall(_ == e.symbol) &&
         kind.forall(_.equalsIgnoreCase(e.kind.value))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration
statusReason: 104:    assertEquals(top.map(_.name), List("Outer"), "the enclosing type is kept as context")
105:    assertEquals(top.head.children.map(_.name), List("Inner"), "the sibling method is dropped")
106:    assertEquals(top.head.children.head.children.map(_.name), List("deep"), "match keeps subtree")
the sibling method is dropped
=> Obtained
List(
  "Inner",

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:188:7
       kind: Option[String] = None
   ): Option[List[OutlineEntry]] =
     val matches: OutlineEntry => Boolean = e =>
-      query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
+      query.exists(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
         symbol.forall(_ == e.symbol) &&
         kind.forall(_.equalsIgnoreCase(e.kind.value))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:98
97:  test("outlineFiltered with no filters is the full outline"):
98:    assertEquals(nestedAz.outlineFiltere

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:189:25
   ): Option[List[OutlineEntry]] =
     val matches: OutlineEntry => Boolean = e =>
       query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
-        symbol.forall(_ == e.symbol) &&
+        symbol.forall(_ != e.symbol) &&
         kind.forall(_.equalsIgnoreCase(e.kind.value))
     outline(uri).map(OutlineFilter(_, matches, includeParents, maxDepth))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:118
117:      .getOrElse(fail("not indexed"))
118:    assertEquals(top.map(_.symbol), List("n/Outer#other()."))

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:189:9
   ): Option[List[OutlineEntry]] =
     val matches: OutlineEntry => Boolean = e =>
       query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
-        symbol.forall(_ == e.symbol) &&
+        symbol.exists(_ == e.symbol) &&
         kind.forall(_.equalsIgnoreCase(e.kind.value))
     outline(uri).map(OutlineFilter(_, matches, includeParents, maxDepth))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:98
97:  test("outlineFiltered with no filters is the full outline"):
98:    assertEquals(nestedAz.outlineFiltere

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:190:9
     val matches: OutlineEntry => Boolean = e =>
       query.forall(q => e.name.toLowerCase.nn.contains(q.toLowerCase.nn)) &&
         symbol.forall(_ == e.symbol) &&
-        kind.forall(_.equalsIgnoreCase(e.kind.value))
+        kind.exists(_.equalsIgnoreCase(e.kind.value))
     outline(uri).map(OutlineFilter(_, matches, includeParents, maxDepth))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:98
97:  test("outlineFiltered with no filters is the full outline"):
98:    assertEquals(nestedAz.outlineFiltere

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:210:62
     * `symbol_source`) against same-named candidates.
     */
   def dottedFqn(symbol: String): String =
-    index.ownerChain(symbol).map(index.displayName).mkString(".")
+    index.ownerChain(symbol).map(index.displayName).mkString("")
 
   /** The file and line-span of `sym`'s definition — a method's signature through the end of its

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:227:17
       uri <- DocumentUri.from(uriStr).toOption
       entries <- outline(uri)
       (startLine, endLineExclusive) <- outlineSpan(entries, sym)
-      endLine = math.max(startLine + 1, endLineExclusive.getOrElse(Int.MaxValue))
+      endLine = math.min(startLine + 1, endLineExclusive.getOrElse(Int.MaxValue))
       range <- SourceRange.from(startLine, 0, endLine, 0).toOption
     yield (uri, range)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 465:    assertEquals(range.startLine, 1)
466:    assertEquals(range.endLine, 3, "span runs up to the next sibling (m2)")
467:
span runs up to the next sibling (m2)
=> Obtained
2
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:240:25
     entries match
       case Nil           => None
       case entry :: rest =>
-        if entry.symbol == sym then Some((entry.line, rest.headOption.map(_.line)))
+        if entry.symbol != sym then Some((entry.line, rest.headOption.map(_.line)))
         else
           outlineSpan(entry.children, sym) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")
465:    assertEquals(range.startLine, 1)
anchors to the enclosing m1, not the referenced m2
=> Obtained
o/O#m2().
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:240:12
     entries match
       case Nil           => None
       case entry :: rest =>
-        if entry.symbol == sym then Some((entry.line, rest.headOption.map(_.line)))
+        if false then Some((entry.line, rest.headOption.map(_.line)))
         else
           outlineSpan(entry.children, sym) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange resolves directly when the position IS a definition; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange returns None before any declaration (no enclosing def)
statusReason: 462:    val (sym, range) =
463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:256:16
     entries.zipWithIndex
       .find { (e, i) =>
         val nextStart = entries.lift(i + 1).map(_.line).getOrElse(Int.MaxValue)
-        e.line <= line && line < nextStart
+        e.line >= line && line < nextStart
       }
       .map(_._1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 462:    val (sym, range) =
463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:256:32
     entries.zipWithIndex
       .find { (e, i) =>
         val nextStart = entries.lift(i + 1).map(_.line).getOrElse(Int.MaxValue)
-        e.line <= line && line < nextStart
+        e.line <= line && line > nextStart
       }
       .map(_._1)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 462:    val (sym, range) =
463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:284:79
       for
         hit <- typeAtPosition(uri, position)
         (defUri, range) <- symbolDefinitionRange(hit.symbol)
-        if defUri.value == uri.value && range.startLine <= position.lineValue &&
+        if defUri.value == uri.value && range.startLine <= position.lineValue ||
           position.lineValue < range.endLine
       yield (hit.symbol, range)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")
465:    assertEquals(range.startLine, 1)
anchors to the enclosing m1, not the referenced m2
=> Obtained
o/O#m2().
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:284:38
       for
         hit <- typeAtPosition(uri, position)
         (defUri, range) <- symbolDefinitionRange(hit.symbol)
-        if defUri.value == uri.value && range.startLine <= position.lineValue &&
+        if defUri.value == uri.value || range.startLine <= position.lineValue &&
           position.lineValue < range.endLine
       yield (hit.symbol, range)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position
statusReason: 463:      az.enclosingDefinitionRange(docUri("o.scala"), pos).getOrElse(fail("no enclosing def"))
464:    assertEquals(sym, "o/O#m1().", "anchors to the enclosing m1, not the referenced m2")
465:    assertEquals(range.startLine, 1)
anchors to the enclosing m1, not the referenced m2
=> Obtained
o/O#m2().
=> Diff (- expected, + obtained)

[Survived] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:285:30
         hit <- typeAtPosition(uri, position)
         (defUri, range) <- symbolDefinitionRange(hit.symbol)
         if defUri.value == uri.value && range.startLine <= position.lineValue &&
-          position.lineValue < range.endLine
+          position.lineValue > range.endLine
       yield (hit.symbol, range)
     atCursor.orElse:

[Survived] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:285:30
         hit <- typeAtPosition(uri, position)
         (defUri, range) <- symbolDefinitionRange(hit.symbol)
         if defUri.value == uri.value && range.startLine <= position.lineValue &&
-          position.lineValue < range.endLine
+          position.lineValue == range.endLine
       yield (hit.symbol, range)
     atCursor.orElse:

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:314:37
         case SourceDetail.Terse =>
           val terse = doc.synthetics.iterator.flatMap(h.syntheticAnnotation(_, sourceLines)).toList
           val elaborated = fullAnnotations(doc, sourceLines)
-            .map(a => a.copy(kind = "elaborated", text = s"elaborated: ${a.text}"))
+            .map(a => a.copy(kind = "", text = s"elaborated: ${a.text}"))
           val elaboratedLines = elaborated.map(_.line).toSet
           terse.filterNot(a => elaboratedLines.contains(a.line)) ++ elaborated

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:316:11
           val elaborated = fullAnnotations(doc, sourceLines)
             .map(a => a.copy(kind = "elaborated", text = s"elaborated: ${a.text}"))
           val elaboratedLines = elaborated.map(_.line).toSet
-          terse.filterNot(a => elaboratedLines.contains(a.line)) ++ elaborated
+          terse.filter(a => elaboratedLines.contains(a.line)) ++ elaborated
         case SourceDetail.Full =>
           fullAnnotations(doc, sourceLines)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:323:23
       // Drop the redundant `(using …)` a given/def forwards into its OWN construction: the note
       // lands on the definition's header (at or before its name), and that using-param is already
       // written in the signature. A genuine call-site using in the body sits AFTER the name.
-      val defStarts = doc.occurrences.iterator
-        .filter(_.role == s.SymbolOccurrence.Role.DEFINITION)
+      val defStarts = doc.occurrences.iterator.filterNot(_.role == s.SymbolOccurrence.Role.DEFINITION)
         .flatMap(_.range)
         .map(r => (r.startLine, r.startCharacter))

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:324:24
       // lands on the definition's header (at or before its name), and that using-param is already
       // written in the signature. A genuine call-site using in the body sits AFTER the name.
       val defStarts = doc.occurrences.iterator
-        .filter(_.role == s.SymbolOccurrence.Role.DEFINITION)
+        .filter(_.role != s.SymbolOccurrence.Role.DEFINITION)
         .flatMap(_.range)
         .map(r => (r.startLine, r.startCharacter))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:328:23
         .flatMap(_.range)
         .map(r => (r.startLine, r.startCharacter))
         .toList
-      val synthetic = synthetic0.filterNot(a =>
-        (a.kind == "implicit" || a.kind == "full") &&
-          defStarts.exists((dl, dc) => dl == a.line && dc >= a.character)
-      )
+      val synthetic = synthetic0.filter(a => (a.kind == "implicit" || a.kind == "full") && defStarts.exists((dl, dc) => dl == a.line && dc >= a.character))
       val defTypes: List[SourceAnnotation] = doc.occurrences.iterator
         .flatMap(h.defTypeAnnotation(_, sourceLines))

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:329:17
         .map(r => (r.startLine, r.startCharacter))
         .toList
       val synthetic = synthetic0.filterNot(a =>
-        (a.kind == "implicit" || a.kind == "full") &&
+        (a.kind != "implicit" || a.kind == "full") &&
           defStarts.exists((dl, dc) => dl == a.line && dc >= a.character)
       )

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:329:31
         .map(r => (r.startLine, r.startCharacter))
         .toList
       val synthetic = synthetic0.filterNot(a =>
-        (a.kind == "implicit" || a.kind == "full") &&
+        (a.kind == "implicit" && a.kind == "full") &&
           defStarts.exists((dl, dc) => dl == a.line && dc >= a.character)
       )

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:330:43
         .toList
       val synthetic = synthetic0.filterNot(a =>
         (a.kind == "implicit" || a.kind == "full") &&
-          defStarts.exists((dl, dc) => dl == a.line && dc >= a.character)
+          defStarts.exists((dl, dc) => dl != a.line && dc >= a.character)
       )
       val defTypes: List[SourceAnnotation] = doc.occurrences.iterator

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:330:59
         .toList
       val synthetic = synthetic0.filterNot(a =>
         (a.kind == "implicit" || a.kind == "full") &&
-          defStarts.exists((dl, dc) => dl == a.line && dc >= a.character)
+          defStarts.exists((dl, dc) => dl == a.line && dc > a.character)
       )
       val defTypes: List[SourceAnnotation] = doc.occurrences.iterator

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:335:14
       val defTypes: List[SourceAnnotation] = doc.occurrences.iterator
         .flatMap(h.defTypeAnnotation(_, sourceLines))
         .map { a =>
-          if a.text.startsWith(": ") then a.copy(text = s"type: ${a.text.drop(2)}")
+          if false then a.copy(text = s"type: ${a.text.drop(2)}")
           else a
         }

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:335:67
       val defTypes: List[SourceAnnotation] = doc.occurrences.iterator
         .flatMap(h.defTypeAnnotation(_, sourceLines))
         .map { a =>
-          if a.text.startsWith(": ") then a.copy(text = s"type: ${a.text.drop(2)}")
+          if a.text.startsWith(": ") then a.copy(text = s"type: ${a.text.take(2)}")
           else a
         }

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:340:38
         }
         .toList
       def annotationSortKey(a: SourceAnnotation): (Int, Int, Int, String) =
-        val kindPriority = if a.kind == "inferred-type" then 0 else 1
+        val kindPriority = if a.kind != "inferred-type" then 0 else 1
         (a.line, kindPriority, a.character, a.kind)
 

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:340:31
         }
         .toList
       def annotationSortKey(a: SourceAnnotation): (Int, Int, Int, String) =
-        val kindPriority = if a.kind == "inferred-type" then 0 else 1
+        val kindPriority = if true then 0 else 1
         (a.line, kindPriority, a.character, a.kind)
 

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:355:7
       "scala/Byte#",
       "scala/Char#",
       "scala/Double#",
-      "scala/Float#",
+      "",
       "scala/Int#",
       "scala/Long#",

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:356:7
       "scala/Char#",
       "scala/Double#",
       "scala/Float#",
-      "scala/Int#",
+      "",
       "scala/Long#",
       "scala/Short#",

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:363:7
       "java/lang/String#"
     )
     index.document(uri.value).toList.flatMap { doc =>
-      doc.occurrences.iterator
-        .map(_.symbol)
-        .filter(_.endsWith("#"))
+      doc.occurrences.iterator.map(_.symbol).filterNot(_.endsWith("#"))
         .filterNot(s => skipped.contains(s) || s.startsWith("java/lang/"))
         .toList

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:363:7
       "java/lang/String#"
     )
     index.document(uri.value).toList.flatMap { doc =>
-      doc.occurrences.iterator
-        .map(_.symbol)
-        .filter(_.endsWith("#"))
-        .filterNot(s => skipped.contains(s) || s.startsWith("java/lang/"))
+      doc.occurrences.iterator.map(_.symbol).filter(_.endsWith("#")).filter(s => skipped.contains(s) || s.startsWith("java/lang/"))
         .toList
         .distinct

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:365:28
     index.document(uri.value).toList.flatMap { doc =>
       doc.occurrences.iterator
         .map(_.symbol)
-        .filter(_.endsWith("#"))
+        .filter(_.endsWith(""))
         .filterNot(s => skipped.contains(s) || s.startsWith("java/lang/"))
         .toList

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:366:45
       doc.occurrences.iterator
         .map(_.symbol)
         .filter(_.endsWith("#"))
-        .filterNot(s => skipped.contains(s) || s.startsWith("java/lang/"))
+        .filterNot(s => skipped.contains(s) && s.startsWith("java/lang/"))
         .toList
         .distinct

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:366:61
       doc.occurrences.iterator
         .map(_.symbol)
         .filter(_.endsWith("#"))
-        .filterNot(s => skipped.contains(s) || s.startsWith("java/lang/"))
+        .filterNot(s => skipped.contains(s) || s.startsWith(""))
         .toList
         .distinct

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:370:52
         .toList
         .distinct
         .map(s => index.displayName(s) -> h.typeSymbolFqn(s))
-        .filter((name, _) => name.nonEmpty && name != "Int" && name != "String")
+        .filter((name, _) => name.nonEmpty && name == "Int" && name != "String")
         .distinct
         .sortBy(_._1)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:370:69
         .toList
         .distinct
         .map(s => index.displayName(s) -> h.typeSymbolFqn(s))
-        .filter((name, _) => name.nonEmpty && name != "Int" && name != "String")
+        .filter((name, _) => name.nonEmpty && name != "Int" && name == "String")
         .distinct
         .sortBy(_._1)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:393:12
       .document(uri.value)
       .map { doc =>
         val used: Set[String] =
-          (doc.occurrences.iterator
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
+          (doc.occurrences.iterator.filterNot(_.role == s.SymbolOccurrence.Role.REFERENCE)
             .map(_.symbol) ++
             doc.synthetics.iterator.flatMap(syn => h.treeSymbols(syn.tree)))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:393:11
       .document(uri.value)
       .map { doc =>
         val used: Set[String] =
-          (doc.occurrences.iterator
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
-            .map(_.symbol) ++
-            doc.synthetics.iterator.flatMap(syn => h.treeSymbols(syn.tree)))
-            .filter(index.isGlobal)
+          (doc.occurrences.iterator.filter(_.role == s.SymbolOccurrence.Role.REFERENCE).map(_.symbol) ++ doc.synthetics.iterator.flatMap(syn => h.treeSymbols(syn.tree))).filterNot(index.isGlobal)
             .toSet
         val membersByOwner: Map[String, List[String]] =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:394:28
       .map { doc =>
         val used: Set[String] =
           (doc.occurrences.iterator
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
+            .filter(_.role != s.SymbolOccurrence.Role.REFERENCE)
             .map(_.symbol) ++
             doc.synthetics.iterator.flatMap(syn => h.treeSymbols(syn.tree)))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:403:24
           used
             .groupBy(index.owner)
             .map((owner, syms) =>
-              owner -> syms.iterator
-                .map(index.displayName)
-                .filter(_.nonEmpty)
+              owner -> syms.iterator.map(index.displayName).filterNot(_.nonEmpty)
                 .toList
                 .distinct

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:405:25
             .map((owner, syms) =>
               owner -> syms.iterator
                 .map(index.displayName)
-                .filter(_.nonEmpty)
+                .filter(_.isEmpty)
                 .toList
                 .distinct

[NoCoverage] RegularExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:410:60
                 .distinct
                 .sorted
             )
-        val importRe = """^(\s*)import\s+(.+)\.(?:\*|given)\s*$""".r
+        val importRe = """^(\s*)import\s+(.+)\.(?:\*|given)\S*$""".r
         // Resolve the import prefix TEXT to its symbol: prefer an occurrence on the import line
         // (SemanticDB records the prefix reference), else match an owner by its last name segment.

[NoCoverage] RegularExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:410:63
                 .distinct
                 .sorted
             )
-        val importRe = """^(\s*)import\s+(.+)\.(?:\*|given)\s*$""".r
+        val importRe = """^(\s*)import\s+(.+)\.(?:\*|given)\s*""".r
         // Resolve the import prefix TEXT to its symbol: prefer an occurrence on the import line
         // (SemanticDB records the prefix reference), else match an owner by its last name segment.

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:414:11
         // Resolve the import prefix TEXT to its symbol: prefer an occurrence on the import line
         // (SemanticDB records the prefix reference), else match an owner by its last name segment.
         def prefixSymbol(lineIdx: Int, prefixText: String): Option[String] =
-          doc.occurrences.iterator
-            .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
-            .filter(o => o.range.exists(_.startLine == lineIdx))
+          doc.occurrences.iterator.filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE).filterNot(o => o.range.exists(_.startLine == lineIdx))
             .map(_.symbol)
             .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") || sym.endsWith("/")))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:414:11
         // Resolve the import prefix TEXT to its symbol: prefer an occurrence on the import line
         // (SemanticDB records the prefix reference), else match an owner by its last name segment.
         def prefixSymbol(lineIdx: Int, prefixText: String): Option[String] =
-          doc.occurrences.iterator
-            .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
+          doc.occurrences.iterator.filterNot(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
             .filter(o => o.range.exists(_.startLine == lineIdx))
             .map(_.symbol)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:415:33
         // (SemanticDB records the prefix reference), else match an owner by its last name segment.
         def prefixSymbol(lineIdx: Int, prefixText: String): Option[String] =
           doc.occurrences.iterator
-            .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
+            .filter(o => o.role != s.SymbolOccurrence.Role.REFERENCE)
             .filter(o => o.range.exists(_.startLine == lineIdx))
             .map(_.symbol)
