[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:416:53
         def prefixSymbol(lineIdx: Int, prefixText: String): Option[String] =
           doc.occurrences.iterator
             .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
-            .filter(o => o.range.exists(_.startLine == lineIdx))
+            .filter(o => o.range.exists(_.startLine != lineIdx))
             .map(_.symbol)
             .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") || sym.endsWith("/")))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:416:26
         def prefixSymbol(lineIdx: Int, prefixText: String): Option[String] =
           doc.occurrences.iterator
             .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
-            .filter(o => o.range.exists(_.startLine == lineIdx))
+            .filter(o => o.range.forall(_.startLine == lineIdx))
             .map(_.symbol)
             .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") || sym.endsWith("/")))

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:418:70
             .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
             .filter(o => o.range.exists(_.startLine == lineIdx))
             .map(_.symbol)
-            .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") || sym.endsWith("/")))
+            .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") && sym.endsWith("/")))
             .toList
             .sortBy(sym => -sym.length)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:418:48
             .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE)
             .filter(o => o.range.exists(_.startLine == lineIdx))
             .map(_.symbol)
-            .filter(sym => index.isGlobal(sym) && (sym.endsWith(".") || sym.endsWith("/")))
+            .filter(sym => index.isGlobal(sym) || (sym.endsWith(".") || sym.endsWith("/")))
             .toList
             .sortBy(sym => -sym.length)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:424:66
             .headOption
             .orElse:
               val last = prefixText.split('.').last
-              membersByOwner.keys.find(o => index.displayName(o) == last)
+              membersByOwner.keys.find(o => index.displayName(o) != last)
         lines.iterator.zipWithIndex.map { (line, i) =>
           line match

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:431:61
               val exploded =
                 for
                   pfx <- prefixSymbol(i, prefixText)
-                  members <- membersByOwner.get(pfx).filter(_.nonEmpty)
+                  members <- membersByOwner.get(pfx).filter(_.isEmpty)
                 yield
                   val sel = members match

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:431:30
               val exploded =
                 for
                   pfx <- prefixSymbol(i, prefixText)
-                  members <- membersByOwner.get(pfx).filter(_.nonEmpty)
+                  members <- membersByOwner.get(pfx).filterNot(_.nonEmpty)
                 yield
                   val sel = members match

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:435:68
                 yield
                   val sel = members match
                     case single :: Nil => single
-                    case many          => many.mkString("{", ", ", "}")
+                    case many          => many.mkString("{", ", ", "")
                   s"${indent}import $prefixText.$sel"
               exploded.getOrElse(line)

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:436:19
                   val sel = members match
                     case single :: Nil => single
                     case many          => many.mkString("{", ", ", "}")
-                  s"${indent}import $prefixText.$sel"
+                  ""
               exploded.getOrElse(line)
             case _ => line

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:452:42
   ): List[SourceAnnotation] =
     def rangeKey(r: s.Range): (Int, Int, Int) = (r.startLine, r.startCharacter, r.endCharacter)
     def contains(outer: s.Range, inner: s.Range): Boolean =
-      outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
+      outer.startLine <= inner.startLine || outer.endLine >= inner.endLine &&
         (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
         (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:452:23
   ): List[SourceAnnotation] =
     def rangeKey(r: s.Range): (Int, Int, Int) = (r.startLine, r.startCharacter, r.endCharacter)
     def contains(outer: s.Range, inner: s.Range): Boolean =
-      outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
+      outer.startLine == inner.startLine && outer.endLine >= inner.endLine &&
         (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
         (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:453:26
     def rangeKey(r: s.Range): (Int, Int, Int) = (r.startLine, r.startCharacter, r.endCharacter)
     def contains(outer: s.Range, inner: s.Range): Boolean =
       outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
-        (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
+        (outer.startLine > inner.startLine || outer.startCharacter <= inner.startCharacter) &&
         (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)
     val typeApps = doc.synthetics.iterator.flatMap { syn =>

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:453:26
     def rangeKey(r: s.Range): (Int, Int, Int) = (r.startLine, r.startCharacter, r.endCharacter)
     def contains(outer: s.Range, inner: s.Range): Boolean =
       outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
-        (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
+        (outer.startLine <= inner.startLine || outer.startCharacter <= inner.startCharacter) &&
         (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)
     val typeApps = doc.synthetics.iterator.flatMap { syn =>

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:454:62
     def contains(outer: s.Range, inner: s.Range): Boolean =
       outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
         (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
-        (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)
+        (outer.endLine > inner.endLine || outer.endCharacter < inner.endCharacter)
     val typeApps = doc.synthetics.iterator.flatMap { syn =>
       syn.tree match

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:454:24
     def contains(outer: s.Range, inner: s.Range): Boolean =
       outer.startLine <= inner.startLine && outer.endLine >= inner.endLine &&
         (outer.startLine < inner.startLine || outer.startCharacter <= inner.startCharacter) &&
-        (outer.endLine > inner.endLine || outer.endCharacter >= inner.endCharacter)
+        (outer.endLine >= inner.endLine || outer.endCharacter >= inner.endCharacter)
     val typeApps = doc.synthetics.iterator.flatMap { syn =>
       syn.tree match

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:458:70
     val typeApps = doc.synthetics.iterator.flatMap { syn =>
       syn.tree match
         case t: s.TypeApplyTree =>
-          val args = t.typeArguments.map(h.renderType).mkString("[", ", ", "]")
+          val args = t.typeArguments.map(h.renderType).mkString("[", "", "]")
           t.function match
             case s.SelectTree(q, Some(id)) =>

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:458:65
     val typeApps = doc.synthetics.iterator.flatMap { syn =>
       syn.tree match
         case t: s.TypeApplyTree =>
-          val args = t.typeArguments.map(h.renderType).mkString("[", ", ", "]")
+          val args = t.typeArguments.map(h.renderType).mkString("", ", ", "]")
           t.function match
             case s.SelectTree(q, Some(id)) =>

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:484:75
           app.function match
             case _: s.OriginalTree =>
               val r = syn.range.getOrElse(s.Range.defaultInstance)
-              val enclosed = enclosingRanges.exists(parent => parent != r && contains(parent, r))
+              val enclosed = enclosingRanges.exists(parent => parent != r || contains(parent, r))
               val text = h.renderTree(app, sourceLines, typeApps)
               Option.when(!enclosed && text.nonEmpty)(

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:484:70
           app.function match
             case _: s.OriginalTree =>
               val r = syn.range.getOrElse(s.Range.defaultInstance)
-              val enclosed = enclosingRanges.exists(parent => parent != r && contains(parent, r))
+              val enclosed = enclosingRanges.exists(parent => parent == r && contains(parent, r))
               val text = h.renderTree(app, sourceLines, typeApps)
               Option.when(!enclosed && text.nonEmpty)(

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:486:40
               val r = syn.range.getOrElse(s.Range.defaultInstance)
               val enclosed = enclosingRanges.exists(parent => parent != r && contains(parent, r))
               val text = h.renderTree(app, sourceLines, typeApps)
-              Option.when(!enclosed && text.nonEmpty)(
+              Option.when(!enclosed && text.isEmpty)(
                 SourceAnnotation(r.startLine, r.startCharacter, "full", text)
               )

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:486:37
               val r = syn.range.getOrElse(s.Range.defaultInstance)
               val enclosed = enclosingRanges.exists(parent => parent != r && contains(parent, r))
               val text = h.renderTree(app, sourceLines, typeApps)
-              Option.when(!enclosed && text.nonEmpty)(
+              Option.when(!enclosed || text.nonEmpty)(
                 SourceAnnotation(r.startLine, r.startCharacter, "full", text)
               )

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:499:30
             case _: s.OriginalTree => None
             case _                 =>
               val r = syn.range.getOrElse(s.Range.defaultInstance)
-              val enclosed = enclosingRanges.exists(parent => parent != r && contains(parent, r))
+              val enclosed = enclosingRanges.forall(parent => parent != r && contains(parent, r))
               val text = h.renderTree(app, sourceLines, typeApps)
               Option.when(!enclosed && text.nonEmpty)(

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:527:38
     // in — `copy`/`apply`/accessors keep their own names and must not be rewritten.
     val renameTargets = sym :: h
       .relatedProductSymbols(sym)
-      .collect { case ("companion" | "constructors", related) => related }
+      .collect { case ("companion" | "", related) => related }
     val edits = renameTargets
       .flatMap(index.occurrencesOf)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:566:22
     )
 
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
-      a.uri == b.uri &&
+      a.uri == b.uri ||
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:566:13
     )
 
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
-      a.uri == b.uri &&
+      a.uri != b.uri &&
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:567:90
 
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
       a.uri == b.uri &&
-        a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
+        a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line ||
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
         (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:567:48
 
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
       a.uri == b.uri &&
-        a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
+        a.range.start.line <= b.range.end.line || b.range.start.line <= a.range.end.line &&
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
         (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:568:76
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
       a.uri == b.uri &&
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
-        (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
+        (a.range.start.line != b.range.end.line || a.range.start.character == b.range.end.character) &&
         (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)
 

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:568:101
     def overlaps(a: RenameEdit, b: RenameEdit): Boolean =
       a.uri == b.uri &&
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
-        (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
+        (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) ||
         (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:569:76
       a.uri == b.uri &&
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
-        (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)
+        (b.range.start.line != a.range.end.line || b.range.start.character > a.range.end.character)
 
     val indexedEdits: List[(Int, RenameEdit)] =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:569:76
       a.uri == b.uri &&
         a.range.start.line <= b.range.end.line && b.range.start.line <= a.range.end.line &&
         (a.range.start.line != b.range.end.line || a.range.start.character < b.range.end.character) &&
-        (b.range.start.line != a.range.end.line || b.range.start.character < a.range.end.character)
+        (b.range.start.line != a.range.end.line || b.range.start.character <= a.range.end.character)
 
     val indexedEdits: List[(Int, RenameEdit)] =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:577:17
     val conflictPairs: List[(RenameEdit, RenameEdit)] =
       for
         List((idxA, editA), (idxB, editB)) <- indexedEdits.combinations(2).toList
-        if idxA != idxB && overlaps(editA, editB)
+        if idxA == idxB && overlaps(editA, editB)
       yield editA -> editB
 

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:577:25
     val conflictPairs: List[(RenameEdit, RenameEdit)] =
       for
         List((idxA, editA), (idxB, editB)) <- indexedEdits.combinations(2).toList
-        if idxA != idxB && overlaps(editA, editB)
+        if idxA != idxB || overlaps(editA, editB)
       yield editA -> editB
 

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:586:9
         editB.uri,
         editA.range,
         editB.range,
-        s"overlapping rename edits: '${editA.oldText}' -> '${editA.newText}' vs '${editB.oldText}' -> '${editB.newText}'"
+        ""
       )
     }

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:593:25
     val conflictingEdits: Set[RenameEdit] =
       conflictPairs.flatMap((a, b) => List(a, b)).toSet
 
-    val combinedEdits = plans
-      .flatMap(_.edits)
-      .distinct
-      .filterNot(conflictingEdits.contains)
+    val combinedEdits = plans.flatMap(_.edits).distinct.filter(conflictingEdits.contains)
       .sortBy(e => (e.uri, e.range.start.line, e.range.start.character))
 

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:625:35
     val toFqn = h.joinFqn(h.packageDotted(toOwner), name)
     val occs = index.occurrencesOf(sym)
     val defLoc = occs.collectFirst:
-      case (uri, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.role != s.SymbolOccurrence.Role.DEFINITION =>
         h.location(uri, occ.range)
     val defUri = defLoc.map(_.uri)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: 347:    // the definition is the DEFINITION occurrence, not the first reference (kills `== DEFINITION`->`!=`)
348:    assertEquals(plan.definition.map(_.uri), Some("pkg/a.scala"), "the def site, not a referrer")
349:    assertEquals(plan.definition.map(_.range.start.character), Some(0))
the def site, not a referrer
=> Obtained
Some(
  value = "dest/b.scala"

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:630:37
     val defUri = defLoc.map(_.uri)
     val references = occs
       .collect:
-        case (uri, occ) if occ.role == s.SymbolOccurrence.Role.REFERENCE =>
+        case (uri, occ) if occ.role != s.SymbolOccurrence.Role.REFERENCE =>
           h.location(uri, occ.range)
       .distinct
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.movePlan: per-file import edits decided by each referrer's own package
statusReason: 349:    assertEquals(plan.definition.map(_.range.start.character), Some(0))
350:    assertEquals(plan.references.size, 3, "every cross-file use")
351:    assertEquals(
every cross-file use
=> Obtained
1
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:685:29
       val occ = doc.occurrences
       // Definition occurrences of each local, used to decide inside/outside the selection.
       val defInside = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role != s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
         .map(_.symbol)
         .filter(index.isLocal)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two free-var params render with a ', ' separator
statusReason: 383:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
384:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
385:    assertEquals(plan.returns.map(_.name), List("b"), "defined inside, read after")
free var read inside
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:693:29
       // Parameters: locals READ in the selection whose definition is NOT inside it (free vars),
       // ordered by first read position, de-duplicated.
       val params = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
+        .filter(o => o.role != s.SymbolOccurrence.Role.REFERENCE && o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && !defInside.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: two free-var params render with a ', ' separator
statusReason: 383:    val plan = az.extractMethodPlan(docUri("ex.scala"), range, name).getOrElse(fail("not indexed"))
384:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
385:    assertEquals(plan.returns.map(_.name), List("b"), "defined inside, read after")
free var read inside
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:703:29
 
       // Returns: locals DEFINED inside the selection that are still READ after it.
       val readAfter = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
+        .filter(o => o.role != s.SymbolOccurrence.Role.REFERENCE && o.range.exists(afterSelection))
         .map(_.symbol)
         .toSet
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: 384:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
385:    assertEquals(plan.returns.map(_.name), List("b"), "defined inside, read after")
386:    assertEquals(plan.returnType, "Int")
defined inside, read after
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:707:29
         .map(_.symbol)
         .toSet
       val returns = occ.iterator
-        .filter(o => o.role == s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
+        .filter(o => o.role != s.SymbolOccurrence.Role.DEFINITION && o.range.exists(inSelection))
         .filter(o => index.isLocal(o.symbol) && readAfter.contains(o.symbol))
         .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: 384:    assertEquals(plan.parameters.map(_.name), List("a"), "free var read inside")
385:    assertEquals(plan.returns.map(_.name), List("b"), "defined inside, read after")
386:    assertEquals(plan.returnType, "Int")
defined inside, read after
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:725:51
       val returnType = returns match
         case Nil      => "Unit"
         case b :: Nil => b.tpe
-        case many     => many.map(_.tpe).mkString("(", ", ", ")")
+        case many     => many.map(_.tpe).mkString("", ", ", ")")
       val paramText = params.map(p => s"${p.name}: ${p.tpe}").mkString(", ")
       val signature = s"def $name($paramText): $returnType"
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: 552:    assertEquals(plan.returns.map(_.name), List("b", "c"))
553:    assertEquals(plan.returnType, "(Int, Int)")
554:    assertEquals(plan.signature, "def ex2(a: Int): (Int, Int)")
values are not the same
=> Obtained
Int, Int)
=> Diff (- expected, + obtained)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:731:26
       val args = params.map(_.name).mkString(", ")
       val call = returns match
         case Nil      => s"$name($args)"
-        case b :: Nil => s"val ${b.name} = $name($args)"
+        case b :: Nil => ""
         case many     => s"val (${many.map(_.name).mkString(", ")}) = $name($args)"
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call
statusReason: 387:    assertEquals(plan.signature, "def extracted(a: Int): Int")
388:    assertEquals(plan.call, "val b = extracted(a)")
389:    assertEquals(plan.enclosingMethod.map(_.displayName), Some("run"))
Obtained empty output!
=> Expected:
val b = extracted(a)

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:732:61
       val call = returns match
         case Nil      => s"$name($args)"
         case b :: Nil => s"val ${b.name} = $name($args)"
-        case many     => s"val (${many.map(_.name).mkString(", ")}) = $name($args)"
+        case many     => s"val (${many.map(_.name).mkString("")}) = $name($args)"
 
       val resultRange = Range(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: several escaping locals → tuple return and destructuring call
statusReason: 554:    assertEquals(plan.signature, "def ex2(a: Int): (Int, Int)")
555:    assertEquals(plan.call, "val (b, c) = ex2(a)")
556:
values are not the same
=> Obtained
val (bc) = ex2(a)
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:771:45
     index.symbols.values.iterator
       .filter(si => index.isGlobal(si.symbol))
       .filter(si => !findSymbolExcludedKinds.contains(si.kind))
-      .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
+      .filter(si => si.displayName.nonEmpty || si.displayName != "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: 506:    )
507:    assert(az.findSymbol("init").isEmpty, "<init> excluded by name even when it matches")
508:    assert(!az.findSymbol("").map(_.displayName).contains(""), "empty display name excluded")

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:774:12
       .filter(si => si.displayName.nonEmpty && si.displayName != "<init>")
       .filter { si =>
         val n = si.displayName.toLowerCase
-        if exact then n == q else n.contains(q)
+        if true then n == q else n.contains(q)
       }
       .filter(si => wantedKind.forall(k => si.kind.toString.toUpperCase == k))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol: exact vs substring, excludes <init>/params, ranks exact>prefix>substring; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: 303:      "substring, ranked exact/prefix then by length"
304:    )
305:    assertEquals(
substring, ranked exact/prefix then by length
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:781:45
       .toList
       .sortBy { si =>
         val n = si.displayName.toLowerCase
-        val rank = if n == q then 0 else if n.startsWith(q) then 1 else 2
+        val rank = if n == q then 0 else if false then 1 else 2
         (rank, si.displayName.length, si.symbol)
       }
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.findSymbol ranks exact > prefix > substring, excludes empty-named and <init>
statusReason: 505:      "exact first, then prefix, then substring — not by length alone"
506:    )
507:    assert(az.findSymbol("init").isEmpty, "<init> excluded by name even when it matches")
exact first, then prefix, then substring — not by length alone
=> Obtained
List(
  "cat",

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:839:43
       keep: String => Boolean,
       relatedKinds: Option[Set[String]]
   ): List[RelatedUsageGroup] =
-    val want: String => Boolean = kind => relatedKinds.forall(_.contains(kind))
+    val want: String => Boolean = kind => relatedKinds.exists(_.contains(kind))
     h.relatedProductSymbols(sym)
       .filter((kind, _) => want(kind))
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] related product-record usages cover sites the class symbol misses; com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-3] related product-record usages cover sites the class symbol misses
statusReason: 81:      val full = az.findUsages(sym)
82:      assert(full.related.nonEmpty, s"[$version] no related groups for a case class")
83:      val plainLocs = (plain.definitions ++ plain.references).toSet
