[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:848:21
           .collect { case (uri, occ) if keep(uri) => h.location(uri, occ.range) }
           .distinct
           .toList
-        Option.when(locs.nonEmpty)(RelatedUsageGroup(kind, related, locs))
+        Option.when(locs.isEmpty)(RelatedUsageGroup(kind, related, locs))
       }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-2.13] related product-record usages cover sites the class symbol misses; com.github.mercurievv.scalasemantic.analysis.CompatSuite.[scala-3] related product-record usages cover sites the class symbol misses
statusReason: 84:      val added = full.related.flatMap(_.locations).toSet.diff(plainLocs)
85:      assert(added.nonEmpty, s"[$version] related expansion added no new sites")
86:

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:922:87
       .collect:
         case si
             if index
-              .isMethod(si.symbol) && index.owner(si.symbol) == own && si.displayName == name =>
+              .isMethod(si.symbol) && index.owner(si.symbol) == own && si.displayName != name =>
           si.symbol
       .toList
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.findOverloads groups by owner AND name (not same-owner/-name alone)
statusReason: 144:    assertEquals(o.name, "put")
145:    assertEquals(o.overloads.map(_.symbol), List(s"${P}Box#put().", s"${P}Box#put(+1)."))
146:    assert(o.overloads.forall(_.displayName == "put"))
values are not the same
=> Obtained
List(
  "com/x/Box#get()."

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:930:9
     val inheritedOverloads = h
       .linearize(own)
       .flatMap { ancestor =>
-        h.declarationSymbols(ancestor)
-          .filter(m => index.isMethod(m) && index.displayName(m) == name)
+        h.declarationSymbols(ancestor).filterNot(m => index.isMethod(m) && index.displayName(m) == name)
           .sorted
           .flatMap(methodSignatureOf)

[NoCoverage] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:931:42
       .linearize(own)
       .flatMap { ancestor =>
         h.declarationSymbols(ancestor)
-          .filter(m => index.isMethod(m) && index.displayName(m) == name)
+          .filter(m => index.isMethod(m) || index.displayName(m) == name)
           .sorted
           .flatMap(methodSignatureOf)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:931:66
       .linearize(own)
       .flatMap { ancestor =>
         h.declarationSymbols(ancestor)
-          .filter(m => index.isMethod(m) && index.displayName(m) == name)
+          .filter(m => index.isMethod(m) && index.displayName(m) != name)
           .sorted
           .flatMap(methodSignatureOf)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1006:63
       case _          => None
     ImplicitResolution(sym, chosen, candidates)
       .ensuring(res =>
-        res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.forall(c =>
-          res.candidates.headOption.exists(_.target == c)
-        )
+        res.chosen.isDefined == (res.candidates.size == 1) && res.chosen.exists(c => res.candidates.headOption.exists(_.target == c))
       )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.resolveImplicits: candidate is not from an explicit import; chosen iff unique: java.lang.AssertionError: assertion failed

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1046:10
 
   private case class TypePattern(name: String, args: List[TypePattern]):
     def rendered: String =
-      if args.isEmpty then name else args.map(_.rendered).mkString(s"$name[", ", ", "]")
+      if true then name else args.map(_.rendered).mkString(s"$name[", ", ", "]")
 
   private def resolveImplicitTree(targetType: String): ImplicitTree =
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
736:    assertEquals(resolved.children.head.chosen.map(_.displayName), Some("intShow"))
values are not the same
=> Obtained
List(
  "Show"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1046:10
 
   private case class TypePattern(name: String, args: List[TypePattern]):
     def rendered: String =
-      if args.isEmpty then name else args.map(_.rendered).mkString(s"$name[", ", ", "]")
+      if args.nonEmpty then name else args.map(_.rendered).mkString(s"$name[", ", ", "]")
 
   private def resolveImplicitTree(targetType: String): ImplicitTree =
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
736:    assertEquals(resolved.children.head.chosen.map(_.displayName), Some("intShow"))
values are not the same
=> Obtained
List(
  "Show"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1050:7
 
   private def resolveImplicitTree(targetType: String): ImplicitTree =
     def typeSymbolForName(name: String): Option[String] =
-      index.symbols.values
-        .filter(si => index.isType(si.symbol) && si.displayName == name)
+      index.symbols.values.filterNot(si => index.isType(si.symbol) && si.displayName == name)
         .toList
         .sortBy(_.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1051:47
   private def resolveImplicitTree(targetType: String): ImplicitTree =
     def typeSymbolForName(name: String): Option[String] =
       index.symbols.values
-        .filter(si => index.isType(si.symbol) && si.displayName == name)
+        .filter(si => index.isType(si.symbol) || si.displayName == name)
         .toList
         .sortBy(_.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1051:65
   private def resolveImplicitTree(targetType: String): ImplicitTree =
     def typeSymbolForName(name: String): Option[String] =
       index.symbols.values
-        .filter(si => index.isType(si.symbol) && si.displayName == name)
+        .filter(si => index.isType(si.symbol) && si.displayName != name)
         .toList
         .sortBy(_.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1059:21
 
     def parseType(s0: String): TypePattern =
       val s = s0.trim
-      val bracket = s.indexOf('[')
+      val bracket = s.lastIndexOf('[')
       if bracket < 0 then TypePattern(s, Nil)
       else
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1060:10
     def parseType(s0: String): TypePattern =
       val s = s0.trim
       val bracket = s.indexOf('[')
-      if bracket < 0 then TypePattern(s, Nil)
+      if true then TypePattern(s, Nil)
       else
         val name = s.take(bracket).trim
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1060:18
     def parseType(s0: String): TypePattern =
       val s = s0.trim
       val bracket = s.indexOf('[')
-      if bracket < 0 then TypePattern(s, Nil)
+      if bracket > 0 then TypePattern(s, Nil)
       else
         val name = s.take(bracket).trim
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1062:20
       val bracket = s.indexOf('[')
       if bracket < 0 then TypePattern(s, Nil)
       else
-        val name = s.take(bracket).trim
+        val name = s.drop(bracket).trim
         val inside = s.drop(bracket + 1).dropRight(1)
         TypePattern(name, splitTypeArgs(inside).map(parseType))
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1063:22
       if bracket < 0 then TypePattern(s, Nil)
       else
         val name = s.take(bracket).trim
-        val inside = s.drop(bracket + 1).dropRight(1)
+        val inside = s.take(bracket + 1).dropRight(1)
         TypePattern(name, splitTypeArgs(inside).map(parseType))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1063:22
       if bracket < 0 then TypePattern(s, Nil)
       else
         val name = s.take(bracket).trim
-        val inside = s.drop(bracket + 1).dropRight(1)
+        val inside = s.drop(bracket + 1).takeRight(1)
         TypePattern(name, splitTypeArgs(inside).map(parseType))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Survived] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1068:48
 
     def splitTypeArgs(s: String): List[String] =
       val (parts, last, _) = s.foldLeft((List.empty[String], "", 0)) {
-        case ((acc, cur, depth), ',') if depth == 0 =>
+        case ((acc, cur, depth), ',') if depth != 0 =>
           (cur.trim :: acc, "", depth)
         case ((acc, cur, depth), '[') =>

[Killed] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1075:17
         case ((acc, cur, depth), ']') =>
           (acc, s"$cur]", depth - 1)
         case ((acc, cur, depth), c) =>
-          (acc, s"$cur$c", depth)
+          (acc, "", depth)
       }
       (last.trim :: parts).filter(_.nonEmpty).reverse
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
736:    assertEquals(resolved.children.head.chosen.map(_.displayName), Some("intShow"))
values are not the same
=> Obtained
List(
  "Show"

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1077:35
         case ((acc, cur, depth), c) =>
           (acc, s"$cur$c", depth)
       }
-      (last.trim :: parts).filter(_.nonEmpty).reverse
+      (last.trim :: parts).filter(_.isEmpty).reverse
 
     def unify(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1077:7
         case ((acc, cur, depth), c) =>
           (acc, s"$cur$c", depth)
       }
-      (last.trim :: parts).filter(_.nonEmpty).reverse
+      (last.trim :: parts).filterNot(_.nonEmpty).reverse
 
     def unify(
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1085:41
         tparams: Set[String],
         bindings: Map[String, TypePattern]
     ): Option[Map[String, TypePattern]] =
-      if tparams.contains(pattern.name) && pattern.args.isEmpty then
+      if tparams.contains(pattern.name) || pattern.args.isEmpty then
         bindings.get(pattern.name) match
           case Some(bound) if bound == wanted => Some(bindings)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1085:10
         tparams: Set[String],
         bindings: Map[String, TypePattern]
     ): Option[Map[String, TypePattern]] =
-      if tparams.contains(pattern.name) && pattern.args.isEmpty then
+      if false then
         bindings.get(pattern.name) match
           case Some(bound) if bound == wanted => Some(bindings)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Survived] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1087:37
     ): Option[Map[String, TypePattern]] =
       if tparams.contains(pattern.name) && pattern.args.isEmpty then
         bindings.get(pattern.name) match
-          case Some(bound) if bound == wanted => Some(bindings)
+          case Some(bound) if bound != wanted => Some(bindings)
           case Some(_)                        => None
           case None                           => Some(bindings.updated(pattern.name, wanted))

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1090:15
           case Some(bound) if bound == wanted => Some(bindings)
           case Some(_)                        => None
           case None                           => Some(bindings.updated(pattern.name, wanted))
-      else if pattern.name == wanted.name && pattern.args.size == wanted.args.size then
+      else if false then
         pattern.args.zip(wanted.args).foldLeft(Option(bindings)) {
           case (Some(acc), (p, w)) => unify(p, w, tparams, acc)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1090:64
           case Some(bound) if bound == wanted => Some(bindings)
           case Some(_)                        => None
           case None                           => Some(bindings.updated(pattern.name, wanted))
-      else if pattern.name == wanted.name && pattern.args.size == wanted.args.size then
+      else if pattern.name == wanted.name && pattern.args.size != wanted.args.size then
         pattern.args.zip(wanted.args).foldLeft(Option(bindings)) {
           case (Some(acc), (p, w)) => unify(p, w, tparams, acc)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1102:10
 
     def build(target: TypePattern, seen: Set[String]): ImplicitTree =
       val targetText = target.rendered
-      if seen.contains(targetText) then
+      if true then
         ImplicitTree(targetText, None, Nil, Nil, ambiguous = false, cycle = true)
       else
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain resolves concrete applied types into a nested tree; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 733:      az.traceImplicitChain(sym, Some("Show[List[Int]]")).resolved.getOrElse(fail("no tree"))
734:    assertEquals(resolved.chosen.map(_.displayName), Some("listShow"))
735:    assertEquals(resolved.children.map(_.targetType), List("Show[Int]"))
values are not the same
=> Obtained
None
=> Diff (- expected, + obtained)

[Survived] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1102:10
 
     def build(target: TypePattern, seen: Set[String]): ImplicitTree =
       val targetText = target.rendered
-      if seen.contains(targetText) then
+      if false then
         ImplicitTree(targetText, None, Nil, Nil, ambiguous = false, cycle = true)
       else

[Killed] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1103:77
     def build(target: TypePattern, seen: Set[String]): ImplicitTree =
       val targetText = target.rendered
       if seen.contains(targetText) then
-        ImplicitTree(targetText, None, Nil, Nil, ambiguous = false, cycle = true)
+        ImplicitTree(targetText, None, Nil, Nil, ambiguous = false, cycle = false)
       else
         val candidates = typeSymbolForName(target.name).toList.flatMap { head =>
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain guards cycles in concrete applied type dependencies
statusReason: 808:    assertEquals(cycleNode.targetType, "Show[Int]")
809:    assert(cycleNode.cycle)

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1103:62
     def build(target: TypePattern, seen: Set[String]): ImplicitTree =
       val targetText = target.rendered
       if seen.contains(targetText) then
-        ImplicitTree(targetText, None, Nil, Nil, ambiguous = false, cycle = true)
+        ImplicitTree(targetText, None, Nil, Nil, ambiguous = true, cycle = true)
       else
         val candidates = typeSymbolForName(target.name).toList.flatMap { head =>

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1128:27
               Some(h.symbolRef(si.symbol)),
               renderedCandidates,
               children,
-              ambiguous = false,
+              ambiguous = true,
               cycle = false
             )

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1129:23
               renderedCandidates,
               children,
               ambiguous = false,
-              cycle = false
+              cycle = true
             )
           case _ =>

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1137:43
               None,
               renderedCandidates,
               Nil,
-              ambiguous = candidates.size > 1,
+              ambiguous = candidates.size == 1,
               cycle = false
             )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity
statusReason: 761:    val resolved = az.traceImplicitChain(sym, Some("Show[Int]")).resolved.getOrElse(fail("no tree"))
762:    assert(resolved.ambiguous)
763:    assertEquals(resolved.chosen, None)

[Killed] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1137:43
               None,
               renderedCandidates,
               Nil,
-              ambiguous = candidates.size > 1,
+              ambiguous = candidates.size < 1,
               cycle = false
             )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.traceImplicitChain marks concrete applied type ambiguity
statusReason: 761:    val resolved = az.traceImplicitChain(sym, Some("Show[Int]")).resolved.getOrElse(fail("no tree"))
762:    assert(resolved.ambiguous)
763:    assertEquals(resolved.chosen, None)

[Survived] BooleanLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1138:23
               renderedCandidates,
               Nil,
               ambiguous = candidates.size > 1,
-              cycle = false
+              cycle = true
             )
         chosen

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1157:14
       frontier match
         case Nil                          => Nil
         case (path @ (node :: _)) :: rest =>
-          if node == toSym then path.reverse
+          if false then path.reverse
           else
             val nexts = adjacency.getOrElse(node, Nil).map(_._1).filterNot(seen.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerCoreSuite.callPath walks definition->reference edges; self path is the single node
statusReason: 187:    val p = az.callPath(method(s"${P}M#a()."), method(s"${P}M#c()."))
188:    assertEquals(p.path.map(_.displayName), List("a", "b", "c"))
189:    assertEquals(
values are not the same
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Survived] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1187:20
   ): CallHierarchy =
     val sym = symbol.value
     val adj: Map[String, List[(String, Location)]] =
-      if direction == "callers" then reverseCallGraph else callGraph
+      if direction != "callers" then reverseCallGraph else callGraph
 
     def buildNode(

[Survived] LogicalOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1196:27
         visited: Set[String]
     ): CallHierarchyNode =
       val children =
-        if remaining <= 0 || visited.contains(current) then Nil
+        if remaining <= 0 && visited.contains(current) then Nil
         else
           adj.getOrElse(current, Nil).map { (child, loc) =>
