[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1256:39
       index
         .occurrencesOf(sym)
         .collectFirst:
-          case (uri, occ) if occ.role == DEFINITION => h.location(uri, occ.range)
+          case (uri, occ) if occ.role != DEFINITION => h.location(uri, occ.range)
 
     def node(sym: String, depth: Int): ValueFlowNode =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1291:51
       val p = pos(occ)
       methodDefs.filter(m => pos(m) <= p).lastOption.exists { enclosing =>
         val mPos = pos(enclosing)
-        val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
+        val nextDef = methodDefs.find(d => pos(d) == mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1294:23
         val nextDef = methodDefs.find(d => pos(d) > mPos).map(pos)
         val body = ordered.filter { o =>
           val q = pos(o)
-          q > mPos && nextDef.forall(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
+          q > mPos && nextDef.exists(q < _) && o.role == REFERENCE && isValueRef(o.symbol)
         }
         body.lastOption.contains(occ)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1304:46
         occs.foldLeft(Option.empty[s.SymbolOccurrence]) { (acc, x) =>
           acc match
             case None      => Some(x)
-            case Some(max) => if startCol(x) > startCol(max) then Some(x) else Some(max)
+            case Some(max) => if startCol(x) >= startCol(max) then Some(x) else Some(max)
         }
 

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1313:18
         val at = h.location(uri, Some(r))
         val onLine = doc.occurrences.filter(_.range.exists(_.startLine == r.startLine))
         val receiver = onLine.exists(o =>
-          o.role == REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
+          o.role != REFERENCE && index.isMethod(o.symbol) && startCol(o) == rEnd + 1
         )
         if receiver then Flow("method_receiver", None, at)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1317:55
         )
         if receiver then Flow("method_receiver", None, at)
         else
-          val before = onLine.filter(o => startCol(o) < col)
+          val before = onLine.filter(o => startCol(o) > col)
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1317:55
         )
         if receiver then Flow("method_receiver", None, at)
         else
-          val before = onLine.filter(o => startCol(o) < col)
+          val before = onLine.filter(o => startCol(o) == col)
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1318:56
         if receiver then Flow("method_receiver", None, at)
         else
           val before = onLine.filter(o => startCol(o) < col)
-          val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
+          val methodBefore = before.filter(o => o.role != REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1321:22
           val methodBefore = before.filter(o => o.role == REFERENCE && index.isMethod(o.symbol))
           val localDefBefore =
             before.filter(o =>
-              o.role == DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol)
+              o.role != DEFINITION && index.isLocal(o.symbol) && isValueRef(o.symbol)
             )
           val maxLocalDef = maxByStartCol(localDefBefore)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1336:58
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
                 o.role == REFERENCE && isValueRef(o.symbol) &&
-                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
+                  o.range.exists(rg => rg.startCharacter == calleeEnd && rg.startCharacter < col)
               )
               val allParams = valueParamSymbols(callee.symbol)

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1336:91
               val calleeEnd = endCol(callee)
               val argIndex = onLine.count(o =>
                 o.role == REFERENCE && isValueRef(o.symbol) &&
-                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter < col)
+                  o.range.exists(rg => rg.startCharacter > calleeEnd && rg.startCharacter > col)
               )
               val allParams = valueParamSymbols(callee.symbol)

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1349:24
                   // desugars to an implicit `(using TC[A])` parameter) — all surface here as the
                   // same underlying mechanism, an implicit parameter occurrence.
                   val relation =
-                    if index.info(p).exists(h.isImplicit) then "passed_as_implicit"
+                    if false then "passed_as_implicit"
                     else "passed_as_arg"
                   Flow(relation, Some(p), at, Some(pName), coPars)

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1349:24
                   // desugars to an implicit `(using TC[A])` parameter) — all surface here as the
                   // same underlying mechanism, an implicit parameter occurrence.
                   val relation =
-                    if index.info(p).exists(h.isImplicit) then "passed_as_implicit"
+                    if index.info(p).forall(h.isImplicit) then "passed_as_implicit"
                     else "passed_as_arg"
                   Flow(relation, Some(p), at, Some(pName), coPars)

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1350:26
                   // same underlying mechanism, an implicit parameter occurrence.
                   val relation =
                     if index.info(p).exists(h.isImplicit) then "passed_as_implicit"
-                    else "passed_as_arg"
+                    else ""
                   Flow(relation, Some(p), at, Some(pName), coPars)
                 case None => Flow("passed_as_arg", None, at)

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1369:31
         case Flow("method_receiver", _, _, _, _)  => "method_receiver"
         case Flow("passed_as_arg", None, _, _, _) => "external_boundary"
         case _                                    => "discarded"
-      List("function_result", "method_receiver", "external_boundary", "discarded")
+      List("function_result", "", "external_boundary", "discarded")
         .find(cs.contains)
         .getOrElse("discarded")

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1369:71
         case Flow("method_receiver", _, _, _, _)  => "method_receiver"
         case Flow("passed_as_arg", None, _, _, _) => "external_boundary"
         case _                                    => "discarded"
-      List("function_result", "method_receiver", "external_boundary", "discarded")
+      List("function_result", "method_receiver", "external_boundary", "")
         .find(cs.contains)
         .getOrElse("discarded")

[NoCoverage] EqualityOperator
mercurievv/scalasemantic/analysis/Analyzer.scala:1395:20
           val visited2 = visited + sym
           val n = node(sym, depth)
           val nodes2 = n :: nodes
-          if depth >= limit then
+          if depth == limit then
             loop(
               rest,

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1395:14
           val visited2 = visited + sym
           val n = node(sym, depth)
           val nodes2 = n :: nodes
-          if depth >= limit then
+          if true then
             loop(
               rest,

[NoCoverage] StringLiteral
mercurievv/scalasemantic/analysis/Analyzer.scala:1421:58
               if stopOnTypeWidening then targets.partition(widened(sym, _)) else (Nil, targets)
             val widenNodes = widenTargets.map(node(_, depth + 1))
             val widenTerms =
-              widenTargets.map(t => ValueFlowTerminal(t, "type_widened", definitionLocation(t)))
+              widenTargets.map(t => ValueFlowTerminal(t, "", definitionLocation(t)))
             // A value consumed as an implicit argument that has no further in-project references
             // terminates at that implicit boundary, distinct from a plain discarded/external value.

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1426:23
             // terminates at that implicit boundary, distinct from a plain discarded/external value.
             val symTerminal =
               if edgeFlows.nonEmpty then Nil
-              else if inRelation.contains("passed_as_implicit") then
+              else if false then
                 List(ValueFlowTerminal(sym, "implicit_boundary", n.location))
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))

[NoCoverage] ConditionalExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1426:23
             // terminates at that implicit boundary, distinct from a plain discarded/external value.
             val symTerminal =
               if edgeFlows.nonEmpty then Nil
-              else if inRelation.contains("passed_as_implicit") then
+              else if true then
                 List(ValueFlowTerminal(sym, "implicit_boundary", n.location))
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))

[NoCoverage] MethodExpression
mercurievv/scalasemantic/analysis/Analyzer.scala:1430:15
                 List(ValueFlowTerminal(sym, "implicit_boundary", n.location))
               else List(ValueFlowTerminal(sym, terminalClass(flows), n.location))
             val enqueue =
-              flowTargets
-                .filterNot(visited2)
+              flowTargets.filter(visited2)
                 .map(t => (t, depth + 1, relationByTarget.get(t)))
             loop(
