[Killed] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:117:15
       (lineValue < other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
-          (if this == other then !res else true) &&
+          (if true then !res else true) &&
             (if res then !other.before(this) else true)
         )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange resolves directly when the position IS a definition
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: java.lang.AssertionError: assertion failed

[Killed] EqualityOperator
mercurievv/scalasemantic/model/InputTypes.scala:117:20
       (lineValue < other.lineValue ||
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
-          (if this == other then !res else true) &&
+          (if this != other then !res else true) &&
             (if res then !other.before(this) else true)
         )
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange resolves directly when the position IS a definition
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: java.lang.AssertionError: assertion failed

[Killed] BooleanLiteral
mercurievv/scalasemantic/model/InputTypes.scala:118:51
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
           (if this == other then !res else true) &&
-            (if res then !other.before(this) else true)
+            (if res then !other.before(this) else false)
         )
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange anchors to the enclosing def, not the callee referenced at the position; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.enclosingDefinitionRange resolves directly when the position IS a definition
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.extractMethodPlan: free-var params, escaping returns, rendered signature/call: java.lang.AssertionError: assertion failed

[Survived] ConditionalExpression
mercurievv/scalasemantic/model/InputTypes.scala:118:17
         (lineValue == other.lineValue && characterValue < other.characterValue))
         .ensuring(res =>
           (if this == other then !res else true) &&
-            (if res then !other.before(this) else true)
+            (if false then !other.before(this) else true)
         )
 

[Survived] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:264:14
         case ""           => Right(Combined)
         case "combined"   => Right(Combined)
         case "extends"    => Right(Extends)
-        case "typeRef"    => Right(TypeRef)
+        case ""    => Right(TypeRef)
         case "memberType" => Right(MemberType)
         case "call"       => Right(Call)

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:267:14
         case "typeRef"    => Right(TypeRef)
         case "memberType" => Right(MemberType)
         case "call"       => Right(Call)
-        case "implicit"   => Right(Implicit)
+        case ""   => Right(Implicit)
         case other        => Left(s"invalid structure dimension: $other")
 
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined
statusReason: 127:    assertEquals(StructureDimension.from("call"), Right(Call))
128:    assertEquals(StructureDimension.from("implicit"), Right(Implicit))
129:    assertLeft(StructureDimension.from("nope"), "invalid structure dimension")
values are not the same
=> Obtained
Left(
  value = "invalid structure dimension: implicit"

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:268:35
         case "memberType" => Right(MemberType)
         case "call"       => Right(Call)
         case "implicit"   => Right(Implicit)
-        case other        => Left(s"invalid structure dimension: $other")
+        case other        => Left("")
 
   enum StructureSort(val value: String):
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureDimension.from maps every keyword and defaults blank to Combined
statusReason: 128:    assertEquals(StructureDimension.from("implicit"), Right(Implicit))
129:    assertLeft(StructureDimension.from("nope"), "invalid structure dimension")
130:

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:284:14
         case ""            => Right(Afferent)
         case "afferent"    => Right(Afferent)
         case "efferent"    => Right(Efferent)
-        case "instability" => Right(Instability)
+        case "" => Right(Instability)
         case "layer"       => Right(Layer)
         case "centrality"  => Right(Centrality)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:136
135:    assertEquals(StructureSort.from("efferent"), Right(Efferent))
136:    assertEquals(StructureSor

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:285:14
         case "afferent"    => Right(Afferent)
         case "efferent"    => Right(Efferent)
         case "instability" => Right(Instability)
-        case "layer"       => Right(Layer)
+        case ""       => Right(Layer)
         case "centrality"  => Right(Centrality)
         case "sccSize"     => Right(SccSize)
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.StructureSort.from maps every keyword and defaults blank to Afferent: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:137
136:    assertEquals(StructureSort.from("instability"), Right(Instability))
137:    assertEquals(Struct

[Killed] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:299:14
   object SourceFormat:
     def from(value: String): SourceFormat =
       value.trim match
-        case "compilable" => Compilable
+        case "" => Compilable
         case "plain"      => Plain
         case "diff"       => Diff
killedBy: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceFormat.from recognises compilable/plain and defaults to Annotated
statusReason: com.github.mercurievv.scalasemantic.model.InputTypesSuite.SourceFormat.from recognises compilable/plain and defaults to Annotated: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/model/InputTypesSuite.scala:144
143:    import SourceFormat.*
144:    assertEquals(SourceFormat.from("compilable"), Compilable)
145:

[Survived] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:301:14
       value.trim match
         case "compilable" => Compilable
         case "plain"      => Plain
-        case "diff"       => Diff
+        case ""       => Diff
         case _            => Annotated
 

[NoCoverage] StringLiteral
mercurievv/scalasemantic/model/InputTypes.scala:311:14
   object SourceDetail:
     def from(value: String): SourceDetail =
       value.trim match
-        case "full" => Full
+        case "" => Full
         case _      => Terse
 
