[Killed] StringLiteral
scalasemantic/analysis/graph/StructureMetrics.scala:17:37
 
   private val graphs = new DependencyGraphs(index)
   private val nodes = graphs.nodes
-  private val dimensionNames = List("extends", "typeRef", "memberType", "call", "implicit")
+  private val dimensionNames = List("", "typeRef", "memberType", "call", "implicit")
 
   def result(): StructureResult =
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations: java.util.NoSuchElementException: key not found:
