[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:29:46
       case (_, occ) if occ.role == s.SymbolOccurrence.Role.DEFINITION => occ.symbol
     }.toSet
     index.symbols.values.iterator.collect {
-      case si if defined.contains(si.symbol) && includeNode(si) => si.symbol
+      case si if defined.contains(si.symbol) || includeNode(si) => si.symbol
     }.toSet
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are in-project classes and type definitions; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: 147:      Set("core/A#", "core/Alias#", "core/B#", "core/X#", "core/Y#", "app/C#")
148:    )
149:
values are not the same
=> Obtained
HashSet(
  "app/C#",

[Killed] StringLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:36:5
     "extends" -> extendsObservations,
     "typeRef" -> typeRefObservations,
     "memberType" -> memberTypeObservations,
-    "call" -> callObservations,
+    "" -> callObservations,
     "implicit" -> implicitObservations
   )
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: call

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:61:42
   /** `extends`: a type → the in-project types it directly extends. */
   private def extendsObservations: List[(String, String)] =
     nodes.toList.flatMap { n =>
-      parentsOf(n).collect { case p if p != n && nodes.contains(p) => n -> p }
+      parentsOf(n).collect { case p if p == n && nodes.contains(p) => n -> p }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: app/C#

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:61:47
   /** `extends`: a type → the in-project types it directly extends. */
   private def extendsObservations: List[(String, String)] =
     nodes.toList.flatMap { n =>
-      parentsOf(n).collect { case p if p != n && nodes.contains(p) => n -> p }
+      parentsOf(n).collect { case p if p != n || nodes.contains(p) => n -> p }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:165
164:      "no in-project parent"
165:    )
166:
no in-project parent
=> Obtained
Set(
  "java/lang/O

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:71:37
     nodes.toList.flatMap { n =>
       (index.info(n).toList.flatMap(si => typeDefinitionRefs(si.signature)) ++
         typeDefinitionOccurrenceRefs.getOrElse(n, Nil))
-        .collect { case t if t != n && nodes.contains(t) => n -> t }
+        .collect { case t if t != n || nodes.contains(t) => n -> t }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:153
152:    assertEquals(graphs.dimensions("extends")("core/X#"), Set("core/Y#"))
153:    assertEquals(g

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:71:32
     nodes.toList.flatMap { n =>
       (index.info(n).toList.flatMap(si => typeDefinitionRefs(si.signature)) ++
         typeDefinitionOccurrenceRefs.getOrElse(n, Nil))
-        .collect { case t if t != n && nodes.contains(t) => n -> t }
+        .collect { case t if t == n && nodes.contains(t) => n -> t }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: core/Alias#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:80:32
       declarationSymbols(n)
         .flatMap(m => index.info(m).toList)
         .flatMap(mi => signatureTypeRefs(mi.signature))
-        .collect { case t if t != n && nodes.contains(t) => n -> t }
+        .collect { case t if t == n && nodes.contains(t) => n -> t }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: dependency weight counts collapsed semantic observations
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: java.util.NoSuchElementException: key not found: core/B#

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:80:37
       declarationSymbols(n)
         .flatMap(m => index.info(m).toList)
         .flatMap(mi => signatureTypeRefs(mi.signature))
-        .collect { case t if t != n && nodes.contains(t) => n -> t }
+        .collect { case t if t != n || nodes.contains(t) => n -> t }
     }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: 185:    assertEquals(a.afferent, 3, "A is depended on by B, Alias, and C")
186:    assertEquals(a.efferent, 0)
187:    assertEquals(a.instability, 0.0)
values are not the same
=> Obtained
1
=> Diff (- expected, + obtained)

[Killed] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:106:32
       .flatMap { (caller, callee) =>
         val from = index.owner(caller)
         val to = index.owner(callee)
-        Option.when(from != to && nodes.contains(from) && nodes.contains(to))(from -> to)
+        Option.when(from != to || nodes.contains(from) && nodes.contains(to))(from -> to)
       }
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: per-type coupling, instability, and cycle membership
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/graph/StructureMetricsSuite.scala:155
154:    assertEquals(graphs.dimensions("memberType")("core/B#"), Set("core/A#"))
155:    assertEqual

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:131:17
     si.signature match
       case _: s.ClassSignature => isTopLevel(si.symbol)
       case _: s.TypeSignature  =>
-        si.kind == s.SymbolInformation.Kind.TYPE &&
+        si.kind != s.SymbolInformation.Kind.TYPE &&
         (isTopLevel(si.symbol) || isTopLevel(index.owner(si.symbol)))
       case _ => false
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are in-project classes and type definitions; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment
statusReason: 147:      Set("core/A#", "core/Alias#", "core/B#", "core/X#", "core/Y#", "app/C#")
148:    )
149:
values are not the same
=> Obtained
HashSet(
  "app/C#",

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:131:50
     si.signature match
       case _: s.ClassSignature => isTopLevel(si.symbol)
       case _: s.TypeSignature  =>
-        si.kind == s.SymbolInformation.Kind.TYPE &&
+        si.kind == s.SymbolInformation.Kind.TYPE ||
         (isTopLevel(si.symbol) || isTopLevel(index.owner(si.symbol)))
       case _ => false

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:132:32
       case _: s.ClassSignature => isTopLevel(si.symbol)
       case _: s.TypeSignature  =>
         si.kind == s.SymbolInformation.Kind.TYPE &&
-        (isTopLevel(si.symbol) || isTopLevel(index.owner(si.symbol)))
+        (isTopLevel(si.symbol) && isTopLevel(index.owner(si.symbol)))
       case _ => false
 

[Killed] BooleanLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:133:17
       case _: s.TypeSignature  =>
         si.kind == s.SymbolInformation.Kind.TYPE &&
         (isTopLevel(si.symbol) || isTopLevel(index.owner(si.symbol)))
-      case _ => false
+      case _ => true
 
   /** Returns true if the symbol is a top-level type (its owner is a package, not another type).
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.nodes are in-project classes and type definitions; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs: one graph per dimension; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup
statusReason: 147:      Set("core/A#", "core/Alias#", "core/B#", "core/X#", "core/Y#", "app/C#")
148:    )
149:
values are not the same
=> Obtained
HashSet(
  "app/C#",

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:189:25
       )
       ordered.zipWithIndex.collect {
         case (occ, idx)
-            if occ.role == s.SymbolOccurrence.Role.DEFINITION &&
+            if occ.role != s.SymbolOccurrence.Role.DEFINITION &&
               nodes.contains(occ.symbol) &&
               index
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:189:63
       )
       ordered.zipWithIndex.collect {
         case (occ, idx)
-            if occ.role == s.SymbolOccurrence.Role.DEFINITION &&
+            if occ.role == s.SymbolOccurrence.Role.DEFINITION ||
               nodes.contains(occ.symbol) &&
               index

[Survived] LogicalOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:190:42
       ordered.zipWithIndex.collect {
         case (occ, idx)
             if occ.role == s.SymbolOccurrence.Role.DEFINITION &&
-              nodes.contains(occ.symbol) &&
+              nodes.contains(occ.symbol) ||
               index
                 .info(occ.symbol)

[Survived] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:191:15
         case (occ, idx)
             if occ.role == s.SymbolOccurrence.Role.DEFINITION &&
               nodes.contains(occ.symbol) &&
-              index
-                .info(occ.symbol)
-                .exists(_.signature match
-                  case _: s.TypeSignature => true
-                  case _ => false) =>
+              index.info(occ.symbol).forall(_.signature match {
+  case _: s.TypeSignature => true
+  case _ => false
+}) =>
           val refs = ordered
             .drop(idx + 1)

[Killed] BooleanLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:194:46
               index
                 .info(occ.symbol)
                 .exists(_.signature match
-                  case _: s.TypeSignature => true
+                  case _: s.TypeSignature => false
                   case _ => false) =>
           val refs = ordered
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Survived] BooleanLiteral
scalasemantic/analysis/graph/DependencyGraphs.scala:195:29
                 .info(occ.symbol)
                 .exists(_.signature match
                   case _: s.TypeSignature => true
-                  case _ => false) =>
+                  case _ => true) =>
           val refs = ordered
             .drop(idx + 1)

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:196:22
                 .exists(_.signature match
                   case _: s.TypeSignature => true
                   case _ => false) =>
-          val refs = ordered
-            .drop(idx + 1)
-            .takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION)
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
+          val refs = ordered.drop(idx + 1).takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION).filterNot(_.role == s.SymbolOccurrence.Role.REFERENCE)
             .map(_.symbol)
             .filter(nodes.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Killed] MethodExpression
scalasemantic/analysis/graph/DependencyGraphs.scala:196:22
                 .exists(_.signature match
                   case _: s.TypeSignature => true
                   case _ => false) =>
-          val refs = ordered
-            .drop(idx + 1)
-            .takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION)
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
-            .map(_.symbol)
-            .filter(nodes.contains)
+          val refs = ordered.drop(idx + 1).takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION).filter(_.role == s.SymbolOccurrence.Role.REFERENCE).map(_.symbol).filterNot(nodes.contains)
             .toList
           occ.symbol -> refs
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:198:31
                   case _ => false) =>
           val refs = ordered
             .drop(idx + 1)
-            .takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION)
+            .takeWhile(_.role == s.SymbolOccurrence.Role.DEFINITION)
             .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
             .map(_.symbol)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:199:28
           val refs = ordered
             .drop(idx + 1)
             .takeWhile(_.role != s.SymbolOccurrence.Role.DEFINITION)
-            .filter(_.role == s.SymbolOccurrence.Role.REFERENCE)
+            .filter(_.role != s.SymbolOccurrence.Role.REFERENCE)
             .map(_.symbol)
             .filter(nodes.contains)
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty
statusReason: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.typeRefGraph: type definition RHS occurrence creates an edge even when bounds are empty: java.util.NoSuchElementException: key not found: ta/Alias#

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:257:37
 
   private def definitionUri(symbol: String): Option[String] =
     index.occurrences.collectFirst:
-      case (uri, occ) if occ.symbol == symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.symbol != symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
         uri
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: 171:    assertEquals(graphs.moduleOf("core/A#"), "core")
172:    assertEquals(graphs.moduleOf("app/C#"), "app")
173:    assertEquals(graphs.moduleOf("nope/Z#"), "<unknown>", "no definition occurrence")
values are not the same
=> Obtained
core
=> Diff (- expected, + obtained)

[Killed] EqualityOperator
scalasemantic/analysis/graph/DependencyGraphs.scala:257:59
 
   private def definitionUri(symbol: String): Option[String] =
     index.occurrences.collectFirst:
-      case (uri, occ) if occ.symbol == symbol && occ.role == s.SymbolOccurrence.Role.DEFINITION =>
+      case (uri, occ) if occ.symbol == symbol && occ.role != s.SymbolOccurrence.Role.DEFINITION =>
         uri
 
killedBy: com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.DependencyGraphs.combined unions the dimensions; moduleOf reads the uri segment; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: cycles and module rollup; com.github.mercurievv.scalasemantic.analysis.graph.StructureMetricsSuite.StructureMetrics: a module cycle flags its modules and edges, acyclic ones stay clean
statusReason: 170:    assertEquals(graphs.combined("core/B#"), Set("core/A#"))
171:    assertEquals(graphs.moduleOf("core/A#"), "core")
172:    assertEquals(graphs.moduleOf("app/C#"), "app")
values are not the same
=> Obtained
<unknown>
=> Diff (- expected, + obtained)
