[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:29:10
       maxDepth: Option[Int]
   ): List[OutlineEntry] =
     def truncate(entry: OutlineEntry, depth: Int): OutlineEntry =
-      if maxDepth.exists(depth >= _) then entry.copy(children = Nil)
+      if false then entry.copy(children = Nil)
       else entry.copy(children = entry.children.map(truncate(_, depth + 1)))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: 124:    assertEquals(depth1.map(_.name), List("Inner"))
125:    assertEquals(depth1.head.children, Nil, "maxDepth=1 keeps the match alone")
126:    // …and on its own it is a plain depth limit over the whole file.
maxDepth=1 keeps the match alone
=> Obtained
List(
  OutlineEntry(

[Killed] MethodExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:29:10
       maxDepth: Option[Int]
   ): List[OutlineEntry] =
     def truncate(entry: OutlineEntry, depth: Int): OutlineEntry =
-      if maxDepth.exists(depth >= _) then entry.copy(children = Nil)
+      if maxDepth.forall(depth >= _) then entry.copy(children = Nil)
       else entry.copy(children = entry.children.map(truncate(_, depth + 1)))
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:98
97:  test("outlineFiltered with no filters is the full outline"):
98:    assertEquals(nestedAz.outlineFiltere

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:33:10
       else entry.copy(children = entry.children.map(truncate(_, depth + 1)))
 
     def asRoots(entry: OutlineEntry): List[OutlineEntry] =
-      if matches(entry) then List(truncate(entry, 1))
+      if false then List(truncate(entry, 1))
       else entry.children.flatMap(asRoots)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: 111:      .getOrElse(fail("not indexed"))
112:    assertEquals(top.map(_.name), List("Inner"))
113:
values are not the same
=> Obtained
Nil
=> Diff (- expected, + obtained)

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:33:10
       else entry.copy(children = entry.children.map(truncate(_, depth + 1)))
 
     def asRoots(entry: OutlineEntry): List[OutlineEntry] =
-      if matches(entry) then List(truncate(entry, 1))
+      if true then List(truncate(entry, 1))
       else entry.children.flatMap(asRoots)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: 111:      .getOrElse(fail("not indexed"))
112:    assertEquals(top.map(_.name), List("Inner"))
113:
values are not the same
=> Obtained
List(
  "Outer"

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:37:10
       else entry.children.flatMap(asRoots)
 
     def withContext(entry: OutlineEntry): Option[OutlineEntry] =
-      if matches(entry) then Some(truncate(entry, 1))
+      if false then Some(truncate(entry, 1))
       else
         entry.children.flatMap(withContext) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered with no filters is the full outline: munit.ComparisonFailException: /home/runner/work/ScalaSemantic/ScalaSemantic/analysis/src/test/scala/com/github/mercurievv/scalasemantic/analysis/AnalyzerToolsSuite.scala:98
97:  test("outlineFiltered with no filters is the full outline"):
98:    assertEquals(nestedAz.outlineFiltere

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:37:10
       else entry.children.flatMap(asRoots)
 
     def withContext(entry: OutlineEntry): Option[OutlineEntry] =
-      if matches(entry) then Some(truncate(entry, 1))
+      if true then Some(truncate(entry, 1))
       else
         entry.children.flatMap(withContext) match
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered returns an empty outline when nothing matches, not the whole file
statusReason: 104:    assertEquals(top.map(_.name), List("Outer"), "the enclosing type is kept as context")
105:    assertEquals(top.head.children.map(_.name), List("Inner"), "the sibling method is dropped")
106:    assertEquals(top.head.children.head.children.map(_.name), List("deep"), "match keeps subtree")
the sibling method is dropped
=> Obtained
List(
  "Inner",

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:43:8
           case Nil      => None
           case retained => Some(entry.copy(children = retained))
 
-    if includeParents then entries.flatMap(withContext)
+    if false then entries.flatMap(withContext)
     else entries.flatMap(asRoots)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered query keeps the match and its enclosing scopes as context
statusReason: 103:      .getOrElse(fail("not indexed"))
104:    assertEquals(top.map(_.name), List("Outer"), "the enclosing type is kept as context")
105:    assertEquals(top.head.children.map(_.name), List("Inner"), "the sibling method is dropped")
the enclosing type is kept as context
=> Obtained
List(
  "Inner"

[Killed] ConditionalExpression
mercurievv/scalasemantic/analysis/OutlineFilter.scala:43:8
           case Nil      => None
           case retained => Some(entry.copy(children = retained))
 
-    if includeParents then entries.flatMap(withContext)
+    if true then entries.flatMap(withContext)
     else entries.flatMap(asRoots)
 
killedBy: com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered includeParents=false returns matches as roots; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered symbol matches one exact declaration; com.github.mercurievv.scalasemantic.analysis.AnalyzerToolsSuite.outlineFiltered maxDepth bounds the subtree kept below a match, not the file
statusReason: 111:      .getOrElse(fail("not indexed"))
112:    assertEquals(top.map(_.name), List("Inner"))
113:
values are not the same
=> Obtained
List(
  "Outer"
