[Survived] ConditionalExpression
scalasemantic/analysis/graph/GraphMetrics.scala:136:26
           val inflow = dependents
             .getOrElse(node, Set.empty)
             .iterator
-            .map(m => if outDegree.getOrElse(m, 0) == 0 then 0.0 else rank(m) / outDegree(m))
+            .map(m => if false then 0.0 else rank(m) / outDegree(m))
             .sum
           node -> (base + damping * inflow)
